[
    {
        "Name": "ArcelorMittal Nippon Steel India Limited (AM/NS India)",
        "description": "AM/NSINDIAArcelorMittal Nippon Steel India Limited (AM/NS India)About AM/NS:ArcelorMittal Nippon Steel India is an integrated flat carbon steel manufacturer- from iron ore to ready-to- marketproducts with an achievable crude steel capacity of 9 MTPA. Our manufacturing facilities comprise of iron making,steelmaking and downstream facilities spread across India. We are a young, dynamic & global organization. We standout for our commitment on innovation & continuous improvement and are on a mission to create Smarter Steels for aBrighter future. For us, our employees and their development are at the core. We collaborate with Industry experts andwork along with the latest technologies. We also ensure our commitment toenvironmental responsibility, ensuring that our manufacturing processes are sustainable and create impact in thecommunities we operate.Our vision is to be a leading and responsible steelmaker creating value for all stakeholders to achieve this vision, we arealways looking for dynamic and highly motivated engineering graduates. As an engineering graduate, you will have theopportunity to work closely with highly experienced professionals of different domains in various innovative projects.Position: Graduate Engineer Trainee (GET)Function: Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, MiningLocation: Any of AM/NS India locationsCTC: Incentives 6 LPA Lakhs per annum + other benefits such as Housing, Medical Insurance, Canteen facility, Travelfacility, Hospitalization Coverage, Higher Education support, Mobile Phone Data Card, etc. as per company policies.Selection Process: Online Test followed by a Technical and Personal InterviewResponsibilities:The Graduate Engineer Trainees will be on a training period for 12 months from thedate of joining during which they will be assigned projects within the domain. A GET isdesignated with the opportunity to work in cutting- edge facilities, contributing to theentire steel manufacturing process. From iron making to downstream operations andcrucial role in delivering high-quality steel products to the market. It's a chance toshowcase one's expertise and make a significant impact in the industry.Educational Qualifications/Shortlisting Criteria:• B.E. / B.Tech (Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy,Mining) At least 65% throughout the academic career with no active backlogs during at the time of applying for the role.• 65% & above in SSC• 65% & above in HSC• 65% & above in B.E. / B.Tech all semesters• No live ATKT and no year drop/down.Behavioral Skills:• Strong interpersonal, problem solving and project management skills• Excellent communication and interpersonal skills• Analytical and data driven to ensure structured approach to a problem• Ability to work in a highly entrepreneurial environment.• Willing to relocate to any of AM/NS India locations across any technology.",
        "Keys": [
            {
                "key": "Roles",
                "value": "Graduate Engineer Trainee (GET)"
            },
            {
                "key": "Location",
                "value": "Any of AM/NS India locations"
            },
            {
                "key": "CTC",
                "value": 600000
            },
            {
                "key": "Selection Process",
                "value": "Online Test followed by a Technical and Personal Interview"
            },
            {
                "key": "Responsibilities",
                "value": "The Graduate Engineer Trainees will be on a training period for 12 months from thedate of joining during which they will be assigned projects within the domain. A GET isdesignated with the opportunity to work in cutting- edge facilities, contributing to theentire steel manufacturing process. From iron making to downstream operations andcrucial role in delivering high-quality steel products to the market. It's a chance toshowcase one's expertise and make a significant impact in the industry."
            },
            {
                "key": "Qualifications",
                "value": "B.E. / B.Tech (Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining) At least 65% throughout the academic career with no active backlogs during at the time of applying for the role.• 65% & above in SSC• 65% & above in HSC• 65% & above in B.E. / B.Tech all semesters• No live ATKT and no year drop/down."
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.E. / B.Tech (Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining)"
            }
        ]
    },
    {
        "Name": "Solar Industries",
        "description": "S SOLAR Solar Industries1. Position Title: IIoT Intern (Control Room)Post Duration: 6 MonthsDays of Work: 6 days a week (1 day rotational off) & 8 hours Rotational ShiftInternship Type: PaidJob Location: Solar Plant (Chakdoh)",
        "Keys": [
            {
                "key": "Roles",
                "value": "IIoT Intern (Control Room)"
            },
            {
                "key": "Location",
                "value": "Solar Plant (Chakdoh)"
            }
        ]
    },
    {
        "Name": "JTP",
        "description": "JTP is a listed company on JASDAQ (Japanese Stock exchange) as JTP 2488. Our portfolio encapsulates services and products in ROBOTICS, Hardware / Software development, Pharma and Human resource development. Our head office is in Japan with branch offices in the USA, India, Korea, and many other countries. JTP has over 35 years of experience in the Japanese market. We work with clients such as EMC, SAP, Hitachi, NVIDIA, Softbank, Mitsubishi etc. Job role: System engineer CTC: 24 LPA Location: Japan The hiring process will be as follows: Step 1: Application. Step 2: Selection for technical assessments. Step 3: Technical assessment Step 4: English Interview (Please note students with insufficient international level English skills will be eliminated. Students with Mother Tongue influence will be eliminated) Step 5: Virtual Training + Project round. Step 6: Golden ticket opportunity for few students* Step 7: CEO panel Interview. Eligibility branches: CS, IT, EC, E&TC, MCA, BCA. Eligibility criterion: All students who are passionate for IT. (No merit criterion)",
        "Keys": [
            {
                "key": "Job Role",
                "value": "System engineer"
            },
            {
                "key": "CTC",
                "value": 24
            },
            {
                "key": "Location",
                "value": "Japan"
            },
            {
                "key": "Selection Process",
                "value": "Step 1: Application. Step 2: Selection for technical assessments. Step 3: Technical assessment Step 4: English Interview (Please note students with insufficient international level English skills will be eliminated. Students with Mother Tongue influence will be eliminated) Step 5: Virtual Training + Project round. Step 6: Golden ticket opportunity for few students* Step 7: CEO panel Interview."
            },
            {
                "key": "Eligibility",
                "value": "branches: CS, IT, EC, E&TC, MCA, BCA. Eligibility criterion: All students who are passionate for IT. (No merit criterion)"
            },
            {
                "key": "multinational company",
                "value": "Yes, with branch offices in the USA, India, Korea, and many other countries"
            }
        ]
    },
    {
        "Name": "Darwinbox",
        "description": "Darwinbox is Asia's fastest-growing SaaS-based HR Technology platform. A brainchild of alumni from the country's most distinguished institutions (IIT/IIM/XLRI) and organizations (McKinsey, EY, Google), Darwinbox is the preferred technology partner of 500+ global enterprises with more than 1 million+ employees using the platform. Our end-to-end HCM technology suite competes with the best in the business and has won against giants such as SAP, Oracle, and Workday several times to acquire iconic enterprise customers ranging from the largest conglomerates to unicorns - Adani, Mahindra, Kotak, TVS, Arvind, Nivea, Puma, Swiggy, Paytm, Bigbasket and Delhivery etc. The rate at which our product and market presence is growing is unprecedented. We're a rocketship. We're not planning on slowing down anytime soon. And, that's why we need you! Designation: Intern- Product Development (The role can be converted to full time Software Engineer) Duration & Stipend: 6 Months, 25k per month CTC: 16,30,000 LPA Location: Hyderabad Roles and Responsibilities: Coding Product Development Backend or Front-end Development As fitment with the organization culture is very important you will immensely like the job if you: Enjoy working in a fast-paced company environment. Should be stack agnostic and should not have any tech prejudice. Prefer a non-hierarchical, independent, and non-pushy environment. Are self-motivated to take up a high degree of ownership. Passionate about programming and can't sleep without coding. Min. Eligibility: B.Tech (CSE/IT) 2025, Minimum 60%( No Backlogs) Selection Process: Coding Rounds- 1 & 2 Technical Interviews HR & Management Interview",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Intern- Product Development (The role can be converted to full time Software Engineer)"
            },
            {
                "key": "Stipend",
                "value": 25000
            },
            {
                "key": "CTC",
                "value": 1630000
            },
            {
                "key": "Location",
                "value": "Hyderabad"
            },
            {
                "key": "Roles",
                "value": "Coding Product Development Backend or Front-end Development"
            },
            {
                "key": "Eligibility",
                "value": "B.Tech (CSE/IT) 2025, Minimum 60%( No Backlogs)"
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.Tech (CSE/IT) 2025"
            },
            {
                "key": "Selection Process",
                "value": "Coding Rounds- 1 & 2 Technical Interviews HR & Management Interview"
            },
            {
                "key": "Oracle",
                "value": "Yes, competes with giants such as SAP, Oracle"
            }
        ]
    }
]