[
    {
        "Name": "Nvidia",
        "description": "Nvidia NVIDIA Job Role: QA Tool and Test Development Intern. Stipend : 40k Location : Pune, Bangalore, Hyderabad What you will be doing: • The intern will help us build tools/utility /frameworks in C/C#/C++ that would automate and accelerate testing workÆows in the Åelds of Autonomous Vehicles, Robotics, 3D Simulation Platforms, GPU drivers, Cloud Computing and AI. • As a QA Tools and Test Development Intern at NVIDIA, you will collaborate with a team of talented engineers tackling some of the most complex challenges in cutting-edge technology. Mentored by the best minds in the industry, they will have the opportunity to make meaningful contributions to exciting and impactful projects. What we need to see: • Pursuing a graduate engineering course in Computer Science/ IT with strong academics. • Good Communication skills (interpersonal and across teams). • Excellent analytical and problem-solving skills. • Very organized, proactive, and has good learning ability. • Languages - C++/C#/.Net/Python • Ability to apply Object Oriented Programming concepts and Data structures knowledge Knowledge of SQL/NoSQL Database management tools • Ability to build applications using Generative AI APIs would be a plus • Would be a plus to have hands-on experience in development of Web Application (ASP.Net, MVC, web services). Skills to be Assessed : C++, C# Programming, Python, Linux, OOPS, DS, AI/ML/DL/Gen AI. Selection Process: Round 1: Online Assessment (Technical and Logic ques on HackerRank) Programming: Questions on C, VHDL, and Verilog programming Computer architecture: Questions on finite state machines, flip flop timing, and low power design Data compression: Questions on data compression and binary representations. Circuit design: Questions on circuit design using half/full adders. Clocks: Questions on clocks. Round 2: Technical Interview Round 3: HR Interview Eligibility Criteria: Min 80% in overall academics (10th, 12th, Graduation). CS/IT group only. No Live Backlog.",
        "Keys": [
            {
                "key": "stipend",
                "value": 40
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Bangalore"
            },
            {
                "key": "location_3",
                "value": "Hyderabad"
            },
            {
                "key": "role",
                "value": "QA Tool and Test Development Intern"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "Muthoot Finance",
        "description": "Role and Responsibility: Front line sales executive for Muthoot branches operations. Job Location: Muthoot branches (North, East & West) operations. Eligibility Criteria: Minimum Graduates / Graduation (last year) - Non Technical CTC: 1. Interns for 6 months. After the successful completion of internship, there will be performance evaluation and interns will get the PPO (Pre-Placement offer) accordingly. 2. Stipend INR 10000/- per month during internship period {will be registered under government scheme NAPS (National Apprenticeship Promotion) and NATS (National Apprenticeship Training)} 3. The internship period is for 6 months and after the successful completion of internship there will be performance evaluation for the placement in the Muthoot Payroll.",
        "Keys": [
            {
                "key": "company_name",
                "value": "Muthoot Finance"
            },
            {
                "key": "role",
                "value": "Front line sales executive"
            },
            {
                "key": "location_1",
                "value": "Muthoot branches"
            },
            {
                "key": "stipend",
                "value": 10
            },
            {
                "key": "branch_1",
                "value": "Non Technical"
            }
        ]
    },
    {
        "Name": "DeltaX",
        "description": "Role: Associate Product Engineer (Full Stack Developer) CTC: INR 7 Lakhs Per Annum Location: Bengaluru, Hyderabad and Pune Eligibility Criteria: • Btech (CS and IT) • Minimum overall 50% CGPA Engineering Culture & Practices • You will work in an agile SCRUM team. • Our teams follow BDD, REST, Continuous Integration and Continuous Delivery. • We operate hundreds of multi-tenant databases using MS SQL Server • C#, Vue.js and SQL are the common languages that our teams use. • Centralized monitoring across our entire stack using ELK Stack (Elasticsearch, Logstash, Kibana) Responsibilities • Write code :) • Ownership for the entire lifecycle of your code: development, test, production, and subsequent fixes and improvements. • Implement code that is clear, concise, tested, and easily understood by others. Selection Process: Round 1 Online Technical MCQ Test: Will cover fundamentals for Programming, Data Structures, Networking and Micro-processors. Expected No. of Questions: 50 Multiple Choice Questions. Assessment Duration: 45 Minutes. Difficulty level: Questions levels vary from easy to moderate. Round 2 Online Coding Assessment (any programming language) Helpful alert: Only serious coders will qualify Round 3 Technical Interview What we look for? Logical clarity Algorithm & Programming Concepts",
        "Keys": [
            {
                "key": "company_name",
                "value": "DeltaX"
            },
            {
                "key": "role",
                "value": "Associate Product Engineer (Full Stack Developer)"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "cgpa",
                "value": 50
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "Innovaptive Inc",
        "description": "Role: Product Owner (Trainee) and Trainee – Implementation Consultant (Campus) Location: Hyderabad, India Travel Percentage: 0% - 10% Employment Type: Full-Time; Salaried Reports To: Senior/Principal Product Manager, Product Management Compensation: Competitive as per Indian Market standards We are looking for a Product Owner to drive one of Innovapptive's connected worker SaaS platform products. The connected worker platform brings the maintenance front-line workers, back-office and connected assets (IiOT) together on one unified platform to perform jobs better, faster, cheaper and safer. This person will be responsible for product roadmap planning and execution, from ideation to adoption for the connected worker Platform Products. We are aggressively expanding our market penetration into several industry verticals with a special focus on Oil & Gas, Utilities, Chemicals, Metals & Mining and Industrial Manufacturing. And we need a dynamic, fast-paced Product professional who can ideate, design, drive, build and deliver Product features at pace. How You Will Make an Impact: • Product Execution: Execute a high-impact product roadmap for one of the Connected Worker Platform Products on Cloud • Rapid Iteration and Execution: Champion a culture of speed and agility, driving rapid product iteration and execution. Set high bars for quality, efficiency, and speed-to-market. Break down complex problems into actionable steps, and relentlessly prioritize to deliver results quickly. • Cross-Functional Collaboration: Work closely with engineering to deliver high-quality products on time and within budget. • Data-Driven Decision Making: Utilize data analytics and metrics to make informed decisions. Monitor key product metrics and perform user behavior analysis to gain insights. Leverage data to iterate on features, optimize user experiences, and drive product success. • Startup Mindset: Thrive in a dynamic, fast-paced startup environment. Embrace ambiguity and take ownership of challenges. Display entrepreneurial spirit, innovative thinking, and a willingness to take calculated risks. Be adaptable, resilient, and results-oriented. What You Bring to The Team: As a Product Owner, you will be responsible for leading the development and execution of our Connected Worker Platform SaaS product roadmap. You will collaborate closely with cross-functional teams, including engineering, design, marketing, and sales, to define and deliver exceptional software solutions that meet the needs of our target customers. You will be a strategic thinker with a strong understanding of the B2B software market and possess the ability to translate customer insights into actionable product strategies. You will be a go-getter finding creative low-cost, high-value solutions and not stuck in analysis-paralysis. Basic Qualifications: • Bachelor's degree in a relevant field (Computer Science, Business, or a related discipline). • Strong analytical mindset with a data-driven approach to decision making. • Excellent communication, presentation, and influencing skills, with the ability to effectively convey complex ideas to technical and non-technical stakeholders. • Passion for startups, technology, and staying at the forefront of tech trends. • Ability to influence/persuade people to drive outcomes • Analytical experience including converting raw data into actionable insights and recommendations • Excellent communication skills – written and verbal • Exposure to AWS cloud services. • Business acumen able to discern and distill product requirements into platform services requirements and epics. • Experience with business cost-benefit analysis and requirements gathering. • Technical acumen able to assist with breaking down technical problems and finding root causes. What We Offer above work: • A positive, open, and highly-innovative environment and team • Entrepreneurial spirit with unlimited opportunity to grow • Opportunity to work with leading global brands on exciting and impactful projects • Competitive Base Pay • Best of plan on Vacation & Paid Time Off. • Provision of Medical Insurance for family - self, dependent, spouse, dependent children, parents/parent-in-laws • Paid Maternity and Paternity leave • Bi-annual reviews to ensure transparency and promoting high performance culture • OKR Driven Performance Development Environment • Learning & Development - access to wide range of e-Learning courses",
        "Keys": [
            {
                "key": "company_name",
                "value": "Innovaptive Inc"
            },
            {
                "key": "role",
                "value": "Product Owner (Trainee)"
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            }
        ]
    }
]