[
    {
        "Name": "Bluealtair",
        "description": "bluealtairBluealtairJob Role: Graduate Engineer TraineeCTC: 5 LPA, Stipend: 20k/month (Permanent placement - Post internship completion based on the performance).Location: PuneAbout us: Blue Altair is a successor company of Fresh Gravity.It is a niche, sleek, high-end consulting firm that is employee centric, client focused, partner tied, and innovation driven.Core capabilities at Blue Altair are:• API Management & Integration-o API Business Strategy with “API First” Approach,o API Program and Technical Strategy,o iPaaS Strategy, API Gateway Package Selection,o Deployment (on-premises, cloud, hybrid),o iPaaS based system integration)• Data Managemento Cloud Data Migration,o Smart Analyticso Master Data Management,o Data Platform Strategy and Roadmapo Data Platform Modernizationo Data Governance and Strategy Roadmap• Data Science and AIo Big Data Analytics,o Machine Learning & Artificial Intelligence,o Deep Learning, Supervised,o Unsupervised and Semi-Supervised Learning,o Explainable AI,o Computer Vision,o Natural Language Processing• Digital Application Developmento Full Stack Developmento Web and Mobile Developmento DevOpso MicroservicesSelection Process:Round 1: Online Programming Test (MCQS on Aptitude ques, OS, CN ,DBMS, 2 ques Coding Ques)Round 2: Technical Interview 1",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "CTC",
                "value": 5
            },
            {
                "key": "Stipend",
                "value": 20000
            },
            {
                "key": "Location",
                "value": "Pune"
            },
            {
                "key": "Selection Process",
                "value": "Round 1: Online Programming Test (MCQS on Aptitude ques, OS, CN ,DBMS, 2 ques Coding Ques)Round 2: Technical Interview 1"
            }
        ]
    },
    {
        "Name": "JSW",
        "description": "Round 3: Technical Interview 2Round 4: HR InterviewEligibility Criteria:Min. 60% & above in 10th, 12th, GraduationNo gaps or year down in academics.No Live BacklogJSWJSWJob Role: Graduate Engineer TraineeCTC: 6 LPA (Fixed + Variable)The CTC is INR 5.5 LPA - INR 4.67 LPA (Fixed) in addition to INR 83,000 (Variables)Retention Bonus - INR 1 lakh (End of Year 1 - 50% and End of Year 2 - 50%)Job Description:• Completing all tasks set by the Supervisor and assisting wherever possible.• Observing existing strategies and techniques and offering suggestions for improvement.• Conducting research and collating data.• Traveling to different sites and gaining practical experience in new work zones.• Working closely with staff to foster professional values and build good relationships.• Observing health and safety guidelines at all times.• Attending meetings and workshops.• Submitting to all forms of evaluation during the traineeship.• Compiling reports and delivering presentations to staff members and other stakeholders.Selection Process:Round1: Online AssessmentRound 2: Online AssessmentRound 3: InterviewsEligibility Criteria:• Candidates should be open for any location pan India. no location preference will be considered. In casehe/she accepts the offer and then drops out because of the location constraint, then he/she will be blacklistedfrom the JSW group.• Branch: Mech, Indus, Civil• Candidate's age must be 24 years or less as of 1st April 2025.• Candidates must meet all the necessary fitness criteria. At any stage, the candidate must meet all necessaryfitness criteria.• No Live/Open Backlogs are allowed, In the case of Previous backlogs all should be cleared/closed beforeapplying. No lateral entry is allowed. No repeat year allowed.• The offer will be revoked if any information provided by the candidate at any stage stands incorrect.• No gap year is allowed between 10th, 12th, or any year of the Graduation Degree.• Min 60% and above throughout 10th, 12th and College.",
        "Keys": [
            {
                "key": "Eligibility",
                "value": "Min. 60% & above in 10th, 12th, GraduationNo gaps or year down in academics.No Live Backlog Candidates should be open for any location pan India. no location preference will be considered. In casehe/she accepts the offer and then drops out because of the location constraint, then he/she will be blacklistedfrom the JSW group. Branch: Mech, Indus, Civil Candidate's age must be 24 years or less as of 1st April 2025. Candidates must meet all the necessary fitness criteria. At any stage, the candidate must meet all necessaryfitness criteria. No Live/Open Backlogs are allowed, In the case of Previous backlogs all should be cleared/closed beforeapplying. No lateral entry is allowed. No repeat year allowed. The offer will be revoked if any information provided by the candidate at any stage stands incorrect. No gap year is allowed between 10th, 12th, or any year of the Graduation Degree. Min 60% and above throughout 10th, 12th and College."
            },
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "CTC",
                "value": 6
            },
            {
                "key": "Job Description",
                "value": "Completing all tasks set by the Supervisor and assisting wherever possible. Observing existing strategies and techniques and offering suggestions for improvement. Conducting research and collating data. Traveling to different sites and gaining practical experience in new work zones. Working closely with staff to foster professional values and build good relationships. Observing health and safety guidelines at all times. Attending meetings and workshops. Submitting to all forms of evaluation during the traineeship. Compiling reports and delivering presentations to staff members and other stakeholders."
            },
            {
                "key": "Selection Process",
                "value": "Round1: Online AssessmentRound 2: Online AssessmentRound 3: Interviews"
            }
        ]
    },
    {
        "Name": "GOCOMET",
        "description": "GOCOMETGOCOMET:Why GoComet?GoComet is a dynamic SaaS start-up that provides AI-powered transportation visibility solutions to revolutionize thetrillion-dollar logistics sector. At GoComet, we are revolutionizing the logistics sector one day at a time, and every teammember is committed to making it a reality. We're seeking individuals who embody our core values, character, andattitude. While we recognize that skills can be developed with the right mindset and learnability, we prioritize thosewho share our philosophy. Our recruitment processes reflect this belief. Look no further if you're looking for a diverse,talented, and vibrant workplace that recognizes and rewards hard work. We're ambitious, fast-paced, and unafraid toexperiment, fail, learn, and ultimately succeed. This is us! Join our team if you share our culture and values. We're anequal-opportunity employer. We welcome qualified applicants from all races, colors, religions, sexes, nationalities,sexual orientations, gender identities, and abilities.Job Role : Backend Intern (Data Engine)Stipend: 15KRoles & Responsibilities:• Understanding of manual and automation testing.• Have Basic programming skills.• Concentrating on details, including automated tests and documentation.• Ambitious and passionate about QA.•A great teammate and self-starter that is comfortable working in a rapidly changing environment and taking initiativewith limited resources.• Comfortable managing multiple assignments with competing priorities and tight deadlines• Fast learner with good communication skills.Experience & Skills:• Experience in Development using Ruby/Python.• Design and implement solutions to extract data from diverse websites, adhering toproject requirements.• Implement robust data extraction and parsing mechanisms to ensure accurate andstructured data retrieval.• Should have live projects available to demonstrate• Good understanding of Object Oriented Programming• An agile mindset and the ability to adapt to changing priorities and requirements• Good in analyzing and solving problems• Passionate to work in a start-upBenefits of the role includes:• Mentorship and guidance from engineers .• Exposure to industry best practices and emerging technologies.• Opportunity to enhance technical and analytical skills.• 5 Days working.• Flexible Working Hours.• Joining KitEligibility:Btech Grad",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Backend Intern (Data Engine)"
            },
            {
                "key": "Stipend",
                "value": 15000
            },
            {
                "key": "Responsibilities",
                "value": "Understanding of manual and automation testing.Have Basic programming skills.Concentrating on details, including automated tests and documentation.Ambitious and passionate about QA.A great teammate and self-starter that is comfortable working in a rapidly changing environment and taking initiativewith limited resources.Comfortable managing multiple assignments with competing priorities and tight deadlinesFast learner with good communication skills."
            },
            {
                "key": "skills",
                "value": "Experience in Development using Ruby/Python.Design and implement solutions to extract data from diverse websites, adhering toproject requirements.Implement robust data extraction and parsing mechanisms to ensure accurate andstructured data retrieval.Should have live projects available to demonstrateGood understanding of Object Oriented ProgrammingAn agile mindset and the ability to adapt to changing priorities and requirementsGood in analyzing and solving problemsPassionate to work in a start-up"
            },
            {
                "key": "Eligibility",
                "value": "Btech Grad"
            }
        ]
    },
    {
        "Name": "AVEVA",
        "description": "AVEVAAVEVAJob Role: Graduate TraineeReports To: Team LeadContract: Full-time permanentDepartment: Global Delivery Centre, IndiaLocation: Hyderabad/BengaluruAbout AVEVAAVEVA is a global leader in industrial software, driving digital transformation and sustainability.By connecting the power of information and artificial intelligence with human insight, AVEVAenables teams to use their data to unlock new value. We call this Performance Intelligence.AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineer smarter, operate better and drive sustainable efficiency. AVEVA supports customers through atrusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world.The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices inover 40 countries.We take pride in our core values and the diversity of our people, valuing the unique experienceand expertise that people from different backgrounds bring to our business.AVEVA is an Equal Opportunity Employer, and we take pride in the diversity of our employees,valuing the special experience and expertise that people from different backgrounds bring to ourbusiness. The ability to develop ground-breaking technologies is one of our key assets and ourpeople make it happen.About the roleAs a part of the development team, you'll be responsible for configuring, developing, testing andmaintain AVEVA software products and solutions. Responsible for delivering world-class products and solutions usinglatest technologies, established standards and processes in collaboration with other teams.In this role you will:• Be an integral part of global services team.• Configures and/or customises core product.• For Developer Role• Develop applications using cutting edge technologies likes .Net Core, Microservices,Node, Python,React, Angular, SQL, Analytics and Machine learning which meet functional and non-functionalrequirements with built-in-quality.• For Non-Developer Role• Develop applications/models using AVEVA products, which meet functional and non-functionalrequirements with built-in-quality.• Author, review, execute, maintain, and test applications.• Develop, build, customize, deploy, and manage the environment, test suits and testautomation frameworks.• Performs both unit and integration testing.• Deploys solutions into AVEVA's or Customer infrastructure.• Contributes to technical project documentation deliverables, taking responsibility ofaccuracy and flow of content.• Manages own time effectively within the scope of work allocated and ensures both a timelyand high-quality delivery.• Performs knowledge transfer to team members and customer representatives.It is a pre-requisite to be able to function effectively as a member of a dynamic team within amatrixed organisation. Excellent communication skills will be required to develop good workingrelationships in the following areas:• the region-based Project Managers and technical resources to ensure successful delivery of the project.• with other members of the Global Delivery Centre team in Hyderabad within a project and to share knowledge• develops good working relationships with customer representatives and always provides the highest level of customer service and professionalism.Mandatory Competencies, Knowledge and Skills:• Must have regular BE/BTech degree pursuing in (Computer, Chemical, Mechanical, Electrical,Instrumentation, Industrial)• Average aggregate 65% and above with no backlogs• Strong analytical skills, Communication, Problem Solving skills.• Basic knowledge of software development methodologies (e.g., Agile, Waterfall) and onsoftware development lifecycle (SDLC).• Good Problem Solving and Requirement understanding skills as well as a positive attitude,ability, and desire to learn new processes and technologies.• Organization: You'll be working in a fast-paced, high-volume, and evolving workenvironment, so time management and effective prioritisation will be essential• Customer focus: You'll be working directly with our customers. Being able to listen to themand understand their requests, and then address them in a proactive and consultativereview, will be part of your day-to-day• Problem-solving: You'll need to enjoy getting stuck into problems. Troubleshooting andsolving challenging problems is a big part of this role.Come and join AVEVA to create the transformative technology that enables our customers to engineer abetter world!",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Graduate Trainee"
            },
            {
                "key": "Location",
                "value": "Hyderabad/Bengaluru"
            },
            {
                "key": "Responsibilities",
                "value": "Be an integral part of global services team. Configures and/or customises core product. Develop applications using cutting edge technologies likes .Net Core, Microservices,Node, Python,React, Angular, SQL, Analytics and Machine learning which meet functional and non-functionalrequirements with built-in-quality. Develop applications/models using AVEVA products, which meet functional and non-functionalrequirements with built-in-quality. Author, review, execute, maintain, and test applications. Develop, build, customize, deploy, and manage the environment, test suits and testautomation frameworks. Performs both unit and integration testing. Deploys solutions into AVEVA's or Customer infrastructure. Contributes to technical project documentation deliverables, taking responsibility ofaccuracy and flow of content. Manages own time effectively within the scope of work allocated and ensures both a timelyand high-quality delivery. Performs knowledge transfer to team members and customer representatives."
            },
            {
                "key": "Qualifications",
                "value": "Must have regular BE/BTech degree pursuing in (Computer, Chemical, Mechanical, Electrical,Instrumentation, Industrial) Average aggregate 65% and above with no backlogs"
            },
            {
                "key": "Essential skills",
                "value": "Strong analytical skills, Communication, Problem Solving skills. Basic knowledge of software development methodologies (e.g., Agile, Waterfall) and onsoftware development lifecycle (SDLC). Good Problem Solving and Requirement understanding skills as well as a positive attitude,ability, and desire to learn new processes and technologies."
            },
            {
                "key": "Desired Competencies",
                "value": "Organization: You'll be working in a fast-paced, high-volume, and evolving workenvironment, so time management and effective prioritisation will be essential Customer focus: You'll be working directly with our customers. Being able to listen to themand understand their requests, and then address them in a proactive and consultativereview, will be part of your day-to-day Problem-solving: You'll need to enjoy getting stuck into problems. Troubleshooting andsolving challenging problems is a big part of this role."
            }
        ]
    }
]