[
    {
        "Name": "Sagacious IP",
        "description": "Sagacious IP About Sagacious IP: Sagacious IP is a global leader in Intellectual Property (IP) solutions, providing technical research and consulting services primarily focused on patents. We work with a diverse range of clients, including Fortune 500 companies, start- ups, international law firms, and corporate legal departments. Our expertise spans multiple domains, such as Biotech, Pharma, Mechanical, Electronics, and Telecom. Our headquarters are located in Gurugram (Delhi NCR), where we are currently hiring. Job Role: Patent Analyst CTC: 5.5 LPA, Stipend: 18k/month Job Location: Gurugram Eligibility Criteria: Min. 65% or above in 10th, 12th & Graduation No Live Backlog Candidates will be required to sign a 12-month employment bond upon joining. Role: • Understanding the technology, product, or the invention. Discuss the same with the • seniors & the internal team. If required, discuss the invention with the inventors/researchers/patent lawyers/client over the conference call or in-person meeting to calibrate or to get more details. • Performing various patent searches - prior art search, novelty search, patentability • search, patent portfolio, patent landscaping, validity searches, sequence searches, • structure searches etc. • Conduct comprehensive searches of technical and patent information using online • database and other information resources. • Analyze and summarize search results • Provide insightful evaluation and analysis of results. • Preparing final reports and deliverables as per required standards • Deliver timely, value-added patent search reports. • Discuss the finding/results with the inventor/client over the conference call. • Helping the inventor/client to secure a patent or else, helping them to design-around • the product or the invention. Compensation and Employment Details: • Fixed CTC: INR 550,000 per annum upon successful completion of the 6-month training period at Sagacious IP and B.Tech degree. • Internship Stipend: INR 18,000 per month. The internship period may be extended by 1 month if performance is not satisfactory. • Bond: Candidates will be required to sign a 12-month employment bond upon joining. • Training Period: During this period, the intern's performance will be evaluated to confirm their role as a Patent Analyst. Mandatory Skills: Good analytical skills Good Technical Knowledge Good Interpersonal skill",
        "Keys": [
            {
                "key": "role",
                "value": "Patent Analyst"
            },
            {
                "key": "ctc",
                "value": 5.5
            },
            {
                "key": "stipend",
                "value": 18
            },
            {
                "key": "location_1",
                "value": "Gurugram"
            },
            {
                "key": "percent",
                "value": 65
            }
        ]
    },
    {
        "Name": "Kickdrum",
        "description": "KickdrumJob Role: Software DeveloperCTC: 16LPA [Rs.10 LPA (Fixed) + 2 LPA (Variable) + 2 LPA (Benefits, retirals) + 2 LPA (Special bonus payable postcompletion of one year of full-time employment)]Stipend: 35kLocation: BengaluruPosition: Software Intern (KDU-er)• Work Location: Bengaluru (Monday - Friday in Office)• Eligibility Criteria: 80% and above in academics throughout. No backlogs.• Facilities: Food and Snacks in Office; 24x7 access• Leaves: 3 Paid & 3 Sick Leaves; Leaves for University Exams• BYOD: ₹ 2000/month for using your own device during InternshipPosition: Software Developer• Job Location: Bengaluru, 2 mandatory days in Office,• Eligibility Criteria: Successful completion of the 6 month Internship• Benefits: in-office meals, reimbursements for food orders, cab rides, and gym memberships. Health insurancefor self, family, and parents, BYOD (Bring Your Own Device) options, annual health checkups, wellnessprograms, mentorship, and training.• Paid Leaves: 12 sick leaves, 15 earned leaves, and 10 public holidays.Roles and Responsibilities:• Develop complex web applications with responsive design techniques and industry-leading UX• Translate design mock-ups and prototypes into working applications• Work on cloud-based architectures that are highly scalable, available, and performant• Work with agile methodology using cutting-edge DevOps tools & technologies• Focus on code quality and deliver projects with high business impactLearn and apply new skills during your 6 months internship:• Amazon Web Services (AWS)• HTML/CSS/React (frontend)• Java/Spring, DotNet, Python, Node (backend)• Enterprise-grade software development• Working directly with execs and customersUpon successful completion of your internship you will be employed as a “Software Developer” at Kickdrum.Selection Process:Round 1: Online Assessment (2 Coding Que) 2HRsRound 2: Technical Interview IRound 3: Culture RoundRound 4: HR InterviewEligibility: CS/IT group with 80% and above in their academics throughout.No backlogs.",
        "Keys": [
            {
                "key": "ctc",
                "value": 16
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "cgpa",
                "value": 8
            },
            {
                "key": "branch_1",
                "value": "CS/IT group"
            }
        ]
    },
    {
        "Name": "HSBC",
        "description": "HSBCJob Role: Software Development EngineerCTC: 9 LPAInterview Location: PuneJob Location: Pune / Hyderabad / Bangalore, subject to business requirements.Role:• Strong foundation in software development engineering, with proficiency in at least one object- orientedprogramming language such as Java, Python, etc.• Various OS like Android, Linux, and Databases like relational and no-SQL.• Liaising with business users, architects and other stakeholders in designing, implementing and maintainingbest-in-class (scalable, loosely coupled and efficient) solutions which can run seamlessly acrossplatforms/mobile/internet/cloud.• Continuous Integration (CI)/ Continuous Deployment (CD) pipeline and Agile methodology.• Any of Mobile, Analytics, Cloud and Digital technology domains.• Ability to design and implement solutions which can run on-prem, hybrid and multi-cloud ecosystems such asGCP, AWS, Azure, Ali Cloud.• Ability to harness open-source development thus leveraging collective wisdom and learning• Understanding of cyber threats/ vulnerabilities and applying secure coding standards and associated protocols.• Ability to leverage industry best integration patterns and practices to integrate multiple existing/ new buildingblocks for seamless end-to-end customer experience.• Developing, maintaining, and supporting current systems for better efficacy and higher availability.Selection Process:Round 1: Aptitude + Technical (75 Minutes) & Coding assessment (30 Minutes)Only the students who clear the Aptitude + Technical assessment, will be able to appear for the coding test.Round 2: Technical Interview (Pune)Round 3: HR InterviewEligibility Criteria:Min. 60% or 6.00 CGPA throughout (10th / 12th / Diploma / B.E. / B.Tech), No Live Backlog.",
        "Keys": [
            {
                "key": "role",
                "value": "Software Development Engineer"
            },
            {
                "key": "ctc",
                "value": 9
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "cgpa",
                "value": 6
            }
        ]
    },
    {
        "Name": "Nvidia",
        "description": "NvidiaJob Role: QA Tool and Test Development Intern.Stipend : 40kLocation : Pune, Bangalore, HyderabadWhat you will be doing:• The intern will help us build tools/utility /frameworks in C/C#/C++ that would automate and accelerate testingworkÆows in the Åelds of Autonomous Vehicles, Robotics, 3D Simulation Platforms, GPU drivers, CloudComputing and AI.• As a QA Tools and Test Development Intern at NVIDIA, you will collaborate with a team of talentedengineers tackling some of the most complex challenges in cutting-edge technology. Mentored by the bestminds in the industry, they will have the opportunity to make meaningful contributions to exciting and impactfulprojects.What we need to see:• Pursuing a graduate engineering course in Computer Science/ IT with strong academics.• Good Communication skills (interpersonal and across teams).• Excellent analytical and problem-solving skills.• Very organized, proactive, and has good learning ability.• Languages - C++/C#/.Net/Python• Ability to apply Object Oriented Programming concepts and Data structures knowledge Knowledge ofSQL/NoSQL Database management tools• Ability to build applications using Generative AI APIs would be a plus• Would be a plus to have hands-on experience in development of Web Application (ASP.Net, MVC, webservices).Skills to be Assessed :C++, C# Programming, Python, Linux, OOPS, DS, AI/ML/DL/Gen AI.Selection Process:Round 1: Online Assessment (Technical and Logic ques on HackerRank)Programming: Questions on C, VHDL, and Verilog programmingComputer architecture: Questions on finite state machines, flip flop timing, and low power designData compression: Questions on data compression and binary representations.Circuit design: Questions on circuit design using half/full adders.Clocks: Questions on clocks.Round 2: Technical InterviewRound 3: HR InterviewEligibility Criteria:Min 80% in overall academics (10th, 12th, Graduation). CS/IT group only.No Live Backlog.",
        "Keys": [
            {
                "key": "role",
                "value": "QA Tool and Test Development Intern"
            },
            {
                "key": "stipend",
                "value": 40
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Bangalore"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            }
        ]
    }
]