[
    {
        "Name": "Trimble",
        "description": "Trimble:Job Role: Graduate Technical Interns (opportunities in Construction, Transportation, Agriculture and Geospatialdomains).CTC: 7 LPAStipend: 21.5k (Upon successful completion of the internship, FullTime will be offered).Job PurposeDesign and Develop Software solutions to meet the functional requirements of innovative products (pertaining toMobile/Cloud/Desktop and various domains) developed by Trimble divisions. Make use of well-established designpatterns and architectures that suit the mobile platform and follow agile development processes. Perform unit testing ofthe code developed, develop unit test cases and test harness. Perform system integration and bug fixing, develop userdocumentation, generation of relevant reports and review similar work done by peers.Main Responsibilities:• Read and understand high-level product description or requirement documents and propose one or moresoftware designs at the module level that are highly reusable and subject to the design principles of thesoftware's target host platform.• Decompose design elements into the structured code as per prevailing coding guidelines, preparation andexecution of unit test cases, and development of test codes or test harnesses. Trace back through code, design,and resolve issues and bugs.• Document work, software designs, code and record and produce test reports and release notes• Plan, organize, and execute assignments with very little or moderate supervision, in an agile environment• Responsible for deliveries in the required deadlines. Deliveries may be modules, documentation, customerreleases, etc.• Coordinate with the team for the timely delivery of work products. Ensure the quality of work products byreviews.• Sub-Module level responsibility in large projects and Module (or component) level responsibility insmall/medium-sized projects and complete responsibility is small-sized projects, depending upon the complexityand decomposition.• Work with User Experience, and QA teams to ensure the validity of the solution.• Be contemporary by adopting technological and market evolutions.• Other responsibilities as assigned by the management from time to time.Skill sets:• Good understanding of operating systems principles, embedded systems, software architectures, softwarealgorithms, data structures, and software engineering principles.• Stronghold in OOAD and object-oriented programming language.• Experience in applications programming is preferred.• Good exposure to design, development, and debugging tools.• Knowledge of various Software Development Lifecycles.• Good analytical and problem-solving skills.• Excellent communication and interpersonal skills.• Upbeat, highly motivated, and self-starter.Qualifications & Experience:• Bachelors of Engineering.• A good score in any of the national level Olympiads or talent search examinations will be a value addition. Agood JEE score will be a big bonus.• Paper presentation in a national level forum, contribution to open source projects, and contribution tostandards bodies will be value addition.Eligibility Criteria:Min. 65% (Engg. and 10th, 12th, Diploma) and above marks in all semestersNo backlogs and no year gaps.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Technical Interns"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "stipend",
                "value": 21.5
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Engg."
            }
        ]
    },
    {
        "Name": "Yoptima",
        "description": "Eligibility:CS/IT group only.80% and above throughout (10th,12th,UG -until 6th Semester)No Live Backlog.YoptimaJob Role: Account ExecutiveCTC: 7 LPA, Stipend: 25k/monthLocation: Jui Nagar, Navi MumbaiPost-Internship Opportunity: After successfully completing the internship and a thorough assessment, candidates willbe offered a permanent role with a total compensation of ₹7 Lakh CTC (₹5 Lakh Fixed + *2 Lakh Variable+ otherbenefits) for BTech graduates.Responsibilities:• Analyze digital behavior of the online consumers across different digital channels and design actionableinsights and solutions to improve marketing ROI at scale.• Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advancedanalytical methods as needed.• Assist in designing relevant marketing plans and strategies for digital ad campaigns, combining understandingof consumer behavior, data driven insights, product positioning and marketing objectives.• Troubleshoot technical issues both internally and with Third party vendors.• Manage servicing needs of clients and win sustainable customer delight and brand advocacy.Competencies:• 0-2 yrs Exp with Bachelor's or Master's degree in a quantitative discipline (e.g. business administration,engineering, statistics, operations research, economics, mathematics).• Strong analytical and problem-solving skills.• Ability to present results of complex analysis compellingly to both technical and non-technical audiences.• Self-motivated with the ability to work independently and within a team.Selection Process:Round1: 8D Online Assessment – A mandatory evaluation.Round 2: Shortlisted candidates from the assessment will go through 2-3 rounds of interviews with the Co-founders(COO & CEO).",
        "Keys": [
            {
                "key": "role",
                "value": "Account Executive"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Jui Nagar"
            },
            {
                "key": "location_2",
                "value": "Navi Mumbai"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS/IT group"
            }
        ]
    },
    {
        "Name": "Bluealtair",
        "description": "bluealtairBluealtairJob Role: Graduate Engineer TraineeCTC: 5 LPA, Stipend: 20k/month (Permanent placement - Post internship completion based on the performance).Location: PuneAbout us: Blue Altair is a successor company of Fresh Gravity.It is a niche, sleek, high-end consulting firm that is employee centric, client focused, partner tied, and innovation driven.Core capabilities at Blue Altair are:• API Management & Integration-o API Business Strategy with “API First” Approach,o API Program and Technical Strategy,o iPaaS Strategy, API Gateway Package Selection,o Deployment (on-premises, cloud, hybrid),o iPaaS based system integration)• Data Managemento Cloud Data Migration,o Smart Analyticso Master Data Management,o Data Platform Strategy and Roadmapo Data Platform Modernizationo Data Governance and Strategy Roadmap• Data Science and AIo Big Data Analytics,o Machine Learning & Artificial Intelligence,o Deep Learning, Supervised,o Unsupervised and Semi-Supervised Learning,o Explainable AI,o Computer Vision,o Natural Language Processing• Digital Application Developmento Full Stack Developmento Web and Mobile Developmento DevOpso MicroservicesSelection Process:Round 1: Online Programming Test (MCQS on Aptitude ques, OS, CN,DBMS, 2 ques Coding Ques)Round 2: Technical Interview 1",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 5
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "location_1",
                "value": "Pune"
            }
        ]
    },
    {
        "Name": "JSW",
        "description": "JSWJob Role: Graduate Engineer TraineeCTC: 6 LPA (Fixed + Variable)The CTC is INR 5.5 LPA - INR 4.67 LPA (Fixed) in addition to INR 83,000 (Variables)Retention Bonus - INR 1 lakh (End of Year 1 - 50% and End of Year 2 - 50%)Job Description:• Completing all tasks set by the Supervisor and assisting wherever possible.• Observing existing strategies and techniques and offering suggestions for improvement.• Conducting research and collating data.• Traveling to different sites and gaining practical experience in new work zones.• Working closely with staff to foster professional values and build good relationships.• Observing health and safety guidelines at all times.• Attending meetings and workshops.• Submitting to all forms of evaluation during the traineeship.• Compiling reports and delivering presentations to staff members and other stakeholders.Selection Process:Round1: Online AssessmentRound 2: Online AssessmentRound 3: InterviewsEligibility Criteria:• Candidates should be open for any location pan India. no location preference will be considered. In casehe/she accepts the offer and then drops out because of the location constraint, then he/she will be blacklistedfrom the JSW group.• Branch: Mech, Indus, Civil• Candidate's age must be 24 years or less as of 1st April 2025.• Candidates must meet all the necessary fitness criteria. At any stage, the candidate must meet all necessaryfitness criteria.• No Live/Open Backlogs are allowed, In the case of Previous backlogs all should be cleared/closed beforeapplying. No lateral entry is allowed. No repeat year allowed.• The offer will be revoked if any information provided by the candidate at any stage stands incorrect.• No gap year is allowed between 10th, 12th, or any year of the Graduation Degree.• Min 60% and above throughout 10th, 12th and College.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Mech"
            },
            {
                "key": "branch_2",
                "value": "Indus"
            },
            {
                "key": "branch_3",
                "value": "Civil"
            }
        ]
    }
]