[
    {
        "Name": "DeltaX",
        "description": "DeltaXRole: Associate Product Engineer (Full Stack Developer)CTC: INR 7 Lakhs Per AnnumLocation: Bengaluru, Hyderabad and PuneEligibility Criteria:• Btech (CS and IT)• Minimum overall 50% CGPAEngineering Culture & Practices• You will work in an agile SCRUM team.• Our teams follow BDD, REST, Continuous Integration and Continuous Delivery.• We operate hundreds of multi-tenant databases using MS SQL Server• C#, Vue.js and SQL are the common languages that our teams use.• Centralized monitoring across our entire stack using ELK Stack (Elasticsearch, Logstash, Kibana)Responsibilities• Write code :)• Ownership for the entire lifecycle of your code: development, test, production, and subsequent fixes andimprovements.• Implement code that is clear, concise, tested, and easily understood by others.Selection Process:Round 1Online Technical MCQ Test:Will cover fundamentals for Programming, Data Structures,Networking and Micro-processors.Expected No. of Questions: 50 Multiple Choice Questions.Assessment Duration: 45 Minutes.Difficulty level: Questions levels vary from easy to moderate.Round 2Online Coding Assessment (any programming language)Helpful alert: Only serious coders will qualifyRound 3Technical InterviewWhat we look for?Logical clarityAlgorithm & Programming Concepts",
        "Keys": [
            {
                "key": "Roles",
                "value": "Associate Product Engineer (Full Stack Developer)"
            },
            {
                "key": "CTC",
                "value": 700000
            },
            {
                "key": "Location",
                "value": "Bengaluru, Hyderabad and Pune"
            },
            {
                "key": "Eligibility",
                "value": "Btech (CS and IT)• Minimum overall 50% CGPA"
            },
            {
                "key": "Responsibilities",
                "value": "Write code :)• Ownership for the entire lifecycle of your code: development, test, production, and subsequent fixes andimprovements.• Implement code that is clear, concise, tested, and easily understood by others."
            },
            {
                "key": "Selection Process",
                "value": "Round 1Online Technical MCQ Test:Will cover fundamentals for Programming, Data Structures,Networking and Micro-processors.Expected No. of Questions: 50 Multiple Choice Questions.Assessment Duration: 45 Minutes.Difficulty level: Questions levels vary from easy to moderate.Round 2Online Coding Assessment (any programming language)Helpful alert: Only serious coders will qualifyRound 3Technical InterviewWhat we look for?Logical clarityAlgorithm & Programming Concepts"
            }
        ]
    },
    {
        "Name": "Innovaptive Inc",
        "description": "INNOVAPPTIVEInnovaptive IncRole: Product Owner (Trainee) and Trainee – Implementation Consultant (Campus)Location: Hyderabad, IndiaTravel Percentage: 0% - 10%Employment Type: Full-Time; SalariedReports To: Senior/Principal Product Manager, Product ManagementCompensation: Competitive as per Indian Market standardsWe are looking for a Product Owner to drive one of Innovapptive's connected workerSaaS platform products. The connected worker platform brings the maintenancefront-line workers, back-office and connected assets (IiOT) together on one unifiedplatform to perform jobs better, faster, cheaper and safer. This person will beresponsible for product roadmap planning and execution, from ideation to adoption forthe connected worker Platform Products. We are aggressively expanding our marketpenetration into several industry verticals with a special focus on Oil & Gas, Utilities,Chemicals, Metals & Mining and Industrial Manufacturing. And we need a dynamic,fast-paced Product professional who can ideate, design, drive, build and deliver Productfeatures at pace.How You Will Make an Impact:• Product Execution: Execute a high-impact product roadmap for one of theConnected Worker Platform Products on Cloud• Rapid Iteration and Execution: Champion a culture of speed and agility, drivingrapid product iteration and execution. Set high bars for quality, efficiency, andspeed-to-market. Break down complex problems into actionable steps, andrelentlessly prioritize to deliver results quickly.• Cross-Functional Collaboration: Work closely with engineering to deliverhigh-quality products on time and within budget.• Data-Driven Decision Making: Utilize data analytics and metrics to makeinformed decisions. Monitor key product metrics and perform user behavioranalysis to gain insights. Leverage data to iterate on features, optimize userexperiences, and drive product success.• Startup Mindset: Thrive in a dynamic, fast-paced startup environment. Embraceambiguity and take ownership of challenges. Display entrepreneurial spirit,innovative thinking, and a willingness to take calculated risks. Be adaptable,resilient, and results-oriented.What You Bring to The Team:As a Product Owner, you will be responsible for leading the development and executionof our Connected Worker Platform SaaS product roadmap. You will collaborate closelywith cross-functional teams, including engineering, design, marketing, and sales, todefine and deliver exceptional software solutions that meet the needs of our targetcustomers. You will be a strategic thinker with a strong understanding of the B2Bsoftware market and possess the ability to translate customer insights into actionableproduct strategies. You will be a go-getter finding creative low-cost, high-value solutionsand not stuck in analysis-paralysis.Basic Qualifications:• Bachelor's degree in a relevant field (Computer Science, Business, or a relateddiscipline).• Strong analytical mindset with a data-driven approach to decision making.• Excellent communication, presentation, and influencing skills, with the ability toeffectively convey complex ideas to technical and non-technical stakeholders.• Passion for startups, technology, and staying at the forefront of tech trends.• Ability to influence/persuade people to drive outcomes• Analytical experience including converting raw data into actionable insights andrecommendations• Excellent communication skills – written and verbal• Exposure to AWS cloud services.• Business acumen able to discern and distill product requirements into platformservices requirements and epics.• Experience with business cost-benefit analysis and requirements gathering.• Technical acumen able to assist with breaking down technical problems andfinding root causes.What We Offer above work:• A positive, open, and highly-innovative environment and team• Entrepreneurial spirit with unlimited opportunity to grow• Opportunity to work with leading global brands on exciting and impactful projects• Competitive Base Pay• Best of plan on Vacation & Paid Time Off.• Provision of Medical Insurance for family - self, dependent, spouse, dependentchildren, parents/parent-in-laws• Paid Maternity and Paternity leave• Bi-annual reviews to ensure transparency and promoting high performanceculture• OKR Driven Performance Development Environment• Learning & Development - access to wide range of e-Learning courses",
        "Keys": [
            {
                "key": "Roles",
                "value": "Product Owner (Trainee) and Trainee – Implementation Consultant (Campus)"
            },
            {
                "key": "Location",
                "value": "Hyderabad, India"
            },
            {
                "key": "Compensation",
                "value": "Competitive as per Indian Market standards"
            },
            {
                "key": "What You'll Bring",
                "value": "As a Product Owner, you will be responsible for leading the development and execution of our Connected Worker Platform SaaS product roadmap. You will collaborate closely with cross-functional teams, including engineering, design, marketing, and sales, to define and deliver exceptional software solutions that meet the needs of our target customers. You will be a strategic thinker with a strong understanding of the B2B software market and possess the ability to translate customer insights into actionable product strategies. You will be a go-getter finding creative low-cost, high-value solutions and not stuck in analysis-paralysis.Basic Qualifications:• Bachelor's degree in a relevant field (Computer Science, Business, or a related discipline).• Strong analytical mindset with a data-driven approach to decision making.• Excellent communication, presentation, and influencing skills, with the ability to effectively convey complex ideas to technical and non-technical stakeholders.• Passion for startups, technology, and staying at the forefront of tech trends.• Ability to influence/persuade people to drive outcomes• Analytical experience including converting raw data into actionable insights and recommendations• Excellent communication skills – written and verbal• Exposure to AWS cloud services.• Business acumen able to discern and distill product requirements into platform services requirements and epics.• Experience with business cost-benefit analysis and requirements gathering.• Technical acumen able to assist with breaking down technical problems and finding root causes."
            },
            {
                "key": "Qualifications",
                "value": "Bachelor's degree in a relevant field (Computer Science, Business, or a related discipline)."
            }
        ]
    },
    {
        "Name": "Raja Software Labs",
        "description": "RAJA SOFTWARE LABSpeace of mindRaja Software LabsAbout RSL:Raja Software Labs (RSL) is a software development consultancy, based in Pune. Our expertise is in helping companies ship highbusiness impact, mission critical solutions. We develop software but are in the peace of mind business. We started in 2007 andhave since shipped products for the world's most innovative companies, including Linked, Google, Nest, Vida Health. Our appshave had more than 200 million downloads.Role: Software DeveloperPackage:- Rs. 7 Lakhs (Rupees Seven Lakhs per annum)Interview Process:Programming test (Evaluate programming skills of the students)Technical Interviews: 2-3 technical interviews evaluating the programming skills of the students.(DSA and OOPSEligibility Criteria:- BE or equivalent-Knowledge of any programming language (C, C++, Java, Python, JavaScript, Ruby, C#, Swift, Objective-C, or anyother)Graduation percentage: 60% and higherBranches allowed: Computer Science, IT, Electrical, EnTC, Mech Engineering (Graduate / Postgraduate).",
        "Keys": [
            {
                "key": "Roles",
                "value": "Software Developer"
            },
            {
                "key": "CTC",
                "value": 700000
            },
            {
                "key": "Selection Process",
                "value": "Programming test (Evaluate programming skills of the students)Technical Interviews: 2-3 technical interviews evaluating the programming skills of the students.(DSA and OOPS"
            },
            {
                "key": "Eligibility",
                "value": "BE or equivalent-Knowledge of any programming language (C, C++, Java, Python, JavaScript, Ruby, C#, Swift, Objective-C, or anyother)Graduation percentage: 60% and higherBranches allowed: Computer Science, IT, Electrical, EnTC, Mech Engineering (Graduate / Postgraduate)."
            },
            {
                "key": "B.E/B.Tech",
                "value": "BE or equivalent"
            }
        ]
    },
    {
        "Name": "Hitachi Energy",
        "description": "☑ Hitachi EnergyRole: Management TraineeInternship Duration: 6 MonthsStipend: Rs. 20,000 per monthCTC: 6LPA (After successful completion of internship)Location: Chennai, Bangalore, GurugramEligibility Criteria-Eligible Stream EEE, CSE, ECE and MechanicalEligible Aggregate 10th, 12th / Diploma & B.E – 70%",
        "Keys": [
            {
                "key": "Roles",
                "value": "Management Trainee"
            },
            {
                "key": "Stipend",
                "value": 20000
            },
            {
                "key": "CTC",
                "value": 600000
            },
            {
                "key": "Location",
                "value": "Chennai, Bangalore, Gurugram"
            },
            {
                "key": "Eligibility",
                "value": "Eligible Stream EEE, CSE, ECE and MechanicalEligible Aggregate 10th, 12th / Diploma & B.E – 70%"
            }
        ]
    }
]