[
    {
        "Name": "ZS",
        "description": "Role - Software Engineer – Test Responsibilities: • Understand the behavior of complex web-based applications and apply that knowledge towards testing • Contribute to a project's overall test strategy and test plan • Create and execute test scenarios; select the best methods, techniques and evaluation criteria for testing • Identify test data requirements and generate required data to support testing • Evaluate and analyze application behavior and data for potential software issues • Clearly report and help prioritize issues found during testing • Create test deliverables required by company and project testing standards • Work collaboratively with other testers, developers, and stakeholders • Identify and lead process improvement efforts • Contribute during design reviews and recommend product improvements Qualifications: • Bachelor's or master's degree in computer science, a physical science, engineering, mathematics, economics, or another discipline with a quantitative focus • Strong academic record [India] (CGPA 7.0 or higher) • Extensive knowledge of manual testing • Advanced critical thinking skills • Excellent communication and interpersonal skills • Experience testing web applications is highly desirable • Understanding of defect tracking and test management software • Knowledge / exposure to all aspects of SDLC/STLC • Experience with Agile / Scrum methodologies • Exposure to automated testing is an added advantage • Ability to work in global cross-office teams • ZS is a global firm; fluency in English is required Eligibility Criteria • No Backlogs",
        "Keys": [
            {
                "key": "role",
                "value": "Software Engineer – Test"
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "Physical Science"
            },
            {
                "key": "branch_3",
                "value": "Engineering"
            },
            {
                "key": "branch_4",
                "value": "Mathematics"
            }
        ]
    },
    {
        "Name": "Aspect Ratio",
        "description": "CTC :- 12 LPA Job Description: As an Analyst your job would involve: • Taking a complicated business problem and structuring it into a mathematical problem • Implementing the solution in the best available tool – MS-Excel, Spotfire, R, Python etc. • Understand client requirements and provide solutions in a fast-paced environment • Effectively collaborate across teams • Dive deep into data, analyse, and discover patterns/root causes. Generate insights. • Design accurate and scalable prediction algorithms • Using your project management skills to work on multiple projects simultaneously • Designing and implementing processes to boost our performance . Essential skills: • Basic statistical modelling knowledge • Strong attention to detail with excellent problem-solving skills • Hands on experience on R/Python and SAS/SQL • Passionate about latest technology trends with a desire for innovation • Self-motivated, self-managing and able to work independently. Good communication skills Good to have skills: • Experience with patient level data or big data of any kind • Some experience in developing and supporting Machine Learning solutions • Academic Requirements: ○ UG: 70% required, 88.3% achieved ○ Class X: 70% required, 82% achieved ○ Class XII: 70% required, 79.6% achieved • PG/Dual Degree: Not applicable Selection Process: Round 1: Pre-placement Talk Round 2: Online Assessment (MCQs on Logical Reasoning & SQL, 2 SQL Code, 2 DSA que) 2HRs Round 3: Communication Test (Online) Round 4: Technical Interview Round 5: HR Round",
        "Keys": [
            {
                "key": "ctc",
                "value": 12
            },
            {
                "key": "role",
                "value": "Analyst"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Varroc",
        "description": "It gives me great pleasure to introduce Varroc as a GLOBAL LEADER IN AUTOMOTIVE COMPONENTS. Varroc is a global tier-1 automotive component company. We commenced operations in India with our Polymer business in 1990 We design, manufacture, and supply exterior lighting systems, plastic and polymer components, electrical-electronics components, and precision metallic components to passenger car, commercial vehicle, two-wheeler, three-wheeler and off-highway vehicle (“OHV”) OEMs directly worldwide. Job Description Graduate Engineer Trainee CTC: 11.5 LPA Selection Process(Online):- 1. 10th/12th percentage based resume shortlisting. 2. Aptitude: Reasoning Ability Verbal Ability Pseudo Code Puzzle Solving English Ability and Core Subjects Test (As per branch) (Not Proctored). 3. Technical Interview ( core ques, technical ques, CN, Managerial) Round 1 technical Round 2- Managerial Round 3 - HR Eligibility: B.Tech- CS group, IT, EC, EN, IND, EE, Mech 10th: 85% 12th : 75% Degree: 7 CGPA No live or dead backlog No gap year",
        "Keys": [
            {
                "key": "ctc",
                "value": 11.5
            },
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EC"
            },
            {
                "key": "branch_4",
                "value": "EN"
            },
            {
                "key": "cgpa",
                "value": 7
            }
        ]
    },
    {
        "Name": "Tech Mahindra",
        "description": "TECH mahindra CTC: 3.25 / 4 - 5.5 LPA Supercoder selection: • Candidates who excel academically & perform well in the selection process (excluding HR round) will qualify for consideration in the Supercoder cadre selection. • Eligible candidates will then take the Supercoder test, and those who pass will be designated as Supercoders. • Eligibility: CS/IT group. Selection process: 1. Aptitude Test: (90 min) 2. Reasoning Ability, Verbal Ability, Pseudo Code, Puzzle Solving, English Ability, English Essay/Story, Conversational Test. 3. Technical & Psychometric Test (technical MCQ, 2 coding test - 60 min) 4. Verbal Communication Test (SWAR) 5. Technical Interview 6. HR Interview Eligibility 70% or 7 CGPA (Without Rounding-up) in 10th, 12th /Diploma (in case done) No Active Backlog There should not be a gap of more than one year. Upon Selection • Candidate will be on probation for 6 months • Candidate clearing the regular selection process would become eligible for CTC of INR 3.25 L /Annum • COE Students will get 4 LPA. Only those who clear COE Exit Tests. • Candidate successfully passing the Supercoder selection process would become eligible for CTC of INR 5.5 L /Annum • Candidates will have to sign an indemnity bond for INR 1 L for a mandatory service period of 2 years from date of joining the company.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 3.25
            },
            {
                "key": "ctc_max",
                "value": 5.5
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    }
]