[
    {
        "Name": "Chegg",
        "description": "Chegg®Job Title: Managed Network Expert (Subject Expert)Work location: Remote, work from homeTimings: Flexible work schedule (as per individual preference)Job Type: Part-timeOur subject experts are expected to solve academic questions asked by students on ourQuestion & Answer board.Eligibility• Enrolled as a student in Diploma, Bachelor's, Master's or Doctorate degree programs in therespective field of study.• This opportunity is NOT restricted to final year (semester) students only. Studentsfrom previous years can also apply.Expectations• Ensure that outlined quality parameters are followed.• Ensure that authoring guidelines are adhered• To ensure high-level of academicBenefits• Compensation: Paid per question answered (no limits)• Average Income: INR 30,000 to INR 80,000 per month*• Experience certificate at the end of tenure.• Earn while you learn.• Academic development.• Flexible work schedule.• Exposure to working at an MNC.Company Description:As the leading student-first connected learning platform,Chegg's Student Hub makes higher education more affordable and more accessible,all while improving student outcomes. Chegg is a publicly-held company based inSanta Clara, CA with offices in San Francisco, New York, Portland, India, Israel,Berlin, and Ukraine. Chegg Student Hub Services Include: Chegg Study, CheggTutoring, Chegg Writing Tools, Test Prep, Careers Search, Internship Admissionsand College Admissions.Chegg India, a premier educational services company and a wholly ownedsubsidiary of Chegg Inc., has been offering high quality services in the area ofHomework Help, Scholarships and Content Creation for American UniversityTextbooks. Chegg India has a vast network of employees with offices in Delhi andVisakhapatnam ably supported by a team of Managed Network Experts and TerritoryManagers who handle the Pan India Operations.'Student First' is our DNA. It drives everything we do. From the way we build ournetwork to the way we connect students to opportunity. We give every student theability to realize their full potential.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Managed Network Expert (Subject Expert)"
            },
            {
                "key": "Location",
                "value": "Remote, work from home"
            },
            {
                "key": "Job Description",
                "value": "Our subject experts are expected to solve academic questions asked by students on our Question & Answer board."
            },
            {
                "key": "Eligibility",
                "value": "Enrolled as a student in Diploma, Bachelor's, Master's or Doctorate degree programs in therespective field of study. This opportunity is NOT restricted to final year (semester) students only. Studentsfrom previous years can also apply."
            },
            {
                "key": "Role expectations",
                "value": "Ensure that outlined quality parameters are followed.Ensure that authoring guidelines are adheredTo ensure high-level of academic"
            },
            {
                "key": "Compensation",
                "value": "Paid per question answered (no limits) Average Income: INR 30,000 to INR 80,000 per month*"
            }
        ]
    },
    {
        "Name": "JTP",
        "description": "JTPAbout the company:JTP is a listed company on JASDAQ (Japanese Stock exchange) as JTP 2488. Our portfolio encapsulates services andproducts in ROBOTICS, Hardware / Software development, Pharma and Human resource development. Our headoffice is in Japan with branch offices in the USA, India, Korea, and many other countries. JTP has over 35 years ofexperience in the Japanese market. We work with clients such as EMC, SAP, Hitachi, NVIDIA, Softbank, Mitsubishietc.Job role: System engineerCTC: 24 LPALocation: JapanThe hiring process will be as follows:Step 1: Application.Step 2: Selection for technical assessments.Step 3: Technical assessmentStep 4: English Interview (Please note students with insufficient international level English skills will beeliminated. Students with Mother Tongue influence will be eliminated)Step 5: Virtual Training + Project round.Step 6: Golden ticket opportunity for few students*Step 7: CEO panel Interview.Eligibility branches: CS, IT, EC, E&TC, МСА, ВСА.Eligibility criterion: All students who are passionate for IT. (No merit criterion)",
        "Keys": [
            {
                "key": "Job Role",
                "value": "System engineer"
            },
            {
                "key": "CTC",
                "value": 24
            },
            {
                "key": "Location",
                "value": "Japan"
            },
            {
                "key": "Selection Process",
                "value": "Step 1: Application.Step 2: Selection for technical assessments.Step 3: Technical assessmentStep 4: English Interview (Please note students with insufficient international level English skills will beeliminated. Students with Mother Tongue influence will be eliminated)Step 5: Virtual Training + Project round.Step 6: Golden ticket opportunity for few students*Step 7: CEO panel Interview."
            },
            {
                "key": "Eligibility",
                "value": "branches: CS, IT, EC, E&TC, МСА, ВСА.Eligibility criterion: All students who are passionate for IT. (No merit criterion)"
            }
        ]
    },
    {
        "Name": "Darwinbox",
        "description": "ddarwinboxAbout Darwinbox:Darwinbox is Asia's fastest-growing SaaS-based HR Technology platform. A brainchild of alumni from the country'smost distinguished institutions (IIT/IIM/XLRI) and organizations (McKinsey, EY, Google), Darwinbox is the preferredtechnology partner of 500+ global enterprises with more than 1 million+ employees using the platform. Our endto-endHCM technology suite competes with the best in the business and has won against giants such as SAP, Oracle, andWorkday several times to acquire iconic enterprise customers ranging from the largest conglomerates to unicorns -Adani, Mahindra, Kotak, TVS, Arvind, Nivea, Puma, Swiggy, Paytm, Bigbasket and Delhivery etc.The rate at which our product and market presence is growing is unprecedented. We're arocketship. We're not planning on slowing down anytime soon. And, that's why we need you!Designation: Intern- Product Development (The role can be converted to full time Software Engineer)Duration & Stipend: 6 Months, 25k per monthCTC: 16,30,000 LPALocation: HyderabadRoles and Responsibilities:• Coding• Product Development",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Intern- Product Development (The role can be converted to full time Software Engineer)"
            },
            {
                "key": "Stipend",
                "value": 25000
            },
            {
                "key": "CTC",
                "value": 1630000
            },
            {
                "key": "Location",
                "value": "Hyderabad"
            },
            {
                "key": "Roles",
                "value": "Coding Product Development"
            },
            {
                "key": "Responsibilities",
                "value": "Coding Product Development"
            }
        ]
    },
    {
        "Name": "TIAA",
        "description": "Min. Eligibility: B.Tech (CSE/IT) 2025, Minimum 60%( No Backlogs)Selection Process:• Coding Rounds- 1 & 2• Technical Interviews• HR & Management InterviewTIAAJob Title: Cyber-Security TraineeCTC: 10.48 LPALocation: PunePosition Summary:Describing below the primary purpose and function of this job:• TIAA India is looking for trainees under Cyber Internship Program with an objective of providing exposure toyoung and budding tech talent and providing an opportunity for them to get acquainted with the Corporateculture and insights into Technology.• Selected Candidates will have the opportunity for 10 Weeks of internship with Cyber Security team beforeonboarding them as full-time employees as Trainees.•The Trainee will be responsible for development, communication, implementation, enforcement andmonitoring of security controls to protect the organization's technology assets from intentional or inadvertentmodification, disclosure or destruction. The trainee is responsible for monitoring computer security proceduresand maintaining IT security policies, procedures and testing results.• The Trainee typically works as part of a project team or as an individual contributor under guidance from aMentor. The Trainee will communicate progress, resolve technical issues and work with the appropriate teamsfor solutions.Fundamental knowledge and conceptual understanding required for-• Working knowledge of Computers and IT Concepts like OS, Network, Databases, IT Systems and web applications• Cyber Security Concepts and Principles covering various cyber domains such as Information Security, Dataprotection, IT Risk and Governance, Security Operations, System Design and Architecture, Web ApplicationDevelopment, SDLC concepts, DevOps, Application security and vulnerability testing, Encryption and Cryptography,CWPP, CSPM, Identity & Access Management, Privilege access management, Security Monitoring and reporting.• Web development tools and scripting knowledge for Python, Bash, Shell, R, PowerShell, JSON, and others• Conceptual knowledge on emerging technologies – Blockchain, Quantum Computing, AI / ML, Severless, APIKey Duties & Responsibilities:The Trainee will attend a boot camp (an initial training program) as per the requirement where they will undergo atraining program focusing on TIAA Values & Behavior, Business domains, technology platforms, etc. After successfulcompletion of boot camp the Trainee will be aligned to any of the below mentioned cyber domains based on theiraspirations, project requirements and interview performance.• Threat Monitoring• Vulnerability Management• Defense-in-Depth practices to protect networks.• Threat Intelligence• Platform Security Engineering - Network Security, End Point Security and Cloud Security• IAM Operations• Cyber Custom Development• Cyber Fraud Investigator• EKM Engineering",
        "Keys": [
            {
                "key": "Eligibility",
                "value": "B.Tech (CSE/IT) 2025, Minimum 60%( No Backlogs)"
            },
            {
                "key": "Selection Process",
                "value": "Coding Rounds- 1 & 2 Technical Interviews HR & Management Interview"
            },
            {
                "key": "Job Role",
                "value": "Cyber-Security Trainee"
            },
            {
                "key": "CTC",
                "value": 10.48
            },
            {
                "key": "Location",
                "value": "Pune"
            },
            {
                "key": "Responsibilities",
                "value": "TIAA India is looking for trainees under Cyber Internship Program with an objective of providing exposure toyoung and budding tech talent and providing an opportunity for them to get acquainted with the Corporateculture and insights into Technology.Selected Candidates will have the opportunity for 10 Weeks of internship with Cyber Security team beforeonboarding them as full-time employees as Trainees.The Trainee will be responsible for development, communication, implementation, enforcement andmonitoring of security controls to protect the organization's technology assets from intentional or inadvertentmodification, disclosure or destruction. The trainee is responsible for monitoring computer security proceduresand maintaining IT security policies, procedures and testing results.The Trainee typically works as part of a project team or as an individual contributor under guidance from aMentor. The Trainee will communicate progress, resolve technical issues and work with the appropriate teamsfor solutions. Threat Monitoring Vulnerability Management Defense-in-Depth practices to protect networks. Threat Intelligence Platform Security Engineering - Network Security, End Point Security and Cloud Security IAM Operations Cyber Custom Development Cyber Fraud Investigator EKM Engineering"
            },
            {
                "key": "skills",
                "value": "Working knowledge of Computers and IT Concepts like OS, Network, Databases, IT Systems and web applications Cyber Security Concepts and Principles covering various cyber domains such as Information Security, Data protection, IT Risk and Governance, Security Operations, System Design and Architecture, Web Application Development, SDLC concepts, DevOps, Application security and vulnerability testing, Encryption and Cryptography, CWPP, CSPM, Identity & Access Management, Privilege access management, Security Monitoring and reporting. Web development tools and scripting knowledge for Python, Bash, Shell, R, PowerShell, JSON, and others Conceptual knowledge on emerging technologies – Blockchain, Quantum Computing, AI / ML, Severless, API"
            }
        ]
    }
]