[
    {
        "Name": "Capgemini",
        "description": "CapgeminiCapgemini:Desired Competencies:• Communication: Strong interaction skills with partners.• Collaboration: Good interpersonal and teamwork abilities.• Flexibility: Adapt to multiple technologies, locations, and travel.• Initiative: Work independently and manage multiple tasks.• Other Skills: Strong analytical and problem-solving abilities.CTC: Analyst: 4.25 (4 LPA + 25k one-time incentive)Analyst (Differential Hiring): 5.75 (5.5 LPA + 25k one-time incentive)Senior Analyst: 7.5 LPASelection Process: The recruitment process consists of six rounds.Round 1: Technical AssessmentPseudocode 30 Questions (30 Min)Write logic: 7 Questions C, C++Write Output: 23 QuestionsRound 2: English Communication Test 30 Questions (30 Min)Topics: FIB, complete the sentence, spelling errors, synonyms, reading comprehension, para jumbled sentences,Synonyms/Antonyms, Indirect Direct SpeechRound 3: Game-Based Test 30 Questions (30 Min)Topics: Grid challenge: find symmetry and select the correct order of pattern by seeing it once DeductiveLogical Thinking, Inductive Logical Thinking, Motion Challenge, Switch challenge, Digit ChallengeRound 4: Behavioral Round 100 QuestionsThere will be no time limit for the round, but it is a mandatory one for everyone. This round helps themunderstand the innate profile of the candidate.Round 5: Technical Round (20 Min)Round 6: HR Interview (10 Min)Eligibility:No edu. Gaps allowedCS/IT group, ECE, ENNo live backlogs.Note: Candidates must have an active DigiLocker account and active mobile number linked with their Aadhar Number whileapplying for this job. Refer to attached pdf for a detailed walk-through of the process.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 4.25
            },
            {
                "key": "ctc_max",
                "value": 7.5
            },
            {
                "key": "role",
                "value": "Analyst, Senior Analyst"
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "Larsen & Toubro Infotech Ltd",
        "description": "LTILet's SolveLarsen & Toubro Infotech Ltd is a global technology consulting and digital solutions company helping more than 300clients succeed in a converging world. With operations in 30 countries and a team of more than 27000 employees, L&TInfotech is differentiated by its unique Business-to-IT Connect. Founded in 1997 and headquartered at Mumbai, LTI hasstrategic alliances with Web Methods, IBM, Microsoft, Business Objects, Oracle, Computer Associates, Siebel, Oracle,SAP, PeopleSoft, SAP, JD Edwards, Matrix One, Sun Microsystems, and HP. Larsen & Toubro Infotech was formerlyknown as L & T Information Technology Limited.The company is headquartered in Mumbai, India. It has additional offices in Pune, Chennai, Mysore, Bangalore, andHyderabad, India. Larsen & Toubro Infotech Limited operates as a subsidiary of Larsen & Toubro, Ltd. Larsen &Toubro Limited operates as a technology, engineering, construction, and manufacturing company worldwide.Key Persons:Chairman: A. M. NaikChief Executive Officer and Managing Director: Debashis ChatterjeeSelection process:Round 1: Online AssessmentTechnical: MCQ 40 Questions (40 Min)Coding:Level 1 – 1 Question (30 Min) @ Rs. 5 LPALevel 2 - 1 Question (45 Min) @ Rs. 6.5 LPA (on completion of level 1)Level 3 - 1 Question (45 Min) @ Rs. 8 LPA (on completion of level 1 & level 2)Round 2: Technical InterviewRound 3: HR InterviewRole: Graduate Engineer Trainee (GET)Applications are invited from all eligible students in following disciplines:• Civil• Electrical / EEE• Industrial• MechanicalEligibility:➤ 4 year / 8 semester Degree (full-time) course (students expecting to graduate by 30thJune 2025) after 10+2 / 10+Diploma.➤ The Aggregate for 10th,12th / Diploma, B.E. / B. Tech / B. Arch (5 Years/10Semesters) should be more than or equal to 65%.➤ No backlogs (past or live) during B.E. / B. Tech / B. Arch Course. Allsubjects/papers should be cleared in the first attempt only.➤ Any subject/paper appeared and not cleared in the first attempt is considered abacklog.➤ Post 10th Standard.• 12th Standard should have been completed within 2 years (or])• Diploma should have been completed within 3 years, as applicable.➤ B. E / B. Tech to be completed in 4 years if done after 12th and in 3 years ifdone post Diploma.➤ Should be an Indian national.The company reserves the right to alter the requirements & eligibility criteria.Compensation:Posting Category CTC Per AnnumOffice Based Posting Rs. 6,00,000/-Project Site Based Posting Rs. 6,57,000/Additionally, local transportation and canteen facilities are available based on the place ofposting, governed by the prevailing guidelines thereunder.Selection Process:Selection process consists of following steps:1. Online Test: (completely remote proctored)Aptitude Test (Analytical Ability, Verbal Ability and Numerical Ability) & TechnicalTest.2. Interview (including extempore) for candidates clearing the Online Test.3. Pre-employment medical test for candidates as per the guidelines providedby our Chief Medical Officer",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 5
            },
            {
                "key": "ctc_max",
                "value": 8
            },
            {
                "key": "role",
                "value": "Graduate Engineer Trainee (GET)"
            },
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "branch_2",
                "value": "Electrical / EEE"
            },
            {
                "key": "branch_3",
                "value": "Industrial"
            },
            {
                "key": "branch_4",
                "value": "Mechanical"
            }
        ]
    },
    {
        "Name": "Infosys",
        "description": "InfosysJob Role:1. Specialist Programmer: As an Infosys programmer in an SP role, you are expected to work in high endprojects using technologies like Machine Learning and Artificial Intelligence. Some of the technologies that youshould know before getting into Infosys SP role include:• Functional Programming– Scala, Akka• Java Microservices- Spring Boot, JEE• NoSQL and Scripting – ReachJS, Angular JS, MongoDB• Big Data and ML- Hadoop, Azure ML,• DevOps- Jira, GIr, JenKinsCTC: 9.5 LPASelection Process:Round 1: Online Assessment This round will have a total of 3 coding questions, and 180 minutes. It consists of 3levels- Easy, Medium, Hard .Round 2: Onsite Technical InterviewRound 3: Culture fit Interview.2. System Engineer : A System Engineer at Infosys is responsible for the design, development, implementation,and maintenance of systems that support the company's IT infrastructureCTC: 3.6 LPASelection Process:Round 1: In Campus Assessment. It consists of 7 sections-• Mathematical Ability• Reasoning Ability• Verbal Ability• Pseudo Code• Puzzle Solving• English Ability• Essay WritingRound 2: In Campus interviews, 20-30 minutesEligibility:•All percentages/CGPA should be a simple average for all subjects/semesters/years, including electives,optional subjects, additional subjects, practical subjects and languages.Class 10 and Class 12- 60% or equivalent 60%Diploma (if applicable) - 58% or equivalent 58%B.E./B. Tech - 60% or equivalent 60%• In case the candidate has done both Class 12 and Diploma, the best of the two is taken into consideration.• No active backlogs are allowed.• Candidate should be willing to relocate to any location as required by Infosys.• Candidate should be willing to work in different technologies as required by Infosys.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 3.6
            },
            {
                "key": "ctc_max",
                "value": 9.5
            },
            {
                "key": "role",
                "value": "Specialist Programmer, System Engineer"
            },
            {
                "key": "percent",
                "value": 58
            }
        ]
    },
    {
        "Name": "Amadeus",
        "description": "amadeusAt Amadeus, fresh graduates bring new perspectives and are seen as key contributors to the organization's technical andleadership growth. With Amadeus processing millions of transactions daily, system reliability and performance arecritical. We ensure customer satisfaction by delivering on their needs effectively.Fresh graduates are absorbed into various divisions based on their skills and interview evaluations. To prepare them, allgraduate engineers undergo an intensive 6–8 week training program, equipping them with the technical skills requiredfor their roles.Designation: Software EngineerСТС: 12,62,218/-Location: Bangalore/PuneSkill set 1: Java/J2EEA Java/J2EE developer is primarily a Back-end developer at Amadeus. You will be working on high volume productionsystems for the development and maintenance of Booking Engine which is a single set of code across a range ofAmadeus E-Commerce products. This code is very critical because a slight error might block the airlines/travel agentsfor processing the booking or ticketing.A Software developer is involved in many activities like:• Define user requirements for development or improvement of software solutions• Design technical solutions and perform feasibility studies• Innovate: Think out of the box and practice innovation in his/her daily tasks. Propose and develop innovativesolutions to the problems.• Propose viable technical solutions to Product Management and users for validation• Conduct unit, package and performance tests of the software and ensure a level of quality• Design and implement databases as necessary• Produce software documentation for the application and issue it• Support the end user in the Production phase by debugging existing software• solutions in response to Problem Tracking Records and Change Requests issued from• Product Management or Product DefinitionMain technical expertise on which the candidate will be trained on:• Core Java with J2EE experience• JUnits, Design Patterns, Struts, Spring MVC or any other framework• JSPs, Servlets, EJBs, DB, XML, WebServices etc. WebLogic, Ant/MavenSkill set 2: Java/UIA UI developer works on a presentation layer which is the layer mostly exposed to the customer. The more sturdy andintuitive it is; the more satisfied our customer is. The skills which a candidate develops are very niche and give thema clear advantage over other technical profiles. An engineer who can think UI and brings in innovation in his daily work.A very demanding position with skill set varying:• JQuery/ExtJS/YUI/DOJO or a similar JS framework• DataBase, ClearCase, WebLogic, Ant/Maven etc• JavaScript, OOJS CSS, HTML, AJAX, DOM, JSPs etc• Core Java/ J2EE experience is desirableSkill set 3: C/C++There are multiple work streams in Amadeus Labs, Bangalore who are focusing on core work areas where we needexpert C/C++ developers. A Software developer is involved in many activities like:• Define user requirements for development or improvement of software solutions• Design technical solutions and perform feasibility studies• Innovate: Think out of the box and practice innovation in his/her daily tasks. Proposeand develop innovative solutions to the problems.• Propose viable technical solutions to Product Management and users for validation• Conduct unit, package and performance tests of the software and ensure a level of• quality• Design and implement databases as necessary• Produce software documentation for the application and issue it• Support the end user in the Production phase by debugging existing software• solutions in response to Problem Tracking Records and Change Requests issued from• Product Management or Product DefinitionTechnical/Technical Skills• UNIX/ Linux, shell scripting• Strong knowledge of OOPS and coding with C++, design-patterns.• Database modeling, Oracle, Oracle BI, optimization techniques.• Good knowledge of development of a distributed system and of distributed• algorithms• Experience of Oracle environment and optimization techniques is a plus• Experience in multithreaded programming is a plusSkill Set 4 :Dev OpsThe DevOps engineer plays a key role to implement and support innovative solutions for operational requirements. Thescope of the role will encompass process automation solutions for the highly demanding Amadeus operational businessdomain.The DevOps Engineer will be involved in activities like",
        "Keys": [
            {
                "key": "ctc",
                "value": 12.62
            },
            {
                "key": "role",
                "value": "Software Engineer, DevOps Engineer"
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "domains",
                "value": "Java/J2EE, C/C++, DevOps"
            }
        ]
    }
]