[
    {
        "Name": "Acmegrade",
        "description": "Acmegrade Job Role: Business Development Associate The role is to maximize the efficiency of Practical Oriented Knowledge in Domains of Technology and Management among Potential Clientele Ranging from Undergraduates to Graduates in the field of Engineering and Commerce. Acmegrade deals with a series of Products and Services that benefits its Customers Practically as well as Academically in their fields of Interest and as a BDA (Business Development Associate), You are expected to find Potential Clients that fits the description, understand their difficulties, find their passion and interests and guide them cross their hurdles and reach their goal through Acmegrade's platform. Roles and Responsibilities: 1. Work closely with the Sales and Marketing Team in assisting the growth of the business by acquiring new business leads. 2. Pitch and promote Acmegrade's services to prospective clients. 3. Career counsel prospective students. Understand their learning objectives and offer them relevant Acmegrade Products 4. Collaborate with the Sales and Marketing team to plan and oversee new marketing initiatives 5. Set up meetings and follow up with potential clients. Preferred Competencies and Skills: 1. Must have Strong communication and interpersonal skills. 2. Must be detail-oriented, go-getter and a fast learner. 3. Critical and out-of-the-box thinking. 4. Strong organizational and leadership skills. 5. Ability to perform well under pressure.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Business Development Associate"
            },
            {
                "key": "Stipend",
                "value": 18000
            },
            {
                "key": "CTC",
                "value": 400000
            },
            {
                "key": "Location",
                "value": "Bangalore"
            },
            {
                "key": "Eligibility",
                "value": "All B.E / B. Tech / BBA / MBA and Other Branches."
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.E / B. Tech"
            },
            {
                "key": "Roles",
                "value": "1. Work closely with the Sales and Marketing Team in assisting the growth of the business by acquiring new business leads. 2. Pitch and promote Acmegrade's services to prospective clients. 3. Career counsel prospective students. Understand their learning objectives and offer them relevant Acmegrade Products 4. Collaborate with the Sales and Marketing team to plan and oversee new marketing initiatives 5. Set up meetings and follow up with potential clients."
            },
            {
                "key": "Desired Competencies",
                "value": "Preferred Competencies and Skills: 1. Must have Strong communication and interpersonal skills. 2. Must be detail-oriented, go-getter and a fast learner. 3. Critical and out-of-the-box thinking. 4. Strong organizational and leadership skills. 5. Ability to perform well under pressure."
            },
            {
                "key": "Selection Process",
                "value": "1. Aptitude Test. 2. Group Discussion (GD) Round. 3. Personal Interview (VIRTUAL MODE)."
            }
        ]
    },
    {
        "Name": "Grappus",
        "description": "About Grappus: Equal parts creative agency, engineering firm, and consultancy, Grappus has a reputation of doing things differently. We work with brands big and small, far and wide, helping them understand, prototype and deploy a broad range of custom tech. We value design and we cringe at bad UX. Each project is a clean slate, we don't have frameworks, or any pre-made formulas. We're not here to just grow big, make money and win awards. We're here to crack the process of building truly innovative products from scratch. Products that make people say 'damn'. People at Grappus usually experience a highly accelerated career growth well beyond the narrow constraints of their 'job description'. Here, the growth ladder is tailored to you. It operates exactly as fast as you can manage to grow. We think it's a waste when smart people are unable to make an impact. Our aim is to unleash your potential by giving you massive challenges and the freedom to solve them. We're in a fluid world, where we don't know what technologies we'll use next, or the projects we'll work on. We're actively searching for ways to shine a light on our blind spots, whether it is in the products we want to build, the problems we like to solve, or the company culture we try to create. That's what makes life at Grappus so exciting. Grappus is an ongoing experiment and you are a part of it. We'll be a different company a few years from now because you are going to change it for the better. We can't wait to see where you take us Position: Software Developer Requirements: • Should be well versed with concepts of OOPS and data structures • Should have knowledge of any of the programming languages like C, C++, Java, etc. Should be aware of database concepts and types like SQL (MySQL, etc) & NoSQL (MongoDB, etc) • Should have strong organizational skills to juggle multiple tasks within the constraints on timelines • Should be keen to learn new technologies and updated about the latest developments Should be aware about software development fundamentals, application architecture and design patterns • The ability to communicate complex procedures to other colleagues Skills Required: • Masters/Bachelors degree in Computer Science & IT • Good written and verbal communication skills • Understanding of the Software development lifecycle • Good Analytical and problem solving skills • Self-motivated with the ability to prioritize, meet deadlines, and manage changing priorities Benefits: • We don't track these hours you put in or ask you to fill time sheets. We don't believe in micromanaging, if you're struggling, ask for help. If someone else is, offer some support. • We never mind if people make mistakes or screw up in any way, and offer full encouragement to help people learn fast by failing fast. • We always encourage people to be completely candid, raise alarms, or log complaints anonymously in our feedback tool, no matter how harsh. • We are a 'Work from Anywhere' company, since passionate, driven people can work from anywhere they want; their homes, or cafes, or mountains, or beaches, anywhere. • We have a 15-day notice period. We want to build a place where people work willingly and passionately.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Software Developer"
            },
            {
                "key": "CTC",
                "value": 550000
            },
            {
                "key": "Eligibility",
                "value": "BCA, B.Tech, BSc CS, MCA, MSc CS & M.Tech (Final Year)"
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.Tech"
            },
            {
                "key": "Selection Process",
                "value": "1. Gamified assessment 2. First technical round 3. Second technical round 4. Cultural discussion 5. Final management round"
            },
            {
                "key": "requirements",
                "value": "• Should be well versed with concepts of OOPS and data structures • Should have knowledge of any of the programming languages like C, C++, Java, etc. Should be aware of database concepts and types like SQL (MySQL, etc) & NoSQL (MongoDB, etc) • Should have strong organizational skills to juggle multiple tasks within the constraints on timelines • Should be keen to learn new technologies and updated about the latest developments Should be aware about software development fundamentals, application architecture and design patterns"
            },
            {
                "key": "skills",
                "value": "Skills Required: • Masters/Bachelors degree in Computer Science & IT • Good written and verbal communication skills • Understanding of the Software development lifecycle • Good Analytical and problem solving skills • Self-motivated with the ability to prioritize, meet deadlines, and manage changing priorities • The ability to communicate complex procedures to other colleagues"
            },
            {
                "key": "Java",
                "value": "Java"
            },
            {
                "key": "MongoDB",
                "value": "MongoDB"
            }
        ]
    },
    {
        "Name": "Cloud 4C",
        "description": "Cloud 4C Job Title: Associate Engineer (Civil Engineer, Electrical Engineer, Mechanical Engineer) Service Level Agreement: 2 Years Roles and Responsibilities: We are seeking a Graduate Civil Engineer to join our multi-disciplinary Data Centre design teams to work on a Data Centre projects, mainly covering Data Centre's/Mission Critical projects, with leading architects and clients both in India and overseas. We arelooking for a candidate who will fit in with our dynamic teams in a progressive, design- led environment with the successful candidate becoming a contributor to the excellent atmosphere which exists within the group. • Undertaking structural + interior design for DC projects of varying scales. • Knowledge of data center projects and its latest trend for cost-effective design. • Preparation of drawings in Revit and CAD software. A good knowledge of Revit and CAD will be preferable. • Good knowledge of STADD software for structural design. • Preparation of bill of material for the structural and interior design. • Good knowledge of different structural design including the combination of MS and RCC. • Civil design knowledge for the following - Design of structural frame for high rise buildings with high floor loading. Design of Flat Slab structure. Design of Campsite structure - Knowledge of latest construction mythology andmaterials. Knowledge of various basic interior finishes material. • Working closely with Architects/Consultants and other in-house design engineers. • Production of engineering drawings. Preparing and coordinating mechanical reports and specifications. • Knowledge of Uptime and TIA standards for data centers design. • Design and coordinating work with engineers of other disciplines. • Attending meetings and communicating with clients to establish their needs. • Working with the project team to ensure production of deliverables to agreed timelines and within budget. • Sharing technical knowledge with the members of the team. • Up to date knowledge of the latest trend in the civil discipline in particular relation to the Data Centers design. • Preparation of financial analysis for the various design of DC projects. • Supporting procuring work with the best available products in the market. • Responsible and accountable for maintaining client relations. Requirements: • Degree qualified in Civil Engineering. • Extensive knowledge in the field of civil design and the latest trends. • Be able to design and deliver structural solutions for mission-critical projects. • The ability to work under pressure and meet strict deadlines is essential. • Excellent planning and organization skills. • Excellent communications skills (both written and verbal). • Able to demonstrate strong commercial acumen. Eligibility Criteria: • Very Good Communication Skills • 75% aggregate in all academics (SSC/Xth, Inter/ XIIth, & B.Tech. / BE (Overall 75%) • EAMCET Rank < 30,000 / ECET Rank < 3,000 / IIT Mains Rank < 10,000 / State Level Common Engg. Entrance Exam Rank < 20000 or >60% Percentile.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Associate Engineer (Civil Engineer, Electrical Engineer, Mechanical Engineer)"
            },
            {
                "key": "CTC",
                "value": 400000
            },
            {
                "key": "Location",
                "value": "Mumbai, Hyderabad, Bangalore, Noida"
            },
            {
                "key": "Responsibilities",
                "value": "We are seeking a Graduate Civil Engineer to join our multi-disciplinary Data Centre design teams to work on a Data Centre projects, mainly covering Data Centre's/Mission Critical projects, with leading architects and clients both in India and overseas. We arelooking for a candidate who will fit in with our dynamic teams in a progressive, design- led environment with the successful candidate becoming a contributor to the excellent atmosphere which exists within the group. • Undertaking structural + interior design for DC projects of varying scales. • Knowledge of data center projects and its latest trend for cost-effective design. • Preparation of drawings in Revit and CAD software. A good knowledge of Revit and CAD will be preferable. • Good knowledge of STADD software for structural design. • Preparation of bill of material for the structural and interior design. • Good knowledge of different structural design including the combination of MS and RCC. • Civil design knowledge for the following - Design of structural frame for high rise buildings with high floor loading. Design of Flat Slab structure. Design of Campsite structure - Knowledge of latest construction mythology andmaterials. Knowledge of various basic interior finishes material. • Working closely with Architects/Consultants and other in-house design engineers. • Production of engineering drawings. Preparing and coordinating mechanical reports and specifications. • Knowledge of Uptime and TIA standards for data centers design. • Design and coordinating work with engineers of other disciplines. • Attending meetings and communicating with clients to establish their needs. • Working with the project team to ensure production of deliverables to agreed timelines and within budget. • Sharing technical knowledge with the members of the team. • Up to date knowledge of the latest trend in the civil discipline in particular relation to the Data Centers design. • Preparation of financial analysis for the various design of DC projects. • Supporting procuring work with the best available products in the market. • Responsible and accountable for maintaining client relations."
            },
            {
                "key": "Requirements",
                "value": "• Degree qualified in Civil Engineering. • Extensive knowledge in the field of civil design and the latest trends. • Be able to design and deliver structural solutions for mission-critical projects. • The ability to work under pressure and meet strict deadlines is essential. • Excellent planning and organization skills. • Excellent communications skills (both written and verbal). • Able to demonstrate strong commercial acumen."
            },
            {
                "key": "Eligibility",
                "value": "• Very Good Communication Skills • 75% aggregate in all academics (SSC/Xth, Inter/ XIIth, & B.Tech. / BE (Overall 75%) • EAMCET Rank < 30,000 / ECET Rank < 3,000 / IIT Mains Rank < 10,000 / State Level Common Engg. Entrance Exam Rank < 20000 or >60% Percentile."
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.Tech. / BE"
            }
        ]
    },
    {
        "Name": "YOptima",
        "description": "Eligibility:CS/IT group only.80% and above throughout (10th,12th,UG -until 6th Semester)No Live Backlog.YOptimaYOptimaJob Role: Account ExecutiveCTC: 7 LPA, Stipend: 25k/monthLocation: Jui Nagar, Navi MumbaiPost-Internship Opportunity: After successfully completing the internship and a thorough assessment, candidates willbe offered a permanent role with a total compensation of ₹7 Lakh CTC (₹5 Lakh Fixed + *2 Lakh Variable+ otherbenefits) for BTech graduates.Responsibilities:• Analyze digital behavior of the online consumers across different digital channels and design actionableinsights and solutions to improve marketing ROI at scale.•Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advancedanalytical methods as needed.• Assist in designing relevant marketing plans and strategies for digital ad campaigns, combining understandingof consumer behavior, data driven insights, product positioning and marketing objectives.• Troubleshoot technical issues both internally and with Third party vendors.• Manage servicing needs of clients and win sustainable customer delight and brand advocacy.Competencies:• 0-2 yrs Exp with Bachelor's or Master's degree in a quantitative discipline (e.g. business administration,engineering, statistics, operations research, economics, mathematics).• Strong analytical and problem-solving skills.• Ability to present results of complex analysis compellingly to both technical and non-technical audiences.• Self-motivated with the ability to work independently and within a team.Selection Process:Round1: 8D Online Assessment – A mandatory evaluation.Round 2: Shortlisted candidates from the assessment will go through 2-3 rounds of interviews with the Co-founders(COO & CEO).",
        "Keys": [
            {
                "key": "Eligibility",
                "value": "CS/IT group only.80% and above throughout (10th,12th,UG -until 6th Semester)No Live Backlog."
            },
            {
                "key": "Job Role",
                "value": "Account Executive"
            },
            {
                "key": "CTC",
                "value": 7
            },
            {
                "key": "Stipend",
                "value": 25000
            },
            {
                "key": "Location",
                "value": "Jui Nagar, Navi Mumbai"
            },
            {
                "key": "Responsibilities",
                "value": "Analyze digital behavior of the online consumers across different digital channels and design actionableinsights and solutions to improve marketing ROI at scale.Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advancedanalytical methods as needed.Assist in designing relevant marketing plans and strategies for digital ad campaigns, combining understandingof consumer behavior, data driven insights, product positioning and marketing objectives.Troubleshoot technical issues both internally and with Third party vendors.Manage servicing needs of clients and win sustainable customer delight and brand advocacy."
            },
            {
                "key": "Desired Competencies",
                "value": "0-2 yrs Exp with Bachelor's or Master's degree in a quantitative discipline (e.g. business administration,engineering, statistics, operations research, economics, mathematics).Strong analytical and problem-solving skills.Ability to present results of complex analysis compellingly to both technical and non-technical audiences.Self-motivated with the ability to work independently and within a team."
            },
            {
                "key": "Selection Process",
                "value": "Round1: 8D Online Assessment – A mandatory evaluation.Round 2: Shortlisted candidates from the assessment will go through 2-3 rounds of interviews with the Co-founders(COO & CEO)."
            }
        ]
    }
]