[
    {
        "Name": "Sagacious IP",
        "description": "5 Sagacious IP Sagacious IP About Sagacious IP: Sagacious IP is a global leader in Intellectual Property (IP) solutions, providing technical research and consulting services primarily focused on patents. We work with a diverse range of clients, including Fortune 500 companies, start- ups, international law firms, and corporate legal departments. Our expertise spans multiple domains, such as Biotech, Pharma, Mechanical, Electronics, and Telecom. Our headquarters are located in Gurugram (Delhi NCR), where we are currently hiring. Job Role: Patent Analyst CTC: 5.5 LPA, Stipend: 18k/month Job Location: Gurugram Eligibility Criteria: Min. 65% or above in 10th, 12th & Graduation No Live Backlog Candidates will be required to sign a 12-month employment bond upon joining. Role: • Understanding the technology, product, or the invention. Discuss the same with the • seniors & the internal team. If required, discuss the invention with the inventors/researchers/patent lawyers/client over the conference call or in-person meeting to calibrate or to get more details. • Performing various patent searches - prior art search, novelty search, patentability • search, patent portfolio, patent landscaping, validity searches, sequence searches, • structure searches etc. • Conduct comprehensive searches of technical and patent information using online • database and other information resources. • Analyze and summarize search results • Provide insightful evaluation and analysis of results. • Preparing final reports and deliverables as per required standards • Deliver timely, value-added patent search reports. • Discuss the finding/results with the inventor/client over the conference call. • Helping the inventor/client to secure a patent or else, helping them to design-around • the product or the invention. Compensation and Employment Details: • Fixed CTC: INR 550,000 per annum upon successful completion of the 6-month training period at Sagacious IP and B.Tech degree. • Internship Stipend: INR 18,000 per month. The internship period may be extended by 1 month if performance is not satisfactory. • Bond: Candidates will be required to sign a 12-month employment bond upon joining. • Training Period: During this period, the intern's performance will be evaluated to confirm their role as a Patent Analyst. Mandatory Skills: Good analytical skills Good Technical Knowledge Good Interpersonal skill",
        "Keys": [
            {
                "key": "ctc",
                "value": 5.5
            },
            {
                "key": "stipend",
                "value": 18
            },
            {
                "key": "location_1",
                "value": "Gurugram"
            },
            {
                "key": "role",
                "value": "Patent Analyst"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "B.Tech"
            }
        ]
    },
    {
        "Name": "Porter",
        "description": "Porter Internship Opportunity at Porter: 6 Months (JAN – JUNE) Post-Internship Opportunities: Upon successful completion of the internship, candidates may be offered a Pre- Placement Offer (PPO) for full-time roles (Performance Based Conversion) Stipend : 80k Upon FTE Conversion CTC: ₹17 LPA (₹16 LPA fixed + ₹1 Lakh joining bonus) Location : Bengaluru (5 days work from office) Role 1: SDE1 Intern Technical Overview: • You will be expected to design, develop and maintain large-scale complex backend web applications. • You will be expected to rapidly learn and apply relevant new technologies. • You will be having a high level of interaction with business and product stakeholders. • You will be working on the entire web application stack, which includes: • Web server hosting • RESTful communication • Message brokering • Backend application layer, which includes the service and domain layers • Data layer for persistence or caching • You will be participating in an agile software development cycle, which includes: • Design • Development • Code Review • Unit and Integration Testing • Release • You will be exposed to the following technologies: • Web application frameworks: Ruby on Rails,Node.js, Java Play, Vert.x, AIOHTTP, AWS Lambda • Languages: Ruby, Java,Kotlin, Javascript, Python • Data stores: PostgreSQL,Aerospike, Redis,Amazon Redshift • Communication: HTTP, Amazon SQS, Sidekiq,Amazon SNS • Server Management: Amazon ECS,Docker Role 2: Analytics Intern We are seeking a dynamic and enthusiastic Intern to join our analytics team. As an Intern, you will have the opportunity to gain hands-on experience in the field of business analysis, working closely with our seasoned professionals. This internship provides a valuable opportunity to apply theoretical knowledge in a real-world business environment, contributing to meaningful projects and learning from industry experts. As an Intern, you will play a crucial role in supporting our organization's data-driven decision- making processes. You will work closely with senior analysts and managers to gather, analyze, and interpret business data, providing valuable insights to enhance our operational efficiency and overall performance. Responsibilities: Requirements Gathering • Assist in gathering and documenting business requirements from stakeholders through interviews, surveys, and workshops. • Analyze gathered information to identify patterns, trends, and potential areas for improvement. Data Analysis • Analyze data sets to extract valuable insights, identify trends, and support decision- making processes. • Prepare clear and concise reports and visualizations to communicate data-driven findings. Process Documentation and Reporting • Document existing business processes, workflows, and system interactions. • Contribute to the creation of process flowcharts, diagrams, and other documentation formats to enhance understanding and clarity. • Maintain accurate documentation of business requirements, processes, and analysis results. • Assist in generating regular reports and updates for project stakeholders and management. Stakeholder Communication • Communicate effectively with stakeholders to gather feedback, clarify requirements, and ensure alignment with business needs and proposed solutions. • Prepare and deliver presentations to convey analysis findings and recommendations. Problem Solving • Work collaboratively with cross-functional teams to identify problems, propose solutions, and assist in their implementation. • Contribute innovative ideas and suggestions to address business challenges. Learning and Development • Stay updated with industry best practices, emerging technologies, and trends related to business analysis. • Participate in training programs and skill development initiatives to enhance expertise in business analysis techniques and tools. Required Skills and Qualifications: • Pursuing Bachelor's degree in Information Technology, Computer Science, or a related field. • Basic understanding of SQL, Python / R is must • Passion for Data & Analytics • Strong analytical and critical thinking skills. • Good communication and interpersonal abilities. • Basic understanding of business processes and data analysis concepts. • Eagerness to learn, adapt and take on new challenges. •Ability to work effectively in a team and collaborate with colleagues from diverse backgrounds. Selection Process: Round 1: Resume Shortlisting Round 2: Online Assessment ( For Data Analyst: 2 SQL que, 2 python code, Tech MCQ) (For SDE: 2 SQL que, 1 JAVA code, Tech MCQ) Round 3: Technical Interview (Tough) Round 4: Culture Round (Tough) Round 5: HR Interview Eligibility: Required minimum 10th -70%, 12th / Diploma -70%, Degree - 7 CGPA No Live Backlog.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 16
            },
            {
                "key": "ctc_max",
                "value": 17
            },
            {
                "key": "stipend",
                "value": 80
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "role",
                "value": "SDE1 Intern"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "branch_1",
                "value": "Information Technology"
            },
            {
                "key": "branch_2",
                "value": "Computer Science"
            }
        ]
    },
    {
        "Name": "TURING",
        "description": "Turning. TURING Job Role: Data Analyst CTC: 6 LPA, Bond of 2 years Job Location: Remote Working Job Responsibilities: • Write effective, high-quality code to train and evaluate AI models. • Evaluate and rank AI model responses based on user requests across a wide range of CS topics, providing detailed rationales for your decisions. • Craft perfect responses and articulate what constitutes an ideal response content-wise. • Explain your reasoning and logic comprehensively for your actions. • Conduct peer code reviews, offering constructive feedback and criticism. Requirements: • Bachelor's or Master's Degree in Engineering or Computer Science (BE, B.Tech, MCA. Exceptional critical thinking and problem-solving skills (including, but not limited to, good • knowledge of algorithms and data structures, system design, coding practices, etc.) • Excellent English communication skills, with the ability to articulate ideas clearly and • comprehensively. Strong ability to write technical documentation/explanations. Additional Details: Must have a 4-hour overlap with US time zones. Full-time position: 40 hours per week. Must have a laptop and remote work setup. Eligibility Criteria: Min. 65% in throughout academics (10th, 12th, Degree) No Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Remote Working"
            },
            {
                "key": "role",
                "value": "Data Analyst"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Engineering"
            },
            {
                "key": "branch_2",
                "value": "Computer Science"
            },
            {
                "key": "branch_3",
                "value": "BE"
            },
            {
                "key": "branch_4",
                "value": "B.Tech"
            }
        ]
    },
    {
        "Name": "TURING",
        "description": "Job Role: Business Analyst CTC: 3.5 LPA Branches Eligible: BBA, BCA Requirements: • English Proficiency: Ability to read and write in English with a high degree of comprehension skills. • Analytical Skills: Good research and analytical skills • Feedback Skills: Ability to provide constructive feedback and detailed annotations. • Creative Thinking: Creative and lateral thinking abilities. • Communication: Excellent communication and collaboration skills. • Independence: Self-motivated and able to work independently in a remote setting. • Commitment: Ability to commit to 40 hours per week for the contract duration overlapping US hours. • Technical Setup: Desktop/Laptop set up with a good internet connection. Qualifications: • Bachelor's or Master's degree in Engineering, Literature, Journalism, Communications, Arts, Statistics, or a related field. We are open to candidates who do not have a Bachelor's degree but have experience in the area. • Experience writing professionally (business analysts, research analyst, copywriter, journalist, technical writer, editor, translator, etc.) • Understanding of Excel and Google Suite. • Proficiency in Data interpretation, Logical reasoning and Basic arithmetic is highly desirable. Benefits: • Competitive compensation based on experience and expertise. • Flexible working hours and remote work environment. • Opportunity to work on cutting-edge AI projects with leading LLM companies. • Potential for contract extension based on performance and project needs.",
        "Keys": [
            {
                "key": "ctc",
                "value": 3.5
            },
            {
                "key": "role",
                "value": "Business Analyst"
            },
            {
                "key": "branch_1",
                "value": "BBA"
            },
            {
                "key": "branch_2",
                "value": "BCA"
            },
            {
                "key": "branch_3",
                "value": "Engineering"
            },
            {
                "key": "branch_4",
                "value": "Literature"
            }
        ]
    }
]