[
    {
        "Name": "TIAA",
        "description": "Job Title: Cyber-Security Trainee CTC: 10.48 LPA Location: Pune Position Summary: Describing below the primary purpose and function of this job: TIAA India is looking for trainees under Cyber Internship Program with an objective of providing exposure to young and budding tech talent and providing an opportunity for them to get acquainted with the Corporate culture and insights into Technology. Selected Candidates will have the opportunity for 10 Weeks of internship with Cyber Security team before onboarding them as full-time employees as Trainees. The Trainee will be responsible for development, communication, implementation, enforcement and monitoring of security controls to protect the organization's technology assets from intentional or inadvertent modification, disclosure or destruction. The trainee is responsible for monitoring computer security procedures and maintaining IT security policies, procedures and testing results. The Trainee typically works as part of a project team or as an individual contributor under guidance from a Mentor. The Trainee will communicate progress, resolve technical issues and work with the appropriate teams for solutions. Fundamental knowledge and conceptual understanding required for- Working knowledge of Computers and IT Concepts like OS, Network, Databases, IT Systems and web applications Cyber Security Concepts and Principles covering various cyber domains such as Information Security, Data protection, IT Risk and Governance, Security Operations, System Design and Architecture, Web Application Development, SDLC concepts, DevOps, Application security and vulnerability testing, Encryption and Cryptography, CWPP, CSPM, Identity & Access Management, Privilege access management, Security Monitoring and reporting. Web development tools and scripting knowledge for Python, Bash, Shell, R, PowerShell, JSON, and others Conceptual knowledge on emerging technologies – Blockchain, Quantum Computing, AI / ML, Severless, API Key Duties & Responsibilities: The Trainee will attend a boot camp (an initial training program) as per the requirement where they will undergo a training program focusing on TIAA Values & Behavior, Business domains, technology platforms, etc. After successful completion of boot camp the Trainee will be aligned to any of the below mentioned cyber domains based on their aspirations, project requirements and interview performance. Threat Monitoring Vulnerability Management Defense-in-Depth practices to protect networks. Threat Intelligence Platform Security Engineering - Network Security, End Point Security and Cloud Security IAM Operations Cyber Custom Development Cyber Fraud Investigator EKM Engineering Third Party information Security Risk management Eligibility Criteria: Minimum 60% aggregate in 10th, 12th and Graduation B.E/B.Tech in Cyber Security only",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Cyber-Security Trainee"
            },
            {
                "key": "CTC",
                "value": 10.48
            },
            {
                "key": "Location",
                "value": "Pune"
            },
            {
                "key": "Eligibility",
                "value": "Minimum 60% aggregate in 10th, 12th and Graduation B.E/B.Tech in Cyber Security only"
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.E/B.Tech in Cyber Security only"
            },
            {
                "key": "Responsibilities",
                "value": "The Trainee will attend a boot camp (an initial training program) as per the requirement where they will undergo a training program focusing on TIAA Values & Behavior, Business domains, technology platforms, etc. After successful completion of boot camp the Trainee will be aligned to any of the below mentioned cyber domains based on their aspirations, project requirements and interview performance. Threat Monitoring Vulnerability Management Defense-in-Depth practices to protect networks. Threat Intelligence Platform Security Engineering - Network Security, End Point Security and Cloud Security IAM Operations Cyber Custom Development Cyber Fraud Investigator EKM Engineering Third Party information Security Risk management"
            },
            {
                "key": "DevOps",
                "value": "SDLC concepts, DevOps, Application security and vulnerability testing"
            },
            {
                "key": "training program",
                "value": "initial training program"
            }
        ]
    },
    {
        "Name": "Quantiphi",
        "description": "Quantiphi Location: Mumbai/Banglore Eligibility Criteria: Branches - B.E, M.E, MCA, B.Tech & M.Tech 70% and above in 10th, 12th and Graduation (till now) with no-reappears/backlogs. CTC: 1. Stipend 10K for 4 months and virtual internship 2. Stipend 23K for 2 months and in person/hybrid internship 3.CTC on FTE Conversion: 8.5 LPA (6.5 LPA - Fixed & 2 Lakhs - QCDP) Job Role: Data Engineer Responsibilities: Work with business users and other stakeholders to understand business processes. Ability to understand, design and implement Dimensions and Fact tables Identify and implement data transformation/cleansing requirements Profile source data to check data quality and develop Data Pipelines to implement ETL logic Create and execute test plans debug existing Data Pipelines Create data visualizations Write SQL code-Queries/Stored Procedures/Functions Requirements: Strong SQL writing skills Strong knowledge on Data Warehouse and ETL concepts Familiarity with Kimball and Inmon Data Warehouse methodology Understand project-specific requirements, standards, guidelines, and processes Demonstrated success working in a team-based environment Good written/oral communication skills Strong analytical and problem solving skills Job Role: Business Analyst Responsibilities: Participate in on-site and offshore engagements to deliver services to our client base. Translate the business requirements into technical problems for the team and deliver technical solutions in business terms to the client. Work in conjunction with the decision science and data analytics team to deliver solutions to clients. Create a solution plan for the short-term and long-range projects and ensure the timely execution of the same. Analyze the raw data to understand the existing patterns in data. Deliver actionable insights to clients by analyzing the results and business understanding. Requirements: The position will be involved in delivering end to end solutions with quality assurance to the client by working in conjunction with technical team. Strong oral and written communication skills Strong problem solving skills Good at critical thinking and should have a structured approach Promptness to deal with different situations Good interpretation skills and identifying the hidden relations Must be a team player Must be willing to travel domestically and internationally Job Role: Software Developer Job Description: We are looking for a Web Developer who is motivated to combine the art of design with programming. As a Web Developer, you are expected to be highly proficient in programming methodologies along with a sense of design that will be used to build effective user experience for any application you will build. Having the knowledge of front-end, back-end, databases and cloud computing will enable you to grow in this role. Responsibilities: Build reusable code and libraries for future use Optimize application for maximum speed, scalability and security Design scalable and effective database schemas for best performance Develop/design user interfaces for client and server side portals Build REST/GraphQL APIs for the server side and SPAs/PWAs for the client side applications Collaborate with other team members and stakeholders Skills and Qualifications: Proficient understanding of web markup, including HTML5, CSS3 Proficiency in, at least, one programming language such as Java, C, C++, C# or Python Understanding of core programming concepts and OOP concepts In-depth knowledge of Data Structures and its applications Understanding relational and non-relational databases and their uses Positive outlook towards problem solving Love to work on cutting edge technology Ability to work in a dynamic environment using agile methodologies Strong analytical and problem solving skills. Good to have: Proficient understanding of code versioning tools Git Knowledge on any modern Javascript Framework will be an added advantage Knowledge on NodeJS will be an added advantage Knowledge of working on Cloud technologies like Google cloud platform/ AWS Familiarity with tools such as Photoshop is a plus Job Role: Platform Engineer Responsibilities: Scale distributed applications, make architectural trade-offs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality. Design and develop scripts to build and deploy services using automated tools with focus on developing hooks for operations and monitoring support. Provide guidance to the team to implement services and systems that are highly available, scalable, and self- recoverable on cloud platforms Design and deploy metrics, monitoring, and logging systems to understand the system performance and isolate bottlenecks. Introduce new cloud technologies, tools & processes to keep innovating in commerce area to drive greater business value Requirements: Strong fundamentals in object-oriented design, data structures, algorithms, complexity analysis, distributed computing and operating systems etc. Proficiency in, at least, one modern programming language such as Java, C, C++, C#, or Perl Experience in Scripting language like Bash/shell scripting Understand project-specific requirements, standards, guidelines, and processes Demonstrated success working in a team-based environment Good written/oral communication skills Strong analytical and problem solving skills",
        "Keys": [
            {
                "key": "Location",
                "value": "Mumbai/Banglore"
            },
            {
                "key": "Eligibility",
                "value": "Branches - B.E, M.E, MCA, B.Tech & M.Tech 70% and above in 10th, 12th and Graduation (till now) with no-reappears/backlogs."
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.E, M.E, MCA, B.Tech & M.Tech"
            },
            {
                "key": "Stipend",
                "value": 10000
            },
            {
                "key": "Stipend",
                "value": 23000
            },
            {
                "key": "CTC",
                "value": 8.5
            },
            {
                "key": "Job Role",
                "value": "Data Engineer"
            },
            {
                "key": "Responsibilities",
                "value": "Work with business users and other stakeholders to understand business processes. Ability to understand, design and implement Dimensions and Fact tables Identify and implement data transformation/cleansing requirements Profile source data to check data quality and develop Data Pipelines to implement ETL logic Create and execute test plans debug existing Data Pipelines Create data visualizations Write SQL code-Queries/Stored Procedures/Functions"
            },
            {
                "key": "Requirements",
                "value": "Strong SQL writing skills Strong knowledge on Data Warehouse and ETL concepts Familiarity with Kimball and Inmon Data Warehouse methodology Understand project-specific requirements, standards, guidelines, and processes Demonstrated success working in a team-based environment Good written/oral communication skills Strong analytical and problem solving skills"
            },
            {
                "key": "Job Role",
                "value": "Business Analyst"
            },
            {
                "key": "Responsibilities",
                "value": "Participate in on-site and offshore engagements to deliver services to our client base. Translate the business requirements into technical problems for the team and deliver technical solutions in business terms to the client. Work in conjunction with the decision science and data analytics team to deliver solutions to clients. Create a solution plan for the short-term and long-range projects and ensure the timely execution of the same. Analyze the raw data to understand the existing patterns in data. Deliver actionable insights to clients by analyzing the results and business understanding."
            },
            {
                "key": "Requirements",
                "value": "The position will be involved in delivering end to end solutions with quality assurance to the client by working in conjunction with technical team. Strong oral and written communication skills Strong problem solving skills Good at critical thinking and should have a structured approach Promptness to deal with different situations Good interpretation skills and identifying the hidden relations Must be a team player Must be willing to travel domestically and internationally"
            },
            {
                "key": "Job Role",
                "value": "Software Developer"
            },
            {
                "key": "Job Description",
                "value": "We are looking for a Web Developer who is motivated to combine the art of design with programming. As a Web Developer, you are expected to be highly proficient in programming methodologies along with a sense of design that will be used to build effective user experience for any application you will build. Having the knowledge of front-end, back-end, databases and cloud computing will enable you to grow in this role."
            },
            {
                "key": "Responsibilities",
                "value": "Build reusable code and libraries for future use Optimize application for maximum speed, scalability and security Design scalable and effective database schemas for best performance Develop/design user interfaces for client and server side portals Build REST/GraphQL APIs for the server side and SPAs/PWAs for the client side applications Collaborate with other team members and stakeholders"
            },
            {
                "key": "Qualifications",
                "value": "Proficient understanding of web markup, including HTML5, CSS3 Proficiency in, at least, one programming language such as Java, C, C++, C# or Python Understanding of core programming concepts and OOP concepts In-depth knowledge of Data Structures and its applications Understanding relational and non-relational databases and their uses Positive outlook towards problem solving Love to work on cutting edge technology Ability to work in a dynamic environment using agile methodologies Strong analytical and problem solving skills. Good to have: Proficient understanding of code versioning tools Git Knowledge on any modern Javascript Framework will be an added advantage Knowledge on NodeJS will be an added advantage Knowledge of working on Cloud technologies like Google cloud platform/ AWS Familiarity with tools such as Photoshop is a plus"
            },
            {
                "key": "Java",
                "value": "Java"
            },
            {
                "key": "Questions C, C++",
                "value": "C, C++"
            },
            {
                "key": "Job Role",
                "value": "Platform Engineer"
            },
            {
                "key": "Responsibilities",
                "value": "Scale distributed applications, make architectural trade-offs applying synchronous and asynchronous design patterns, write code, and deliver with speediness and quality. Design and develop scripts to build and deploy services using automated tools with focus on developing hooks for operations and monitoring support. Provide guidance to the team to implement services and systems that are highly available, scalable, and self- recoverable on cloud platforms Design and deploy metrics, monitoring, and logging systems to understand the system performance and isolate bottlenecks. Introduce new cloud technologies, tools & processes to keep innovating in commerce area to drive greater business value"
            },
            {
                "key": "Requirements",
                "value": "Strong fundamentals in object-oriented design, data structures, algorithms, complexity analysis, distributed computing and operating systems etc. Proficiency in, at least, one modern programming language such as Java, C, C++, C#, or Perl Experience in Scripting language like Bash/shell scripting Understand project-specific requirements, standards, guidelines, and processes Demonstrated success working in a team-based environment Good written/oral communication skills Strong analytical and problem solving skills"
            }
        ]
    },
    {
        "Name": "Demand Farm",
        "description": "Demand Farm Position: Associate Product Engineer (internship cum full time employment) Experience: Fresher Approx. Package: Up to Rs. 8,00,000/- Per Annum (after internship period of 6 months and confirmation) Job Location: Remote (Work_From_Home) IMP NOTE: Initial 6 months would be internship and during internship interns will get stipend After successful completion of internship and based on performance during internship candidates will be offered full time employment Role & Responsibilities: Build high-performing, scalable, enterprise-grade applications. Will be part of a talented software team that works on mission-critical applications. Contribute to all phases of the development lifecycle. Design and maintain the most efficient data pipeline architecture possible. Assemble huge, complex data sets that satisfy both functional and non-functional business needs. Working closely with analysts, designers and staff Producing detailed specifications and writing the program codes Skills Required: The candidate has excellent problem-solving and multitasking skills. The candidate can work as an individual contributor. Object-Oriented Analysis and design using common design patterns. Highly proficient with Core Java, and Java Spring. Understanding of server-side rendering and its benefits and use cases. Educational Criteria: BE / BTech (IT/CS branch only) 2024 Pass out only 60% and Above throughout all academics ( 10th/12th/Diploma/Degree) Round of Interviews: Online Aptitude cum Technical Test (2 rounds) Pre HR Round Technical Interview (2 rounds) Final HR Interview TERMS & CONDITIONS: The intern will work from home but in full time mode The intern needs to work 9 Hrs (includes 1 hr of break) per day, 5 days a week for the internship Stipend provided during the internship will be Rs 20,000 per month Full time employment confirmation is completely based on performance The pay after confirmation will be Rs. 8,00,000 Fixed CTC There will be regular performance assessments done during the internship period. If the performance during internship is not satisfactory, there can be a termination even before completing the 6 months internship Unpaid leaves will be granted to the interns for exams during the internship The interns are supposed to take necessary permissions from college for joining the internship before the date of joining. DemandFarm is not responsible for any additional project submissions / documentation for grades Certificate of completion will be provided at the end of the internship",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Associate Product Engineer (internship cum full time employment)"
            },
            {
                "key": "CTC",
                "value": 800000
            },
            {
                "key": "Location",
                "value": "Remote (Work_From_Home)"
            },
            {
                "key": "Stipend",
                "value": 20000
            },
            {
                "key": "Responsibilities",
                "value": "Build high-performing, scalable, enterprise-grade applications. Will be part of a talented software team that works on mission-critical applications. Contribute to all phases of the development lifecycle. Design and maintain the most efficient data pipeline architecture possible. Assemble huge, complex data sets that satisfy both functional and non-functional business needs. Working closely with analysts, designers and staff Producing detailed specifications and writing the program codes"
            },
            {
                "key": "Essential skills",
                "value": "The candidate has excellent problem-solving and multitasking skills. The candidate can work as an individual contributor. Object-Oriented Analysis and design using common design patterns. Highly proficient with Core Java, and Java Spring. Understanding of server-side rendering and its benefits and use cases."
            },
            {
                "key": "Java",
                "value": "Core Java"
            },
            {
                "key": "Eligibility",
                "value": "BE / BTech (IT/CS branch only) 2024 Pass out only 60% and Above throughout all academics ( 10th/12th/Diploma/Degree)"
            },
            {
                "key": "B.E/B.Tech",
                "value": "BE / BTech (IT/CS branch only)"
            },
            {
                "key": "Selection Process",
                "value": "Online Aptitude cum Technical Test (2 rounds) Pre HR Round Technical Interview (2 rounds) Final HR Interview"
            }
        ]
    },
    {
        "Name": "Taurani Holdings LTD",
        "description": "Taurani Holdings LTD (UAE) Industry Sector: Manufacturing & trading of steel and allied steel products. Job designation on joining: Engineering Trainee Job designation on completion of 1 year: Assistant Manager Eligibility Criteria 1. Academic Criteria – 60% Aggregate. 2. Medical Criteria – Physically and mentally fit & free from contagious diseases such as Tuberculosis 3. Work permit criteria – company sponsored visa. 4. Any other criteria – adaptable, flexible, and willing to work with a machine and spend long hours on the shop floor. Stream : B.E, B.Tech, M.E, M.Tech, MBA Sales & Marketing Major : Electrical, Mechanical, Metallurgy, Mechatronics, Production Engineering, Industrial Engineering, MBA in Sales & Marketing (Streams as offered by your institute will be considered) Place of posting: United Arab Emirates and Kingdom of Saudi Arabia. Selection procedure: 1. Online presentation to students 2. Campus presentation of 1 hour 3. Technical assessment 4. HR interview and Business interview Compensation: Freshers Selected candidates who are freshers receive a competitive salary of AED 3,000 per month Gross for the period of 1 year. On confirmation after completion of 1 year the compensation will be revised based on the performance. Bachelor/spinster shared accommodation along with transport to office will be provided. Role Purpose: Gain hands-on experience in your discipline and make an impact from day one. Develop expertise in your field of study, within a fast-paced and complex project environment. Work with world-class industry experts. Gain varied understanding of your core discipline through hands-on experience. Gain increased awareness of strengths and areas of development to support professional and personal growth.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Engineering Trainee"
            },
            {
                "key": "Eligibility",
                "value": "Academic Criteria – 60% Aggregate. Medical Criteria – Physically and mentally fit & free from contagious diseases such as Tuberculosis Work permit criteria – company sponsored visa. Any other criteria – adaptable, flexible, and willing to work with a machine and spend long hours on the shop floor. Stream : B.E, B.Tech, M.E, M.Tech, MBA Sales & Marketing Major : Electrical, Mechanical, Metallurgy, Mechatronics, Production Engineering, Industrial Engineering, MBA in Sales & Marketing (Streams as offered by your institute will be considered)"
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.E, B.Tech, M.E, M.Tech"
            },
            {
                "key": "Location",
                "value": "United Arab Emirates and Kingdom of Saudi Arabia"
            },
            {
                "key": "Selection Process",
                "value": "Online presentation to students Campus presentation of 1 hour Technical assessment HR interview and Business interview"
            },
            {
                "key": "Compensation",
                "value": "Freshers Selected candidates who are freshers receive a competitive salary of AED 3,000 per month Gross for the period of 1 year. On confirmation after completion of 1 year the compensation will be revised based on the performance. Bachelor/spinster shared accommodation along with transport to office will be provided."
            },
            {
                "key": "Roles",
                "value": "Gain hands-on experience in your discipline and make an impact from day one. Develop expertise in your field of study, within a fast-paced and complex project environment. Work with world-class industry experts. Gain varied understanding of your core discipline through hands-on experience. Gain increased awareness of strengths and areas of development to support professional and personal growth."
            }
        ]
    }
]