[
    {
        "Name": "Raja Software Labs",
        "description": "About RSL: Raja Software Labs (RSL) is a software development consultancy, based in Pune. Our expertise is in helping companies ship high business impact, mission critical solutions. We develop software but are in the peace of mind business. We started in 2007 and have since shipped products for the world's most innovative companies, including Linked, Google, Nest, Vida Health. Our apps have had more than 200 million downloads. Role: Software Developer Package: - Rs. 7 Lakhs (Rupees Seven Lakhs per annum) Interview Process: Programming test (Evaluate programming skills of the students) Technical Interviews: 2-3 technical interviews evaluating the programming skills of the students.(DSA and OOPS Eligibility Criteria: - BE or equivalent -Knowledge of any programming language (C, C++, Java, Python, JavaScript, Ruby, C#, Swift, Objective-C, or any other) Graduation percentage: 60% and higher Branches allowed: Computer Science, IT, Electrical, EnTC, Mech Engineering (Graduate / Postgraduate).",
        "Keys": [
            {
                "key": "company_name",
                "value": "Raja Software Labs"
            },
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "Electrical"
            },
            {
                "key": "branch_4",
                "value": "EnTC"
            }
        ]
    },
    {
        "Name": "Hitachi Energy",
        "description": "Role: Management Trainee Internship Duration: 6 Months Stipend: Rs. 20,000 per month CTC: 6LPA (After successful completion of internship) Location: Chennai, Bangalore, Gurugram Eligibility Criteria- Eligible Stream EEE, CSE, ECE and Mechanical Eligible Aggregate 10th, 12th / Diploma & B.E – 70%",
        "Keys": [
            {
                "key": "company_name",
                "value": "Hitachi Energy"
            },
            {
                "key": "role",
                "value": "Management Trainee"
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Chennai"
            },
            {
                "key": "location_2",
                "value": "Bangalore"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "EEE"
            },
            {
                "key": "branch_2",
                "value": "CSE"
            },
            {
                "key": "branch_3",
                "value": "ECE"
            },
            {
                "key": "branch_4",
                "value": "Mechanical"
            }
        ]
    },
    {
        "Name": "ALPHAWAVE SEMI",
        "description": "Job Description Looking for self-driven, motivated and skilled engineers looking to get exposure to all sides of IC building process more specifically DFT (Design for Testability) from high level architectural definition, through RTL coding, verification, Scan/MBIST/BSCAN insertion,pattern generation and validation, device bring-up for complex custom silicon and IP engagements. • As a DFT intern, candidate will have the opportunity to work in a fast-paced environment on multiple projects in different design stages: • Develop RTL code for DFT components generation. • Integrate custom made DFT logic for complex SoCs (System-On-Chip) and CoWoS (Chip-On-Wafer-On-Substrate) designs. • Perform Scan/MBIST/BSCAN insertion. • Perform ATPG and coverage analysis, simulate zero delay and SDF annotated test sequences. • Build verification test benches and write verification sequences. • Review static timing analysis reports and SDCs generations. • Design and implement automation using Perl and/or Python. Why would you want to join our team: Ability to get exposure to all disciplines of TEST (DFT, ATPG, RTL, DV, Device Bring-up) in IC design process. No \"side kick” tasks; you will be assigned a regular engineering scope of work. High possibility to get absorbed as the full-time engineer after internship subjected to performance and open positions. Qualifications Pursuing or Completed Bachelors or Master in Electronics/Electrical/Telecommunications/VLSI/Microelectronics Engineering only with 70% throughout in academics and zero active backlogs. Required skill set: o Strong Digital Fundamentals o Verilog and/or VHDL knowledge o Basics of DFT and exposure to Tessent/Synopsys TEST tools is a plus. o Perl, Python, TCL experience o C/C++, System Verilog is a plus. Desired Qualities o Self-starter and curious to learn new things. o Target oriented and motivated to figure out solutions to new problems. o Collaborative, team player Internship Details: • Eligibility: BTech/MTech in Electronics, Electrical, Telecommunications, VLSI, or Microelectronics Engineering • Minimum 70% academic score throughout No active backlogs • Position: Intern • Duration: 6 months to 1 year • Location: Bangalore/Pune • Stipend: INR 40,000 per month for BTech students ■ INR 50,000 per month for MTech students",
        "Keys": [
            {
                "key": "company_name",
                "value": "ALPHAWAVE SEMI"
            },
            {
                "key": "role",
                "value": "Intern"
            },
            {
                "key": "stipend_min",
                "value": 40
            },
            {
                "key": "stipend_max",
                "value": 50
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "Electronics"
            },
            {
                "key": "branch_2",
                "value": "Electrical"
            },
            {
                "key": "branch_3",
                "value": "Telecommunications"
            },
            {
                "key": "branch_4",
                "value": "VLSI"
            }
        ]
    },
    {
        "Name": "Adani Group",
        "description": "About Adani Group: Adani Group is one of the largest and fastest growing Conglomerate catering to a billion aspirations. The Group is a diversified organization in India with a market cap of over $133 Bn comprising 6 publicly traded companies. The company is a market leader in multiple sectors like Ports and Logistics, Power, Transmission, Renewables and Gas. CTC: 6LPA Eligibility Criteria: • Engineering graduates from disciplines across- (B.E./B.Tech.) from within the following different engineering streams (Civil, Electrical, Mechanical, Electronics (C&I), E&C, CS/IT, Industrial) • Minimum of 60% marks throughout in academics (10th, 12th, and Graduation level till third year) with no history of backlogs throughout the education Selection Process: 1. Online assessment to evaluate candidates on their cognitive 2. Domain ability followed by a technical and HR interview",
        "Keys": [
            {
                "key": "company_name",
                "value": "Adani Group"
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "branch_2",
                "value": "Electrical"
            },
            {
                "key": "branch_3",
                "value": "Mechanical"
            },
            {
                "key": "branch_4",
                "value": "Electronics (C&I)"
            }
        ]
    }
]