[
    {
        "Name": "Emami",
        "description": "Emami Stipend: INR 25,000/ per month Location: PAN India. Job title: GET – Electrical Department: Maintenance Job Role: Ensuring support to Operation of Ayurvedic Division. Ensuring support to Machine Performance (Productivity & OEE Improvement Trend) Job Description: 1.1: Key Responsibilities Troubleshooting & Preventive Maintenance of all Electrical systems. Knowledge of Electrical safety issues. Training to Electricians & operator with plan of Department, target: Completion of 15 hrs. training Co-ordination with OEM & Service provider. Efficiency monitoring & running the plant efficiently. Cost Saving Projects, minimum 1000K INR Wastage reduction from current 8% to 4% MTD OEE Improvement from 62% to target 75% (Aspirational-80%) MTTR & MTBF reduction trend for Shreeji Line 3 and WIMCO Machines in HFR Section Reduction of Spare Part Cost be developing locally. Reduction in Quality Incident by 25% Consumer Complaints No. of Kaizens to be done: 100 1.2 : MIS and Reports Monthly Breakdown Tracking and Maintaining History Card Monthly ERM Compliance: PM Compliance and Breakdown Analysis 1.3 Health & safety Responsible for safety of self and in the area of command. Knowledge of Electrical safety issues Job title: GET - Mechanical Department: Engineering & Maintenance Job Role: Responsible for Air Compressors, Process Chillers and Process Cooling Towers. Maintenance of Lifts, Stackers, Taski Cleaning Machines. Maintenance of the AHUs, doors, ACs, etc. Daily power report and consumables report. Casual manpower deployment. Job Description: Utility Division Marinating and looking after the total Operation, Function, Optimization and Maintenance of the Air Compressors, Process Chillers, Process Cooling Towers, HVAC Chillers, Water Treatment Plant (WTP), Effluent Treatment Plant (ETP), Boilers and Diesel Generators. Maintenance, Operation and Function of the AHUs, Lifts, Stackers and Taski Floor Cleaner Machines, Doors, ACs, Pipelines, Fountains, etc. Preventive maintenance of the mechanical equipment of the Utility Division. Detailed analysis of the Power and Fuel Consumption of the plant with respect to Tonnage produced and Detailed tracking and analysis of the Utility Consumables in the Plant. Workshop and Briquette Store Operation and Maintenance. Shift Schedule management of the Air Compressor operators, HVAC Chiller operators and the Lift operators. Optimizing and cost saving for the Utility consumables. Maintenance of the LLP Tank Farm area and HSD Tank Farm area. Casual Manpower Management and Optimization. MIS and Reports: Daily MIS Power Fuel report. Utility Daily Consumables report. Mechanical work done and PM compliance report. Daily Manpower Requisition and Deployment tracking. Ensure Statutory Compliance. Health & safety: Responsible for safety of self and in the area of command. Follow and adhere to company safety rules and regulations. Maintaining safety environment for workers and all.",
        "Keys": [
            {
                "key": "Stipend",
                "value": 25000
            },
            {
                "key": "Location",
                "value": "PAN India"
            },
            {
                "key": "Job Role",
                "value": "GET – Electrical"
            },
            {
                "key": "Roles",
                "value": "Ensuring support to Operation of Ayurvedic Division. Ensuring support to Machine Performance (Productivity & OEE Improvement Trend)"
            },
            {
                "key": "Job Description",
                "value": "1.1: Key Responsibilities Troubleshooting & Preventive Maintenance of all Electrical systems. Knowledge of Electrical safety issues. Training to Electricians & operator with plan of Department, target: Completion of 15 hrs. training Co-ordination with OEM & Service provider. Efficiency monitoring & running the plant efficiently. Cost Saving Projects, minimum 1000K INR Wastage reduction from current 8% to 4% MTD OEE Improvement from 62% to target 75% (Aspirational-80%) MTTR & MTBF reduction trend for Shreeji Line 3 and WIMCO Machines in HFR Section Reduction of Spare Part Cost be developing locally. Reduction in Quality Incident by 25% Consumer Complaints No. of Kaizens to be done: 100 1.2 : MIS and Reports Monthly Breakdown Tracking and Maintaining History Card Monthly ERM Compliance: PM Compliance and Breakdown Analysis 1.3 Health & safety Responsible for safety of self and in the area of command. Knowledge of Electrical safety issues"
            },
            {
                "key": "Key Responsibilities",
                "value": "Troubleshooting & Preventive Maintenance of all Electrical systems. Knowledge of Electrical safety issues. Training to Electricians & operator with plan of Department, target: Completion of 15 hrs. training Co-ordination with OEM & Service provider. Efficiency monitoring & running the plant efficiently. Cost Saving Projects, minimum 1000K INR Wastage reduction from current 8% to 4% MTD OEE Improvement from 62% to target 75% (Aspirational-80%) MTTR & MTBF reduction trend for Shreeji Line 3 and WIMCO Machines in HFR Section Reduction of Spare Part Cost be developing locally. Reduction in Quality Incident by 25% Consumer Complaints No. of Kaizens to be done: 100"
            },
            {
                "key": "Job Role",
                "value": "GET - Mechanical"
            },
            {
                "key": "Roles",
                "value": "Responsible for Air Compressors, Process Chillers and Process Cooling Towers. Maintenance of Lifts, Stackers, Taski Cleaning Machines. Maintenance of the AHUs, doors, ACs, etc. Daily power report and consumables report. Casual manpower deployment."
            },
            {
                "key": "Job Description",
                "value": "Utility Division Marinating and looking after the total Operation, Function, Optimization and Maintenance of the Air Compressors, Process Chillers, Process Cooling Towers, HVAC Chillers, Water Treatment Plant (WTP), Effluent Treatment Plant (ETP), Boilers and Diesel Generators. Maintenance, Operation and Function of the AHUs, Lifts, Stackers and Taski Floor Cleaner Machines, Doors, ACs, Pipelines, Fountains, etc. Preventive maintenance of the mechanical equipment of the Utility Division. Detailed analysis of the Power and Fuel Consumption of the plant with respect to Tonnage produced and Detailed tracking and analysis of the Utility Consumables in the Plant. Workshop and Briquette Store Operation and Maintenance. Shift Schedule management of the Air Compressor operators, HVAC Chiller operators and the Lift operators. Optimizing and cost saving for the Utility consumables. Maintenance of the LLP Tank Farm area and HSD Tank Farm area. Casual Manpower Management and Optimization. MIS and Reports: Daily MIS Power Fuel report. Utility Daily Consumables report. Mechanical work done and PM compliance report. Daily Manpower Requisition and Deployment tracking. Ensure Statutory Compliance. Health & safety: Responsible for safety of self and in the area of command. Follow and adhere to company safety rules and regulations. Maintaining safety environment for workers and all."
            }
        ]
    },
    {
        "Name": "Muthoot Finance",
        "description": "Muthoot Finance The Muthoot Group of Finance Role and Responsibility: Front line sales executive for Muthoot branches operations. Job Location: Muthoot branches (North, East & West) operations. Eligibility Criteria: Minimum Graduates / Graduation (last year) - Non Technical CTC: 1. Interns for 6 months. After the successful completion of internship, there will be performance evaluation and interns will get the PPO (Pre-Placement offer) accordingly. 2. Stipend INR 10000/- per month during internship period {will be registered under government scheme NAPS (National Apprenticeship Promotion) and NATS (National Apprenticeship Training)} 3. The internship period is for 6 months and after the successful completion of internship there will be performance evaluation for the placement in the Muthoot Payroll.",
        "Keys": [
            {
                "key": "Roles",
                "value": "Front line sales executive for Muthoot branches operations."
            },
            {
                "key": "Location",
                "value": "Muthoot branches (North, East & West) operations"
            },
            {
                "key": "Eligibility",
                "value": "Minimum Graduates / Graduation (last year) - Non Technical"
            },
            {
                "key": "Stipend",
                "value": 10000
            }
        ]
    },
    {
        "Name": "DeltaX",
        "description": "DeltaX Role: Associate Product Engineer (Full Stack Developer) CTC: INR 7 Lakhs Per Annum Location: Bengaluru, Hyderabad and Pune Eligibility Criteria: Btech (CS and IT) Minimum overall 50% CGPA Engineering Culture & Practices You will work in an agile SCRUM team. Our teams follow BDD, REST, Continuous Integration and Continuous Delivery. We operate hundreds of multi-tenant databases using MS SQL Server C#, Vue.js and SQL are the common languages that our teams use. Centralized monitoring across our entire stack using ELK Stack (Elasticsearch, Logstash, Kibana) Responsibilities Write code :) Ownership for the entire lifecycle of your code: development, test, production, and subsequent fixes and improvements. Implement code that is clear, concise, tested, and easily understood by others. Selection Process: Round 1 Online Technical MCQ Test: Will cover fundamentals for Programming, Data Structures, Networking and Micro-processors. Expected No. of Questions: 50 Multiple Choice Questions. Assessment Duration: 45 Minutes. Difficulty level: Questions levels vary from easy to moderate. Round 2 Online Coding Assessment (any programming language) Helpful alert: Only serious coders will qualify Round 3 Technical Interview What we look for? Logical clarity Algorithm & Programming Concepts",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Associate Product Engineer (Full Stack Developer)"
            },
            {
                "key": "CTC",
                "value": 700000
            },
            {
                "key": "Location",
                "value": "Bengaluru, Hyderabad and Pune"
            },
            {
                "key": "Eligibility",
                "value": "Btech (CS and IT) Minimum overall 50% CGPA"
            },
            {
                "key": "B.E/B.Tech",
                "value": "Btech (CS and IT)"
            },
            {
                "key": "Responsibilities",
                "value": "Write code :) Ownership for the entire lifecycle of your code: development, test, production, and subsequent fixes and improvements. Implement code that is clear, concise, tested, and easily understood by others."
            },
            {
                "key": "Selection Process",
                "value": "Round 1 Online Technical MCQ Test: Will cover fundamentals for Programming, Data Structures, Networking and Micro-processors. Expected No. of Questions: 50 Multiple Choice Questions. Assessment Duration: 45 Minutes. Difficulty level: Questions levels vary from easy to moderate. Round 2 Online Coding Assessment (any programming language) Helpful alert: Only serious coders will qualify Round 3 Technical Interview What we look for? Logical clarity Algorithm & Programming Concepts"
            }
        ]
    },
    {
        "Name": "Innovaptive Inc",
        "description": "Innovaptive Inc Role: Product Owner (Trainee) and Trainee – Implementation Consultant (Campus) Location: Hyderabad, India Travel Percentage: 0% - 10% Employment Type: Full-Time; Salaried Reports To: Senior/Principal Product Manager, Product Management Compensation: Competitive as per Indian Market standards We are looking for a Product Owner to drive one of Innovapptive's connected worker SaaS platform products. The connected worker platform brings the maintenance front-line workers, back-office and connected assets (IiOT) together on one unified platform to perform jobs better, faster, cheaper and safer. This person will be responsible for product roadmap planning and execution, from ideation to adoption for the connected worker Platform Products. We are aggressively expanding our market penetration into several industry verticals with a special focus on Oil & Gas, Utilities, Chemicals, Metals & Mining and Industrial Manufacturing. And we need a dynamic, fast-paced Product professional who can ideate, design, drive, build and deliver Product features at pace. How You Will Make an Impact: Product Execution: Execute a high-impact product roadmap for one of the Connected Worker Platform Products on Cloud Rapid Iteration and Execution: Champion a culture of speed and agility, driving rapid product iteration and execution. Set high bars for quality, efficiency, and speed-to-market. Break down complex problems into actionable steps, and relentlessly prioritize to deliver results quickly. Cross-Functional Collaboration: Work closely with engineering to deliver high-quality products on time and within budget. Data-Driven Decision Making: Utilize data analytics and metrics to make informed decisions. Monitor key product metrics and perform user behavior",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Product Owner (Trainee) and Trainee – Implementation Consultant (Campus)"
            },
            {
                "key": "Location",
                "value": "Hyderabad, India"
            },
            {
                "key": "Compensation",
                "value": "Competitive as per Indian Market standards"
            },
            {
                "key": "Responsibilities",
                "value": "Product Execution: Execute a high-impact product roadmap for one of the Connected Worker Platform Products on Cloud Rapid Iteration and Execution: Champion a culture of speed and agility, driving rapid product iteration and execution. Set high bars for quality, efficiency, and speed-to-market. Break down complex problems into actionable steps, and relentlessly prioritize to deliver results quickly. Cross-Functional Collaboration: Work closely with engineering to deliver high-quality products on time and within budget. Data-Driven Decision Making: Utilize data analytics and metrics to make informed decisions. Monitor key product metrics and perform user behavior"
            }
        ]
    }
]