[
    {
        "Name": "Vconstruct",
        "description": "Building Better, Smarter, Faster is our mission. Since 2013, our 400+ experts have been transforming the construction industry with innovative solutions in Virtual Design and Construction (VDC), Project Controls, Accounting, and Software Development. Serving 100+ projects globally, we deliver smarter processes, better products, and faster results. Join us in reshaping the future of construction with technology. CTC: 6.75 LPA Stipend: 20k, join in January 2025 as Graduate Trainee and then full-time from June/July 2025 based on their performance. Job Roles: 1. Project Engineer – Virtual Builder Skills and Qualification: Candidates having B.E./ B.Tech. or higher Degree in Civil or Construction related field. • A Working knowledge of BIM Coordination, Project Management, Change Management And Constructability is preferable. • Understanding of the overall construction process ranging from Design to commissioning. • Working knowledge of any prominent VDC software like Revit,Navisworks, Tekla and Civil 3Dis desired. Work Location: Pune (Magarpatta City)",
        "Keys": [
            {
                "key": "ctc",
                "value": 6.75
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "role",
                "value": "Project Engineer – Virtual Builder"
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "branch_2",
                "value": "Construction"
            }
        ]
    },
    {
        "Name": "Vconstruct",
        "description": "2. Software Engineer – Software Solutions for Construction Requirements: Good knowledge of object-oriented design and development and DBMSconcepts Expert in HTML5, CSS3, JavaScript Excellent communication, presentation and analytical skills Should be willing to work collaboratively across different skill sets Working knowledge of at least one front-end framework (react/angular) and back-end stack Eligibility: B.E. Final year students from CS/IT, Min 70% or equivalent marks (10th, 12th Or Diploma and overall in graduation). Selection Process: Round 1: Cognitive Test (Online) - 1 hr Includes aptitude Mathematical Ability and technical questions. • Reasoning Ability • Verbal Ability • Pseudo Code Round 2. Group Discussion - 10 min A general topic will be provided, and candidates will have 10 minutes to discuss. Round 3. In-Campus Interview Includes technical questions and HR interaction. Eligibility: Civil, Min 60% in 10th, 12th & Graduation, No Live Backlog.",
        "Keys": [
            {
                "key": "role",
                "value": "Software Engineer – Software Solutions for Construction"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Vconstruct",
        "description": "3. Data Science Engineer - DSA We are looking for candidates with passion for technology, excellent analytical skills, and ability to solve complex problems to undergo training in data Science related areas. Successful candidates will be part of the Data Science and Analytics team which is a tight-knit group of analysts and engineers that support all data aspects of DPR business. Requirements: B.E. / B.Tech Final year students with CS/IT background Excellent Academic Credentials Excellent Communication and Analytical skills Responsibilities: Post training, selected candidates will work in Data Science and Analytics. Candidates will be working mostly on US or EU based projects. They will transition into a data science engineer with the responsibilities outlined below - Understand and analyze the business requirements Design and deployment of the database - Ability to understand, consume and use API's, JSON, Web Services for data pipelines - Developing integrations between various applications Design, Develop and deploy reports/dashboards/data visualizations using Power BI - Optimize reports/dashboards with a focus on usability, performance, flexibility, testability, and standardization. - Build full stack data science models with various Azure technologies -Use R or Python to implement statistical models, machine learning, and analysis (Recommenders, Prediction, Classification, Clustering, etc.)",
        "Keys": [
            {
                "key": "role",
                "value": "Data Science Engineer - DSA"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "ZS",
        "description": "Role: Platform Services Associate Analyst CTC: ₹19 LPA - ₹13 LPA Location: Pune What You'll Do: • Tech Stack: Python , Analyst, SQL, PowerBI, Tableau. • Build complex solutions for clients using tools and technologies on the ZAIDYN platform. • Take ownership of activities and responsibilities across all project lifecycle phases to solve business problems in one or more client engagements. • Apply development methodologies (e.g., agile, waterfall) and best practices (e.g., QA procedures, unit testing) to ensure successful and timely task completion. • Collaborate with team members to ensure seamless project delivery. • Exhibit flexibility in tackling new challenges and demonstrate excellent task management. • Assist in creating project outputs, including business case development, solution design, user requirements, prototypes, technical architecture (if needed), test cases, and operations management. • Provide transparency in driving tasks to completion and report accurate progress status. • Bring a consulting mindset, leveraging technical and business expertise to solve problems and innovate. • Assist senior team members and delivery leads in project management responsibilities. What You'll Bring: • Qualification: Bachelor's degree in Computer Science, IT, or related disciplines with a strong academic record. • Additional Skills: • Bachelors Degree in CS, IT or EE • 1-2 years of experience in Power BI Administration • Office 365 Admin center and products suite knowledge • Experience in AWS Administration, Application deployment and configuration management • General database and data warehousing concepts and best practices • Working knowledge of different Operating Systems like Windows • Knowledge of AWS service (EC2,S3,IAM,VPC,Lambda,EMR,CloudFront,Elastic Load Balancer etc.) • Good knowledge of RDBMS and database technologies like SQL server, PostgreSQL. • Basic knowledge of web server software like IIS or Apache Tomcat • Good Knowledge of any scripting language like PowerShell, Python, Bash/Shell scripting • Eagerness to contribute in a team-oriented environment • Excellent communication and organizational skills • Comfortable working in rotational shifts • Ability to quickly learn new platforms, languages, tools, and techniques as needed to meet • project requirements • Ability to work independently",
        "Keys": [
            {
                "key": "ctc_max",
                "value": 19
            },
            {
                "key": "ctc_min",
                "value": 13
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "role",
                "value": "Platform Services Associate Analyst"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EE"
            }
        ]
    }
]