[
    {
        "Name": "ZS",
        "description": "ZS Role: Platform Services Associate Analyst CTC: ₹19 LPA - ₹13 LPA Location: Pune What You'll Do: • Tech Stack: Python, Analyst, SQL, PowerBI, Tableau. • Build complex solutions for clients using tools and technologies on the ZAIDYN platform. • Take ownership of activities and responsibilities across all project lifecycle phases to solve business problems in one or more client engagements. • Apply development methodologies (e.g., agile, waterfall) and best practices (e.g., QA procedures, unit testing) to ensure successful and timely task completion. • Collaborate with team members to ensure seamless project delivery. • Exhibit flexibility in tackling new challenges and demonstrate excellent task management. • Assist in creating project outputs, including business case development, solution design, user requirements, prototypes, technical architecture (if needed), test cases, and operations management. • Provide transparency in driving tasks to completion and report accurate progress status. • Bring a consulting mindset, leveraging technical and business expertise to solve business problems and innovate. • Assist senior team members and delivery leads in project management responsibilities. What You'll Bring: • Qualification: Bachelor's degree in Computer Science, IT, or related disciplines with a strong academic record. • Additional Skills:",
        "Keys": [
            {
                "key": "role",
                "value": "Platform Services Associate Analyst"
            },
            {
                "key": "ctc_max",
                "value": 19
            },
            {
                "key": "ctc_min",
                "value": 13
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "Nutanix",
        "description": "NutanixNutanix is a global leader in cloud software and a pioneer in hyperconverged infrastructure solutions, makingcomputing invisible anywhere. Companies around the world use Nutanix software to leverage a single platform tomanage any app, at any location, at any scale for their private, hybrid and multi-cloud environments.CTC: 22 LPAStipend: 50k/monthJob Description: Systems Reliability Engineer (SRE) Role – InternThe Area: Escalation and Technical Support:We are ensuring the success of our ground breaking technology through cluster health monitoringand quick response time. We are top-notch engineers with the ability to handle all problems thatcome our way. Working closely with Sales and Software Engineers, the SRE team acts as ourcustomer's champions and has guaranteed that not a single box has been returned.We are ensuring the success of our ground - breaking technology through cluster healthmonitoring and quick response time. We are top-notch engineers with the ability to handle allproblems that come our way. Working closely with Sales and Software Engineers, the SRE teamacts as our customers' champions and has guaranteed that not a single box has been returned.• Provide world class support and be a champion for our customers. GO above and beyond tosupport their business and use Of the Nutanix stack.• Troubleshooting. debug and diagnose customer issues encountered post implementation. Worktowards identifying the root cause of the problem in order to resolve the issues permanently.• Define and lead changes to our product with our Development/Engineering team based onfeedback from customers and field implementations.• Improve serviceability of the product by testing new features and developing tools to scaleour field deployment and auto-support infrastructure.• Collaborate with various teams like Engineering, Account product management etc andensure timely resolution for our customers.• Develop and work on creating Content i.e., internal and external knowledge bases.• Work with technology partners (e.g., VMware, Citrix, Microsoft) to resolve issues and pushimprovements in our ecosystem.• Provide support on weekdays and Off hours on an as needed and scheduled rotational basis.Requirements:• Excellent verbal/written communication and analytical skills.• Customer centricity• The passion and ability to learn new things. while never being satisfied with the status quo.• Willingness to work in a fast-growing company with huge potential.Location: Bangalore / PuneSelection Process:Round 1: Resume Shortlisting - Based on ATS compatible Profile, AMCAT Test, GitHub, HackerRank, HackerEarthRound 2: Pre-Placement Talk for shortlisted students only, Know Your Company Round, Technology Domain / Quizabout Nutanix (most imp round)Round 3: HackerRank MCQ Test (Cloud, Networking, Linux) (2Hrs)Round 4: Interviews Tech 1Round 5: Interviews Tech 2Round 6: Managerial and Result",
        "Keys": [
            {
                "key": "ctc",
                "value": 22
            },
            {
                "key": "stipend",
                "value": 50000
            },
            {
                "key": "role",
                "value": "Systems Reliability Engineer (SRE) Role – Intern"
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "location_2",
                "value": "Pune"
            }
        ]
    },
    {
        "Name": "Cognizant",
        "description": "CognizantOne of the top professional services firms in the world, Cognizant transforms clients' economic, operating, andtechnological models for the digital age. Clients may design, create, and manage more creative and effective enterpriseswith the assistance of its unique industry-based consultative approach. Cognizant, a Nasdaq-100 company with itsheadquarters in the United States, is number 185 on the Fortune 500 and has been routinely recognized as one of theworld's most admired businesses for the past 11 years. It is additionally ranked 74th on Forbes' 2018 Best Employersfor Women list.CTC: GenC - 4 LPAGenC Next - 6.75 LPASelection Process: The recruitment test consists of three rounds.Round 1: Online Assessment This round will have a total of 61 questions, and 240 minutesIt consists of 5 sections- Aptitude, Reasoning, EnglishQuantitative Aptitude: 24 Questions, 35 minutesLogical Reasoning: 25 Questions, 35 minutesVerbal Ability: 1 Question, 30 minutesAutomata Fix: 7 Questions, 20 minutesCoding: Stage 1 - 2 Question, 40 minutesStage 2 - 2 Question, 80 minutesRound 2: Programming Skills 4 coding questions, 120 minutes.Round 3: Gen C Next or Gen C interview. Questions will be based on Technical, Cognitive Abilities, and RightAttitude.Note: Candidates who successfully clear round 2 will be eligible for the GenC Next Interview. Candidates who fail toclear round 2 will be headed toward the Gen C interview round.Job title: Engineer TraineeLocation: Bengaluru, Chennai, Coimbatore. Candidates must be flexible to relocate to any Cognizant work locations asper the business requirement & demand.Job description: IT Service Desk has witnessed significant transformations due to technological advancements. Today,many organizations leverage AI chat bots to automate and streamline their support processes. AI chat bots use naturallanguage processing to provide instant responses to common user queries and handle simple tasks, reducing theworkload on human analysts. Robotic Process Automation (RPA) is also gaining traction,allowing repetitive and rule-based tasks to be automated, freeing up analysts' time for morecomplex issues.• Provide first-line technical support and assistance to end-users, addressing their IT-related issues and enquiries, log and track all support tickets, ensuring accurate documentation and timely resolution ofproblems.• Troubleshoot hardware and software problems, performing diagnosis and resolving technical issues to minimizedowntime, collaborate with other IT teams to escalate complex issues and ensure prompt resolution and to maintainknowledge base articles and documentation to enhance self-service options and facilitate efficient problem-solving.Compensation: INR 4,00,000 per annumRole expectations:• Associate should be client focused and able to work with users from differentcommunities and cultures across the globe.• Ability to have flawless communication (verbal and written) with our clients and possesssound technical knowledge.• Work in shifts and work from the office.Support available from Cognizant (post joining as Full Time Employee)• Night shift allowance will be paid by the project.• Cognizant provides cabs for pick-up and drop, ensuring safety and comfort.• Timely rewards and recognition for top performers.If you are passionate about customer service, possess strong technical skills, and thrive in afast-growing environment, then this role is for you.Eligibility Criteria:• 2024 Batch of B.E/B.Tech of any branch (UG full time degree).• At the time of registration, consistent academic record of a minimum of 50% in X, XII, Diploma, UG & PGwith no standing arrears in current education.• At the time of joining, all recruits need to have a minimum 50% aggregate in the pursuing degree with nostanding arrears.• Flexible to relocate to anywhere in India, work in any shift / technology / domain, including work from officelocation basis business requirements.• Opportunities are open to Indian nationals / OCIs who are currently residing in India.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 4
            },
            {
                "key": "ctc_max",
                "value": 6.75
            },
            {
                "key": "role",
                "value": "Engineer Trainee"
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "location_2",
                "value": "Chennai"
            },
            {
                "key": "percent",
                "value": 50
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "Accenture",
        "description": "accentureAccenture is an Irish-domiciled multinational company that provides consulting and professional services. A FortuneGlobal 500 company, it reported revenues of $44.33 billion in 2020 and had 569,000 employees. In 2015, the companyhad about 150,000 employees in India, 48,000 in the US, and 50,000 in the Philippines. Accenture's current clientsinclude 91 of the Fortune Global 100 and more than three-quarters of the Fortune Global 500.CTC: Associate Software Engineer - 4.5 LPA• Extensive training before deployment• Project exposure from the first month of joining• 24-months learning program to become full-stack in a chosen technology• Faster career progression opportunitiesAssociate Software Engineer - 6.5 LPA• Opportunity to get deployed in hand-picked complex assignments in emerging technologies• End-to-end exposure from front-end, back-end, middle layer• Well-defined learning journey with coaching and mentorship to grow as an expertSelection process: The process Consists of 3 RoundsRound 1: Online assessment consists of two-stageStage 1: Cognitive Ability and TechnicalEnglish: 17 QuestionsQuantitative: 17 QuestionsReasoning: 15 QuestionsMS Office: 11 QuestionsNetworking: 9 QuestionsPseudocode: 17 QuestionsCoding - 2 Questions, 45 MinutesStage 2: Communication Assessment – 20 Minutes – Medium DifficultyRound 2: Technical interviewRound 3: HR InterviewEligibility criteria:• Minimum criteria – Any engineering stream of B.E/B.Tech/ME/M.Tech or MCA or MSc (CS/IT) with year of passoutbeing 2025• No active backlogs during application and/or during onboarding.• Candidate should have completed the relevant degree (eligible for this job role) in the stipulated duration of thedegree. There should be no gaps during the course of your degree. E.g. candidate must complete the 4-year B. Techcourse in 4 years.• Candidate should not have appeared for Accenture Recruitment assessment/interview process in the last three months.• Candidates must be eligible to work in India by citizenship/ have relevant work permit documents. Please note thatBhutan and Nepal nationals can work in India without a need for obtaining a work visa. All other foreign nationalsrequire work visa or an Overseas Citizenship of India (OCI) or Person of Indian Origin (PIO) card to work in India",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 4.5
            },
            {
                "key": "ctc_max",
                "value": 6.5
            },
            {
                "key": "role",
                "value": "Associate Software Engineer"
            },
            {
                "key": "branch_1",
                "value": "B.E/B.Tech"
            },
            {
                "key": "branch_2",
                "value": "ME/M.Tech"
            },
            {
                "key": "branch_3",
                "value": "MCA"
            },
            {
                "key": "branch_4",
                "value": "MSc (CS/IT)"
            }
        ]
    }
]