[
    {
        "Name": "Hexaware",
        "description": "About Us:At Hexaware, we're not just a global technology and business process services company; we're a community of 31,600+ Hexawarians dedicated to one singular purpose: creating smiles through the power of great people and technology. With a presence in 58 offices across 28 countries, we empower enterprises worldwide to embark on their digital transformation journey with unparalleled scale and speed. As an employer, we're more than just a workplace. We put our people first, foster diversity and inclusivity, and prioritize their growth through robust learning and development programs. Our Culture is a canvas for innovation as we work toward our shared vision of becoming the world's most loved digital transformation partner. Exciting, isn't it? Visit www.hexaware.com to join us in embracing the magic of technology, as we passionately advocate for its potential to transform lives today and shape a brighter future. Together, we'll make the digital world a better place.Role: Quality Assurance (Software Testing) What are we looking for? Good communication skills- Fluent in spoken & written English Team player and interpersonal relationship abilities High level of energy Right Attitude and the ability to thrive in a fast-paced environment Should be able to multi – task: ability to prioritize and manage project related activities Possess Openness, reliability, punctuality and flexibility at given tasks",
        "Keys": [
            {
                "key": "Location",
                "value": "Nagpur/Mumbai, Mahape, Navi Mumbai, Maharashtra"
            },
            {
                "key": "Eligibility",
                "value": "Must have 60% throughout B.E./B.Tech – Mechanical, Electronics, Electrical, Instrumentation, Industrial Engineering, or similar background 2022 pass outs / 2023 pass outs who have completed their academic credits only Graduation: B.E/B.Tech/MCA M.E/M.Tech not eligible Passing year: 2025 Not more than 1 year of Education Gap Streams: CSE/IT/ISE/AI/ML/DS/ECE/EEE/Telecommunication (any CS/IT/Circuital allied branches are eligible) Mechanical/Civil/allied branches not eligible Aggregate till last announced results: 60% or 6 CGPA throughout 10th 12th and UG/PG No active Backlogs"
            },
            {
                "key": "B.E/B.Tech",
                "value": "Mechanical, Electronics, Electrical, Instrumentation, Industrial Engineering, or similar background; B.E/B.Tech/MCA; CSE/IT/ISE/AI/ML/DS/ECE/EEE/Telecommunication (any CS/IT/Circuital allied branches are eligible); Mechanical/Civil/allied branches not eligible"
            },
            {
                "key": "CTC",
                "value": 400000
            },
            {
                "key": "Stipend",
                "value": 15000
            },
            {
                "key": "Job Role",
                "value": "Quality Assurance (Software Testing)"
            },
            {
                "key": "training program",
                "value": "on successful completion of Training"
            },
            {
                "key": "Selection Process",
                "value": "1. Group Discussion 2. Aptitude Assessment 3. Technical Interview 4. HR Interview"
            },
            {
                "key": "requirements",
                "value": "Good communication skills- Fluent in spoken & written English Team player and interpersonal relationship abilities High level of energy Right Attitude and the ability to thrive in a fast-paced environment Should be able to multi – task: ability to prioritize and manage project related activities Possess Openness, reliability, punctuality and flexibility at given tasks"
            },
            {
                "key": "Innovate",
                "value": "Our Culture is a canvas for innovation"
            }
        ]
    },
    {
        "Name": "ArcelorMittal Nippon Steel India Limited (AM/NS India)",
        "description": "About AM/NS:ArcelorMittal Nippon Steel India is an integrated flat carbon steel manufacturer- from iron ore to ready-to- market products with an achievable crude steel capacity of 9 MTPA. Our manufacturing facilities comprise of iron making, steelmaking and downstream facilities spread across India. We are a young, dynamic & global organization. We stand out for our commitment on innovation & continuous improvement and are on a mission to create Smarter Steels for a Brighter future. For us, our employees and their development are at the core. We collaborate with Industry experts and work along with the latest technologies. We also ensure our commitment to environmental responsibility, ensuring that our manufacturing processes are sustainable and create impact in the communities we operate. Our vision is to be a leading and responsible steelmaker creating value for all stakeholders to achieve this vision, we are always looking for dynamic and highly motivated engineering graduates. As an engineering graduate, you will have the opportunity to work closely with highly experienced professionals of different domains in various innovative projects.Position: Graduate Engineer Trainee (GET) Function: Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining Responsibilities:The Graduate Engineer Trainees will be on a training period for 12 months from the date of joining during which they will be assigned projects within the domain. A GET is designated with the opportunity to work in cutting- edge facilities, contributing to the entire steel manufacturing process. From iron making to downstream operations and crucial role in delivering high-quality steel products to the market. It's a chance to showcase one's expertise and make a significant impact in the industry. Educational Qualifications/Shortlisting Criteria:• B.E. / B.Tech (Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining) At least 65% throughout the academic career with no active backlogs during at the time of applying for the role.• 65% & above in SSC• 65% & above in HSC• 65% & above in B.E. / B.Tech all semesters• No live ATKT and no year drop/down. Behavioral Skills:• Strong interpersonal, problem solving and project management skills• Excellent communication and interpersonal skills• Analytical and data driven to ensure structured approach to a problem• Ability to work in a highly entrepreneurial environment.• Willing to relocate to any of AM/NS India locations across any technology.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee (GET)"
            },
            {
                "key": "Location",
                "value": "Any of AM/NS India locations"
            },
            {
                "key": "CTC",
                "value": 600000
            },
            {
                "key": "Selection Process",
                "value": "Online Test followed by a Technical and Personal Interview"
            },
            {
                "key": "B.E/B.Tech",
                "value": "Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining"
            },
            {
                "key": "Responsibilities",
                "value": "The Graduate Engineer Trainees will be on a training period for 12 months from the date of joining during which they will be assigned projects within the domain. A GET is designated with the opportunity to work in cutting- edge facilities, contributing to the entire steel manufacturing process. From iron making to downstream operations and crucial role in delivering high-quality steel products to the market. It's a chance to showcase one's expertise and make a significant impact in the industry."
            },
            {
                "key": "Qualifications",
                "value": "Educational Qualifications/Shortlisting Criteria: • B.E. / B.Tech (Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining) At least 65% throughout the academic career with no active backlogs during at the time of applying for the role. • 65% & above in SSC • 65% & above in HSC • 65% & above in B.E. / B.Tech all semesters • No live ATKT and no year drop/down."
            },
            {
                "key": "Skill set",
                "value": "Behavioral Skills: • Strong interpersonal, problem solving and project management skills • Excellent communication and interpersonal skills • Analytical and data driven to ensure structured approach to a problem • Ability to work in a highly entrepreneurial environment. • Willing to relocate to any of AM/NS India locations across any technology."
            },
            {
                "key": "Innovate",
                "value": "commitment on innovation"
            }
        ]
    },
    {
        "Name": "Solar Industries",
        "description": "Solar Industries 1. Position Title: IIoT Intern (Control Room) Post Duration: 6 Months Days of Work: 6 days a week (1 day rotational off) & 8 hours Rotational Shift Internship Type: Paid Job Location: Solar Plant (Chakdoh) REQUIRED SKILLS Programming Languages: 1. Proficiency in Python, C, CSS, HTML & C++ for developing IIoT applications and scripts. 2. Familiarity with Java or JavaScript is a plus. Networking: 1. Knowledge of networking protocols (e.g., MQTT, HTTP, CoAP, OPC UA, TCP/IP, Modbus, RS485/422, RS232). 2. Understanding of IP networking concepts and topologies. Embedded Systems: 1. Experience with microcontrollers (e.g., Arduino, ESP's Raspberry Pi, PLC & SCADA) for prototyping IIoT devices. 2. Familiarity with sensors, actuators, and other hardware components. IIoT Platforms: 1. Exposure to IoT platforms (e.g., PTC, ThingsBoard, AWS, Azure, Google Cloud) for IIoT solutions. 2. Understanding of IoT platforms (e.g., PTC, ThingsBoard, AWS IoT, Azure IoT Hub) is an advantage. Cybersecurity: 1. Basic knowledge of cybersecurity principles related to IoT devices and data protection. Version Control: 1. Familiarity with version control systems, especially Git, for collaborative coding. EDUCATION REQUIRED 1. Completed a degree in Computer Science, Electrical, Electronics, Information Technology, or a related field. Machine Learning: 1.Familiarity with basic machine learning concepts and frameworks (e.g., TensorFlow, scikit-learn) for predictive analytics in IIoT applications. Soft Skills: 1. Strong problem-solving abilities and analytical thinking. 2. Excellent communication skills for collaborating with cross-functional teams. 3. Eagerness to learn and adapt to new technologies and challenges. 2. Position Title: IIoT Intern (Field) Post Duration: 6 Months Days of Work: 6 days a week (1 day rotational off) & 8 hours Rotational Shift Internship Type: Paid Job Location: Solar Industries India Limited (Chakdoh Plant) REQUIRED SKILLS • IndustrialAutomation &Control Systems 1. Knowledge of PLC programming for IIoT integration (Siemens, Rockwell, Schneider, Delta). 2. Understanding of HMI, SCADA, and DCS for real-time monitoring. 3. Familiarity with industrial sensors, transducers, and actuators. 4. Experience with Modscan, Modsim, or similar diagnostic tools is a plus. • Communication Protocols &Networking 1. Basic understanding of IoT & IIoT architecture. 2. Familiarity with industrial communication protocols: 3. Modbus TCP/RTU, OPC UA, MQTT, HTTP, CoAP, Ethernet/IP, RS485/RS232. 4. Understanding of IP networking concepts (LAN, WAN, VLAN). • IIoT Platforms & Edge Computing 1. Knowledge of IIoT platforms (ThingsBoard, Grafana, PTC ThingWorx). 2. Exposure to IoT cloud platforms (AWS IoT, Azure IoT, Google Cloud) is a plus. 3. Understanding of edge computing & gateway devices for IIoT deployments. • Programming & Data Processing 1. Basic PLC programming knowledge for industrial automation. 2. Familiarity with Python for IIoT scripting and data processing is a plus. • Cybersecurity & OT SecurityPractices 1. Awareness of IIoT cybersecurity principles, including data encryption & network security. 2. Basic understanding of firewall configurations and secure device communication • Soft Skills & Problem-Solving 1. Strong analytical and troubleshooting skills for field deployment. 2. Ability to collaborate with cross-functional teams. 3. Eagerness to learn and adapt to new IIoT technologies. EDUCATION REQUIRED Education: Degree in Electrical, Instrumentation, Electronics, Industrial Automation, Computer Science, or related fields. 3. Position Title: Data Analyst Intern Post Duration: 6 Months Days of Work: Monday to Saturday Type of Internship: Paid Job Location: Solar HO, Extension, Nagpur Eligibility: CS/IT and related fields ROLES & RESPONSIBILITY: • Data Collection • Exploratory Data Analysis (EDA) • Statistical Analysis • Assist in building and fine-tuning machine learning models for predictive analytics or classification tasks. • Test and evaluate models and scripts for performance, accuracy and efficiency. • Maintain detailed documentation of data analysis processes and methodologies. • Collaborate with cross-functional teams to understand business objectives and align data analysis efforts accordingly • Generate regular reports and presentations to communicate analysis results to non- technical stakeholders. REQUIRED SKILLS: 1. Proficiency in programming languages such as Python and SQL. 2. Familiarity with data manipulation libraries (e.g., pandas, numpy, seaborn, matplotlib) and visualization tools such as Power BI. 3. Hands on knowledge of ML algorithms, Neural Networks and interest in NLP models. 4. Basic knowledge of LLM models and their respective architectures. 5. Strong problem-solving abilities and analytical thinking. 6. Excellent communication skills for collaborating with cross-functional teams. 7. Eagerness to learn and adapt to new technologies and challenges.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "IIoT Intern (Control Room)"
            },
            {
                "key": "Job Role",
                "value": "IIoT Intern (Field)"
            },
            {
                "key": "Job Role",
                "value": "Data Analyst Intern"
            },
            {
                "key": "Location",
                "value": "Solar Plant (Chakdoh), Solar Industries India Limited (Chakdoh Plant), Solar HO, Extension, Nagpur"
            },
            {
                "key": "Stipend",
                "value": "Paid"
            },
            {
                "key": "requirements",
                "value": "Programming Languages: 1. Proficiency in Python, C, CSS, HTML & C++ for developing IIoT applications and scripts. 2. Familiarity with Java or JavaScript is a plus. Networking: 1. Knowledge of networking protocols (e.g., MQTT, HTTP, CoAP, OPC UA, TCP/IP, Modbus, RS485/422, RS232). 2. Understanding of IP networking concepts and topologies. Embedded Systems: 1. Experience with microcontrollers (e.g., Arduino, ESP's Raspberry Pi, PLC & SCADA) for prototyping IIoT devices. 2. Familiarity with sensors, actuators, and other hardware components. IIoT Platforms: 1. Exposure to IoT platforms (e.g., PTC, ThingsBoard, AWS, Azure, Google Cloud) for IIoT solutions. 2. Understanding of IoT platforms (e.g., PTC, ThingsBoard, AWS IoT, Azure IoT Hub) is an advantage. Cybersecurity: 1. Basic knowledge of cybersecurity principles related to IoT devices and data protection. Version Control: 1. Familiarity with version control systems, especially Git, for collaborative coding. IndustrialAutomation &Control Systems 1. Knowledge of PLC programming for IIoT integration (Siemens, Rockwell, Schneider, Delta). 2. Understanding of HMI, SCADA, and DCS for real-time monitoring. 3. Familiarity with industrial sensors, transducers, and actuators. 4. Experience with Modscan, Modsim, or similar diagnostic tools is a plus. Communication Protocols &Networking 1. Basic understanding of IoT & IIoT architecture. 2. Familiarity with industrial communication protocols: 3. Modbus TCP/RTU, OPC UA, MQTT, HTTP, CoAP, Ethernet/IP, RS485/RS232. 4. Understanding of IP networking concepts (LAN, WAN, VLAN). IIoT Platforms & Edge Computing 1. Knowledge of IIoT platforms (ThingsBoard, Grafana, PTC ThingWorx). 2. Exposure to IoT cloud platforms (AWS IoT, Azure IoT, Google Cloud) is a plus. 3. Understanding of edge computing & gateway devices for IIoT deployments. Programming & Data Processing 1. Basic PLC programming knowledge for industrial automation. 2. Familiarity with Python for IIoT scripting and data processing is a plus. Cybersecurity & OT SecurityPractices 1. Awareness of IIoT cybersecurity principles, including data encryption & network security. 2. Basic understanding of firewall configurations and secure device communication 1. Proficiency in programming languages such as Python and SQL. 2. Familiarity with data manipulation libraries (e.g., pandas, numpy, seaborn, matplotlib) and visualization tools such as Power BI. 3. Hands on knowledge of ML algorithms, Neural Networks and interest in NLP models. 4. Basic knowledge of LLM models and their respective architectures."
            },
            {
                "key": "Eligibility",
                "value": "Completed a degree in Computer Science, Electrical, Electronics, Information Technology, or a related field. CS/IT and related fields. Education: Degree in Electrical, Instrumentation, Electronics, Industrial Automation, Computer Science, or related fields."
            },
            {
                "key": "Java",
                "value": "Familiarity with Java or JavaScript is a plus."
            },
            {
                "key": "Roles",
                "value": "ROLES & RESPONSIBILITY: • Data Collection • Exploratory Data Analysis (EDA) • Statistical Analysis • Assist in building and fine-tuning machine learning models for predictive analytics or classification tasks. • Test and evaluate models and scripts for performance, accuracy and efficiency. • Maintain detailed documentation of data analysis processes and methodologies. • Collaborate with cross-functional teams to understand business objectives and align data analysis efforts accordingly • Generate regular reports and presentations to communicate analysis results to non- technical stakeholders."
            },
            {
                "key": "skills",
                "value": "Soft Skills: 1. Strong problem-solving abilities and analytical thinking. 2. Excellent communication skills for collaborating with cross-functional teams. 3. Eagerness to learn and adapt to new technologies and challenges. Soft Skills & Problem-Solving 1. Strong analytical and troubleshooting skills for field deployment. 2. Ability to collaborate with cross-functional teams. 3. Eagerness to learn and adapt to new IIoT technologies. 5. Strong problem-solving abilities and analytical thinking. 6. Excellent communication skills for collaborating with cross-functional teams. 7. Eagerness to learn and adapt to new technologies and challenges."
            }
        ]
    },
    {
        "Name": "Grindwell Norton Limited",
        "description": "Grindwell Norton Limited Job Role: Summer Intern Eligible Degree - B.Tech in Mechanical/Industrial and Production Internship Duration - 2 months Remuneration - Rs.35,000 for two months Job Location - Pan India Eligibility Criteria - 70% throughout in academics Interview Process - 1) Pre Placement Talk 2) Online Assessment 3) Personal Interview Rounds Important Note: The shortlisted candidate should be open to relocate anywhere in India. Job Role - Graduate Engineer Trainee Degree - B.Tech in Mechanical/Industrial and Production Probation Duration - 12 months (Mandatory) Remuneration - Rs. 5.7 LPA Job Location - Pan India Bond Details - 2 years from the date of joining. In case the candidate leaves before completing 2 years, he/she will have to pay Rs. 2 lakhs to the company. Eligibility Criteria - 70% throughout in academics Interview Process - 1) Pre Placement Talk 2) Online Assessment 3) Personal Interview Rounds",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Summer Intern"
            },
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "Stipend",
                "value": 35000
            },
            {
                "key": "CTC",
                "value": 570000
            },
            {
                "key": "Location",
                "value": "Pan India"
            },
            {
                "key": "Eligibility",
                "value": "B.Tech in Mechanical/Industrial and Production; 70% throughout in academics"
            },
            {
                "key": "B.E/B.Tech",
                "value": "B.Tech in Mechanical/Industrial and Production"
            },
            {
                "key": "Selection Process",
                "value": "1) Pre Placement Talk 2) Online Assessment 3) Personal Interview Rounds"
            }
        ]
    }
]