[
    {
        "Name": "Schneider Electric",
        "description": "Schneider Electric CTC: 12.5 LPA, Stipend: 35k Job Location: Mysore, Mumbai, Ahmednagar or Vadodara Responsibilities • Design & development of Low voltage Switchgear products like Air Circuit breakers, Molded Case Circuit Breakers, Contactors, Relays, and Starters etc. • Understanding the technological trends, demand, customer preferences and competitors' strategy • Get conversant with latest design trends in L.V. switchgear products. • Develop fair idea/ knowledge of engineering plastics and contact materials, their properties, characteristics used in switchgears • Understand and apply Indian and International Standards on L.V. Switchgear and their Testing. Qualifications Business / Soft Skills: • Must have solid presentation, communication and inter-personalskills. • Should be able to work in a cross cultural and cross functional global environment. • Have a logical mindset for problem solving and precision driven, innovative solutioning. • Should possess a keen interest in learning new technologies. • Should be adaptable with changing trends and driven to enhance business and technological acumen • Should be able to manage multiple priorities in a fast-paced environment. • An excellent attention to details. Technology Skills and Project/Internship Experience: • Manufacturing process knowledge, PFMEA, Statistical techniques • Strong knowledge of Microsoft applications (Excel, Word, Teams etc.) • Good knowledge of the design & development process • Ability to showcase Data Analysis skills, Problem-solving capabilities with Logical interpretation and reasoning. • Exposure to business world through projects/Internships is a plus. Selection Process: Round 1: Written test (60 Min) No of questions :40 No of sections :2 (Technical and General Aptitude, Memory Based Question) Technical based on your core subjects. Round 2: Technical Interview (technical questions, Core ques, Resume based questions, Project related questions) Round 3: HR Interview Eligibility Criteria Should have 65% and above in X, XII, Graduation No Live Backlog B.E./B. Tech in Electrical/Electrical & Electronics/Electronics & Communication",
        "Keys": [
            {
                "key": "ctc",
                "value": 12.5
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "location_1",
                "value": "Mysore"
            },
            {
                "key": "location_2",
                "value": "Mumbai"
            },
            {
                "key": "location_3",
                "value": "Ahmednagar"
            },
            {
                "key": "location_4",
                "value": "Vadodara"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Electrical"
            },
            {
                "key": "branch_2",
                "value": "Electrical & Electronics"
            },
            {
                "key": "branch_3",
                "value": "Electronics & Communication"
            }
        ]
    },
    {
        "Name": "Cognida.ai",
        "description": "Cognida.ai is an AI-first solutions company specializing in Practical AI and Predictive Analytics for Enterprises. Cognida.ai helps enterprises capitalize their most strategic asset—Data—to strengthen their competitive advantage. CTC: 7 LPA Location: Hyderabad Selection Process: Round 1: Online coding challenge 12 Ques (Easy, medium, Hard) Round 2: Technical interviews Round 3: HR discussions. Eligibility Criteria Aggregate of 70 % / 7 CGPA and above NO Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "SOFTLINK INTERNATIONAL",
        "description": "CTC: 6 LPA Role: Trainee Software Engineer Location - Pune Job Description of Trainee Software Engineer Coding and development of Software modules, Unit testing, Quality assurance, Release and implementation, Installation and Support. Technologies C#.NET, ASP.Net MVC, .Net Core, Xamarin, SQL, HTML5, Visual C/C++, Web Technologies Career Roadmap - Trainee Software Engineer -> Software Engineer -> Sr. Software Engineer -> Team Lead -> Product / Project Manager Selection Process: (Every round is an elimination round) Round 1:InCampus online Assessment (Aptitude 60 MCQ) 60 mins Round 2: Group Discussion Round 3: Technical Interview Round 4: HR Interview Eligibility Criteria: CS/IT group, ECE, EN SSC & HSC: Minimum 80% and above Important: Diploma holders with a 3-year degree will NOT be eligible. No gap in edu. allowed. Note: Company has minimum 2.5 years bond tenure and 6 months' probation.",
        "Keys": [
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "role",
                "value": "Trainee Software Engineer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "ECE"
            },
            {
                "key": "branch_4",
                "value": "EN"
            },
            {
                "key": "percent",
                "value": 80
            }
        ]
    },
    {
        "Name": "Principal Global Services",
        "description": "Position Title: Trainee Developer, this role is responsible for developing, testing and maintaining the application with established processes. Designation: Trainee Analyst CTC: 8 LPA, Stipend: 25k Location: Pune or Hyderabad Key Responsibilities: • Develop application code for programs while following coding standards • Develop and execute unit tests",
        "Keys": [
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "role",
                "value": "Trainee Developer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            }
        ]
    }
]