[
    {
        "Name": "Tata Technologies",
        "description": "TATA TECHNOLOGIES Tata Technologies Job Role: Graduate Engineer Trainee – CS/IT Compensation: 4.65 LPA Eligibility Criteria: BE/B.Tech in Mechanical, Electronics & Electrical A minimum academic score of 60% throughout the candidate's academic career. No active backlogs allowed. No year drop or academic gap is permitted. Only a one-year preparation gap is considered. Area of Responsibility: Have knowledge of programming languages, program design and development procedures Have the ability to design, develop and troubleshoot moderate to complex software applications Get associated in development, testing, support of existing/new software applications and solutions Be keen to cultivate strong working relationships with co-workers Have an innovative approach, learnability excellent problem-solving skills, effective articulation, and should be a genuine team player Believe in continuous learning and should be flexible to work on any phase of SDLC Job Role: Graduate Engineer Trainee – Mechanical, Electronics and Electrical Compensation: Base Salary: 4.5 LPA + Insurance and Additional Trainee Bonus: 50,000 INR per annum for the first two years Service Agreement: 2 years. Eligibility Criteria: BE/B.Tech in Mechanical, Electronics & Electrical A minimum academic score of 60% throughout the candidate's academic career. No active backlogs allowed. No year drop or academic gap is permitted. Only a one-year preparation gap is considered. Job Location: Pan India Selection Process: Aptitude Test Technical Interview HR Round Scope of Role: The Graduate Engineer Trainee is responsible for applying their Engineering skills learnt in academics, alongside quickly learning the CAD/CAE/Manufacturing feasibility tools to practitioner level &amp; also learning TTL customer + Industry practices &amp; start delivering to project requirements in the shortest period after onboarding. Area of Responsibility: This role is responsible for establishing him/herself a Practitioner level Engineer in assigned area of competency &amp; contribute to produce deliverables like CAD geometry + Drawings or FEA Meshing + simple load cases or Manufacturing feasibility process or Project engineering documentation, etc. You will have responsibility for: Understands TTL customer segments &amp; their products categorisation Familiarise with functional components and aggregates in the specific product Understand &amp; Practice product design methodology &amp; processes used to engineer a new component / new feature or functionality Basic knowledge of manufacturing processes like Metal cutting, laser cutting, Plastic Moulding, casting, forging, Spot Welding, MIG/MAG Welding, sheet metal, etc. Basic knowledge of Jigs, Fixtures &amp; 3-2-1 principle. Understand of various type of tool/machine designs used in Automotive &amp; Aerospace industries. CAE analysis for various manufacturing process in Auto &amp; Aero industries. DMU management, integrating component in assembly &amp; project coordination with various teams Understand important GD&amp;T application Detailed design, benchmarking of components to meet cost, weight &amp; functional targets Co-ordinate design activities with other stakeholders in project Ensure quality of the CAD design, drawings &amp; speed of delivery. Technical documentation &amp; design change analysis. Writing short macros to create automation in design process to reduce efforts required. Supporting customer design review and customer communication. Basic Knowledge of Robotics/Mechatronics will be an added advantage Knowledge / Experience: Fresher Essential: Learnt one of the CAD/CAM/CAE tools Good all-round Mechanical Engineering Basics. Engineering knowledge of production &amp; manufacturing requirements. Excellent communications skills, demonstrated ability to communicate at all levels, PC Literacy: Microsoft Project, Power Point, Excel, Word etc",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee – CS/IT"
            },
            {
                "key": "CTC",
                "value": 465000
            },
            {
                "key": "Eligibility",
                "value": "BE/B.Tech in Mechanical, Electronics & Electrical A minimum academic score of 60% throughout the candidate's academic career. No active backlogs allowed. No year drop or academic gap is permitted. Only a one-year preparation gap is considered."
            },
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee – Mechanical, Electronics and Electrical"
            },
            {
                "key": "CTC",
                "value": 500000
            },
            {
                "key": "Location",
                "value": "Pan India"
            },
            {
                "key": "Selection Process",
                "value": "Aptitude Test Technical Interview HR Round"
            },
            {
                "key": "Responsibilities",
                "value": "Have knowledge of programming languages, program design and development procedures Have the ability to design, develop and troubleshoot moderate to complex software applications Get associated in development, testing, support of existing/new software applications and solutions Be keen to cultivate strong working relationships with co-workers Have an innovative approach, learnability excellent problem-solving skills, effective articulation, and should be a genuine team player Believe in continuous learning and should be flexible to work on any phase of SDLC This role is responsible for establishing him/herself a Practitioner level Engineer in assigned area of competency & contribute to produce deliverables like CAD geometry + Drawings or FEA Meshing + simple load cases or Manufacturing feasibility process or Project engineering documentation, etc. You will have responsibility for: Understands TTL customer segments & their products categorisation Familiarise with functional components and aggregates in the specific product Understand & Practice product design methodology & processes used to engineer a new component / new feature or functionality Basic knowledge of manufacturing processes like Metal cutting, laser cutting, Plastic Moulding, casting, forging, Spot Welding, MIG/MAG Welding, sheet metal, etc. Basic knowledge of Jigs, Fixtures & 3-2-1 principle. Understand of various type of tool/machine designs used in Automotive & Aerospace industries. CAE analysis for various manufacturing process in Auto & Aero industries. DMU management, integrating component in assembly & project coordination with various teams Understand important GD&T application Detailed design, benchmarking of components to meet cost, weight & functional targets Co-ordinate design activities with other stakeholders in project Ensure quality of the CAD design, drawings & speed of delivery. Technical documentation & design change analysis. Writing short macros to create automation in design process to reduce efforts required. Supporting customer design review and customer communication. Basic Knowledge of Robotics/Mechatronics will be an added advantage Knowledge / Experience: Fresher Essential: Learnt one of the CAD/CAM/CAE tools Good all-round Mechanical Engineering Basics. Engineering knowledge of production & manufacturing requirements. Excellent communications skills, demonstrated ability to communicate at all levels, PC Literacy: Microsoft Project, Power Point, Excel, Word etc"
            }
        ]
    },
    {
        "Name": "Tata Asset Management Ltd.",
        "description": "Functional Area: Sales Job Role: Management Trainee Compensation: Fixed CTC : 5.00 LPA + 50K Assured Bonus Location: Delhi, Pune, Nagpur, Chandigarh, Jaipur Key Working Relationships: Part of the sales team at the branches Job Summary: Key responsibilities will be to meet assigned sales targets, through distributor engagement and activation. The goal is to enhance Tata Mutual Fund's visibility in the marketplace. Qualification: MBA in Marketing/ Finance is preferred Experience: Preferably 0 to 2 years of prior relevant work experience in BFSI sector. Key Responsibilities: Achievement of Gross Sales, Net Sales and SIP targets assigned in allotted geographic territory across Mutual Funds, PMS and AIF. Activate distribution partners and increase productivity in terms of no. of applications and volume. Identify prospective distribution partners (IFAs) and empanel them for selling the products of the AMC, this should also apply to new ARNs entering the market every month. Engage with the mapped relationships as per coverage plan, to build strong relationship and recall for the brand. Adhere to the defined sales process and reporting requirements. Use internal and external data for sharper focus and market intelligence. Read and update knowledge on regular basis to be able to articulate the fund house views and positioning of the product. Liaise with sales-support, investor services and other internal departments, and to ensure timely and quality response to distributors for various requirements. Responsibilities would also include the day-to-day management of internal office work/back office and timely MIS. Ensures that external communications that go from the sales team is factually correct and in compliance with internal procedures and meets all regulatory compliance requirements. Represents the company in the allotted area and will strive to ensure that the company's image is always upheld and projected in the appropriate manner. Any other Job as assigned by the management from time to time",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Management Trainee"
            },
            {
                "key": "CTC",
                "value": 550000
            },
            {
                "key": "Location",
                "value": "Delhi, Pune, Nagpur, Chandigarh, Jaipur"
            },
            {
                "key": "Key Responsibilities",
                "value": "Achievement of Gross Sales, Net Sales and SIP targets assigned in allotted geographic territory across Mutual Funds, PMS and AIF. Activate distribution partners and increase productivity in terms of no. of applications and volume. Identify prospective distribution partners (IFAs) and empanel them for selling the products of the AMC, this should also apply to new ARNs entering the market every month. Engage with the mapped relationships as per coverage plan, to build strong relationship and recall for the brand. Adhere to the defined sales process and reporting requirements. Use internal and external data for sharper focus and market intelligence. Read and update knowledge on regular basis to be able to articulate the fund house views and positioning of the product. Liaise with sales-support, investor services and other internal departments, and to ensure timely and quality response to distributors for various requirements. Responsibilities would also include the day-to-day management of internal office work/back office and timely MIS. Ensures that external communications that go from the sales team is factually correct and in compliance with internal procedures and meets all regulatory compliance requirements. Represents the company in the allotted area and will strive to ensure that the company's image is always upheld and projected in the appropriate manner. Any other Job as assigned by the management from time to time"
            }
        ]
    },
    {
        "Name": "Tata Hitachi Construction Machinery Company Private Limited",
        "description": "TATA HITACHI Tata Hitachi Construction Machinery Company Private Limited Job Role: Graduate Engineer Trainee – Mechanical Eligibility criteria are as follows : 1. First class marks from the 10th standard onwards and each year of the engineering course (i.e., marks of Sem 1 + Sem 2 >= First Class). 2. All subjects in the engineering course should be cleared in the first attempt. 3. The candidate should have a continuous career throughout from the 10th standard onwards i.e. there should not be any gap of a year in the academic curriculum. [This is relaxable by a year between the 12th std board exam and the first year of the engineering course.] 4. Students who have completed their diploma and then gone on to do their graduation by taking admission in the second year of the engineering course are eligible for the cadre.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee – Mechanical"
            },
            {
                "key": "Eligibility",
                "value": "1. First class marks from the 10th standard onwards and each year of the engineering course (i.e., marks of Sem 1 + Sem 2 >= First Class). 2. All subjects in the engineering course should be cleared in the first attempt. 3. The candidate should have a continuous career throughout from the 10th standard onwards i.e. there should not be any gap of a year in the academic curriculum. [This is relaxable by a year between the 12th std board exam and the first year of the engineering course.] 4. Students who have completed their diploma and then gone on to do their graduation by taking admission in the second year of the engineering course are eligible for the cadre."
            }
        ]
    },
    {
        "Name": "Blue Star India Limited",
        "description": "BLUE STAR Blue Star India Limited Job Role: Graduate Engineer Trainee, Diploma Engineer Trainee and MBA Location: Maharashtra Remuneration : Graduate Engineer Trainee INR 525000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable. Diploma Engineer Trainee INR 350000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable. MBA: INR 642000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable Pre-requisites - (minimum selection requirements)- Graduate Engineer Trainee(Mechanical/Electrical): 1. Full- Time Graduate (Bachelor's Degree) 2. Secured at least 60% marks or equivalent grade in academics (10th,12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. Diploma Engineer Trainee: 1. Secured at least 60% marks or equivalent grade in academics (10th, 12th). 2. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. MBA: 1. Full-Time MBA 2. Secured at least 60% marks or equivalent grade in academics (10th, 12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. Role Offered: GET (Mechanical/Electrical): 1. To ensure the project requirements are met as per the plan. 2. Verification of design with all required schemes. 3. Regular interaction with stakeholders for implementation of technical requirements. 4. Application of value engineering for project completion at optimum cost. 5. Identify design lacuna and suggest corrections. DET(Mechanical/Electricals): 1. Ensure quality of installation at MEP Project Sites. 2. Effectively mobilize available resources and strive for on time project completion. 3. Implement and maintain safe work practices at project sites. 4. Ensure smooth handing-over of projects, with all relevant documents. 5. Ensure adherence to statutory compliance and achieve over all customer satisfaction. MBA(Sales & Marketing): 1. Achieve sales targets with adherence to TOP (Terms of Payments)",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Graduate Engineer Trainee, Diploma Engineer Trainee and MBA"
            },
            {
                "key": "Location",
                "value": "Maharashtra"
            },
            {
                "key": "CTC",
                "value": 525000
            },
            {
                "key": "CTC",
                "value": 350000
            },
            {
                "key": "CTC",
                "value": 642000
            },
            {
                "key": "Eligibility",
                "value": "1. Full- Time Graduate (Bachelor's Degree) 2. Secured at least 60% marks or equivalent grade in academics (10th,12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. Secured at least 60% marks or equivalent grade in academics (10th, 12th). Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. 1. Full-Time MBA 2. Secured at least 60% marks or equivalent grade in academics (10th, 12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration."
            },
            {
                "key": "Roles",
                "value": "GET (Mechanical/Electrical): 1. To ensure the project requirements are met as per the plan. 2. Verification of design with all required schemes. 3. Regular interaction with stakeholders for implementation of technical requirements. 4. Application of value engineering for project completion at optimum cost. 5. Identify design lacuna and suggest corrections. DET(Mechanical/Electricals): 1. Ensure quality of installation at MEP Project Sites. 2. Effectively mobilize available resources and strive for on time project completion. 3. Implement and maintain safe work practices at project sites. 4. Ensure smooth handing-over of projects, with all relevant documents. 5. Ensure adherence to statutory compliance and achieve over all customer satisfaction. MBA(Sales & Marketing): 1. Achieve sales targets with adherence to TOP (Terms of Payments)"
            }
        ]
    }
]