[
    {
        "Name": "SOFTLINK INTERNATIONAL",
        "description": "SOFTLINK INTERNATIONAL CTC: 6 LPA Role: Trainee Software Engineer Location - Pune Job Description of Trainee Software Engineer Coding and development of Software modules, Unit testing, Quality assurance, Release and implementation, Installation and Support. Technologies C#.NET, ASP.Net MVC, .Net Core, Xamarin, SQL, HTML5, Visual C/C++, Web Technologies Career Roadmap - Trainee Software Engineer -> Software Engineer -> Sr. Software Engineer -> Team Lead -> Product / Project Manager Selection Process: (Every round is an elimination round) Round 1:InCampus online Assessment (Aptitude 60 MCQ) 60 mins Round 2: Group Discussion Round 3: Technical Interview Round 4: HR Interview Eligibility Criteria: CS/IT group, ECE, EN SSC & HSC: Minimum 80% and above Important: Diploma holders with a 3-year degree will NOT be eligible. No gap in edu. allowed. Note: Company has minimum 2.5 years bond tenure and 6 months' probation.",
        "Keys": [
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "role",
                "value": "Trainee Software Engineer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "Principal Global Services",
        "description": "Principal Global Services Position Title: Trainee Developer, this role is responsible for developing, testing and maintaining the application with established processes. Designation: Trainee Analyst CTC: 8 LPA, Stipend: 25k Location: Pune or Hyderabad Key Responsibilities: • Develop application code for programs while following coding standards • Develop and execute unit tests • Complete Analysis & documentation as required by the project • Support application testing and resolve test defects • Report status updates as required by the project • Follow established project execution processes • Focus on self-development & develop application and domain understanding. Skill set: • Analysis, Design, Coding, Testing, reviews and Documentation. • Test Case execution, Test Reporting, Defect life cycle, Status Reporting. • Reporting, Effective interaction with team Other: Good aptitude, positive attitude, strong reasoning and communication skills. Must be a good team player. Good analytical skills, challenging and research oriented. Eligibility : • BE/BTech (Computer Science, Information Technology/Science, Electronics & Communication or Electronics & Telecommunication) and MCA students only • 60% (first class) or equivalent CGPA throughout Academics (10th, 12th, Diploma & Graduation) • No live Backlogs/ATKT • Fulltime Education throughout Academics (10th, 12th, Diploma & Graduation) • Excellent Communication Skills • Selection Process: Round 1: Resume Shortlisting Round 2: Online Assessment (Coding(CS Core subject(OS, CN, pseudo Code, Basic DSA + Aptitude +2 Coding Ques) - 2 hrs Round 3: Technical Interview Round 4: HR Interview",
        "Keys": [
            {
                "key": "role",
                "value": "Trainee Developer"
            },
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "Information Technology/Science"
            },
            {
                "key": "branch_3",
                "value": "Electronics & Communication"
            },
            {
                "key": "branch_4",
                "value": "Electronics & Telecommunication"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "cgpa",
                "value": 6
            }
        ]
    },
    {
        "Name": "PHILIPS",
        "description": "PHILIPS: Job role: Graduate Engineer interns. Assist in the design, development, and testing of electrical systems and components. Support the creation and review of electrical schematics and diagrams. Participate in troubleshooting and problem-solving of electrical issues. Collaborate with the engineering team on various projects and tasks. Stipend: 45k Duration: 10 months Eligibility: For B.Tech. - Biomedical Engineering- Min. 65% in overall academics (10th, 12th, Graduation) No Live Backlog For: B.Tech. - Electrical Engineering- Min. 7 CGPA in Graduation No Live Backlog Other Details: Electrical Engineering Interns: (embedded) Pursuing or recently completed a degree in Electrical Engineering or a related field. Basic understanding of electrical circuits, systems, and components. Familiarity with relevant software tools (e.g., MATLAB, SPICE) is a plus. Strong analytical and problem-solving skills. Selection Process:",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer interns"
            },
            {
                "key": "stipend",
                "value": 45
            },
            {
                "key": "branch_1",
                "value": "Biomedical Engineering"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_2",
                "value": "Electrical Engineering"
            },
            {
                "key": "cgpa",
                "value": 7
            }
        ]
    },
    {
        "Name": "C&R Software",
        "description": "C&R Software Collections & Recovery Simplified C&R Software Job Role: Solution Integration - Intern Qualified candidates are being considered for Internship within the Professional Services group at C&R Software, Bangalore. These candidates shall possess a strong educational background in Computer Science and are expected to work on small to medium scale solution integration projects. During the Internship candidates shall undergo training and will be expected to contribute to projects which focus on the integration of information, process, and people through the application of multiple technologies. Internship is WFH, however, may be called to office for working/training/internship from office. Domains - Java, Python, DevOps. Note:- PPO is based on their performance and business needs. CTC: 8 LPA, Stipend: 25k Description: Role / Responsibilities- • Understand project requirements and assist in developing business and technical specifications. • Assist in turning business and technical specifications into data extraction/load programs. • Learn & implement the Techniques and Tools to implement Configurations to our product and its UI • Program ETL tool with business rules to be applied to data from source input to target data repository. • Develop and assist in implementing system and unit test programsPerform data conversion, quality, and integrity checks for all programs/processes. Eligibility Criteria: CS/IT group & MCA only. Other details:",
        "Keys": [
            {
                "key": "role",
                "value": "Solution Integration - Intern"
            },
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            }
        ]
    }
]