[
    {
        "Name": "TIAA",
        "description": "TIAAJob Title: Cyber-Security TraineeCTC: 10.48 LPALocation: PunePosition Summary:Describing below the primary purpose and function of this job:• TIAA India is looking for trainees under Cyber Internship Program with an objective of providing exposure toyoung and budding tech talent and providing an opportunity for them to get acquainted with the Corporateculture and insights into Technology.• Selected Candidates will have the opportunity for 10 Weeks of internship with Cyber Security team beforeonboarding them as full-time employees as Trainees.• The Trainee will be responsible for development, communication, implementation, enforcement andmonitoring of security controls to protect the organization's technology assets from intentional or inadvertentmodification, disclosure or destruction. The trainee is responsible for monitoring computer security proceduresand maintaining IT security policies, procedures and testing results.• The Trainee typically works as part of a project team or as an individual contributor under guidance from aMentor. The Trainee will communicate progress, resolve technical issues and work with the appropriate teamsfor solutions.Fundamental knowledge and conceptual understanding required for-• Working knowledge of Computers and IT Concepts like OS, Network, Databases, IT Systems and web applications• Cyber Security Concepts and Principles covering various cyber domains such as Security, Data protection, IT Risk and Governance, Security Operations, System Design and Architecture, Web ApplicationDevelopment, SDLC concepts, DevOps, Application security and vulnerability testing, Encryption and Cryptography,CWPP, CSPM, Identity & Access Management, Privilege access management, Security Monitoring and reporting.• Web development tools and scripting knowledge for Python, Bash, Shell, R, PowerShell, JSON, and others• Conceptual knowledge on emerging technologies – Blockchain, Quantum Computing, AI / ML, Severless, APIKey Duties & Responsibilities:The Trainee will attend a boot camp (an initial training program) as per the requirement where they will undergo atraining program focusing on TIAA Values & Behavior, Business domains, technology platforms, etc. After successfulcompletion of boot camp the Trainee will be aligned to any of the below mentioned cyber domains based on theiraspirations, project requirements and interview performance.• Threat Monitoring• Vulnerability Management• Defense-in-Depth practices to protect networks.• Threat Intelligence• Platform Security Engineering - Network Security, End Point Security and Cloud Security• IAM Operations• Cyber Custom Development• Cyber Fraud Investigator• EKM Engineering• Third Party information Security Risk managementEligibility Criteria:• Minimum 60% aggregate in 10th, 12th and Graduation• B.E/B.Tech in Cyber Security only",
        "Keys": [
            {
                "key": "role",
                "value": "Cyber-Security Trainee"
            },
            {
                "key": "ctc",
                "value": 10.48
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Cyber Security"
            }
        ]
    },
    {
        "Name": "Quantiphi",
        "description": "quantiphiQuantiphiLocation: Mumbai/BangloreEligibility Criteria:CTC:• Branches - B.E, M.E, MCA, B.Tech & M.Tech• 70% and above in 10th, 12th and Graduation (till now) with no-reappears/backlogs.1. Stipend 10K for 4 months and virtual internship2. Stipend 23K for 2 months and in person/hybrid internship3.CTC on FTE Conversion: 8.5 LPA (6.5 LPA - Fixed & 2 Lakhs - QCDP)Job Role: Data EngineerResponsibilities:• Work with business users and other stakeholders to understand business processes.• Ability to understand, design and implement Dimensions and Fact tables• Identify and implement data transformation/cleansing requirements• Profile source data to check data quality and develop Data Pipelines to implement ETL logic• Create and execute test plans debug existing Data Pipelines• Create data visualizations• Write SQL code-Queries/Stored Procedures/FunctionsRequirements:Strong SQL writing skills• Strong knowledge on Data Warehouse and ETL concepts• Familiarity with Kimball and Inmon Data Warehouse methodology Understand project-specific requirements,standards, guidelines, and processes• Demonstrated success working in a team-based environment• Good written/oral communication skills• Strong analytical and problem solving skillsJob Role: Business AnalystResponsibilities:• Participate in on-site and offshore engagements to deliver services to our client base.• Translate the business requirements into technical problems for the team and deliver technical solutions inbusiness terms to the client.",
        "Keys": [
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "location_2",
                "value": "Banglore"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "B.E"
            },
            {
                "key": "branch_2",
                "value": "M.E"
            },
            {
                "key": "branch_3",
                "value": "MCA"
            },
            {
                "key": "branch_4",
                "value": "B.Tech"
            },
            {
                "key": "stipend_min",
                "value": 10
            },
            {
                "key": "stipend_max",
                "value": 23
            },
            {
                "key": "ctc",
                "value": 8.5
            },
            {
                "key": "role",
                "value": "Data Engineer"
            }
        ]
    },
    {
        "Name": "Schneider Electric",
        "description": "Schneider Electric CTC: 12.5 LPA, Stipend: 35k Job Location: Mysore, Mumbai, Ahmednagar or Vadodara Responsibilities • Design & development of Low voltage Switchgear products like Air Circuit breakers, Molded Case Circuit Breakers, Contactors, Relays, and Starters etc. • Understanding the technological trends, market demands, customer preferences and competitors' strategy • Get conversant with latest design trends in L.V. switchgear products. • Develop fair idea/ knowledge of engineering plastics and contact materials, their properties, characteristics used in switchgears • Understand and apply Indian and International Standards on L.V. Switchgear and their Testing. Qualifications Business / Soft Skills: • Must have solid presentation, communication and inter-personalskills. • Should be able to work in a cross cultural and cross functional global environment. • Have a logical mindset for problem solving and precision driven, innovative solutioning. • Should possess a keen interest in learning new technologies. • Should be adaptable with changing trends and driven to enhance business and technological acumen • Should be able to manage multiple priorities in a fast-paced environment. • An excellent attention to details. Technology Skills and Project/Internship Experience: • Manufacturing process knowledge, PFMEA, Statistical techniques • Strong knowledge of Microsoft applications (Excel, Word, Teams etc.) • Good knowledge of the design & development process",
        "Keys": [
            {
                "key": "ctc",
                "value": 12.5
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "location_1",
                "value": "Mysore"
            },
            {
                "key": "location_2",
                "value": "Mumbai"
            }
        ]
    },
    {
        "Name": "Cognida.ai",
        "description": "Cognida.ai Cognida.ai is an AI-first solutions company specializing in Practical AI and Predictive Analytics for Enterprises. Cognida.ai helps enterprises capitalize their most strategic asset—Data—to strengthen their competitive advantage. CTC: 7 LPA Location: Hyderabad Selection Process: Round 1: Online coding challenge 12 Ques (Easy, medium, Hard) Round 2: Technical interviews Round 3: HR discussions. Eligibility Criteria Aggregate of 70 % / 7 CGPA and above NO Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "cgpa",
                "value": 7
            }
        ]
    }
]