[
    {
        "Name": "Siemens",
        "description": "SIEMENS Siemens Job Role: Intern Stipend: 15k/month Location: Pune Duration: 6 Months Eligibility Criteria: 1. Minimum 60% or CGPA 6 from 10th Grade to current educational qualification. 2. No active backlogs. 3. Academic backlogs not exceeding 2 years. 4. Pursuit of regular, full-time courses.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Intern"
            },
            {
                "key": "Stipend",
                "value": 15000
            },
            {
                "key": "Location",
                "value": "Pune"
            },
            {
                "key": "Eligibility",
                "value": "Minimum 60% or CGPA 6 from 10th Grade to current educational qualification. No active backlogs. Academic backlogs not exceeding 2 years. Pursuit of regular, full-time courses."
            }
        ]
    },
    {
        "Name": "Nexcellerate Technologies Pvt. Ltd. (rampp.ai)",
        "description": "Nexcellerate Technologies Pvt. Ltd. (rampp.ai) CTC: 7 LPA, Stipend: 25k/month Location: Bangalore Job Role 1: Application SDE Key Skills Required: • Proficiency in JavaScript, with experience in Node.js and React (preferably Next.js). • Familiarity with Bootstrap for front-end design. • Experience working with Databases (MongoDB and SQL). • Strong understanding of Data Structures and Algorithms (DSA) Job Role 2: AI Software Development Engineer (SDE) Key Skills Required: • Proficiency in Python with experience in libraries like Pandas and NumPy. • Hands-on experience with Databases (MongoDB and SQL). • Strong understanding of Data Structures and Algorithms (DSA). • Vector database knowledge is a plus. • Basic understanding of Artificial Intelligence (AI) and Machine Learning (ML) concepts.",
        "Keys": [
            {
                "key": "CTC",
                "value": 7
            },
            {
                "key": "Stipend",
                "value": 25000
            },
            {
                "key": "Location",
                "value": "Bangalore"
            },
            {
                "key": "Job Role",
                "value": "Application SDE, AI Software Development Engineer (SDE)"
            },
            {
                "key": "skills",
                "value": "Proficiency in JavaScript, with experience in Node.js and React (preferably Next.js). Familiarity with Bootstrap for front-end design. Experience working with Databases (MongoDB and SQL). Strong understanding of Data Structures and Algorithms (DSA) Proficiency in Python with experience in libraries like Pandas and NumPy. Hands-on experience with Databases (MongoDB and SQL). Strong understanding of Data Structures and Algorithms (DSA). Vector database knowledge is a plus. Basic understanding of Artificial Intelligence (AI) and Machine Learning (ML) concepts."
            },
            {
                "key": "MongoDB",
                "value": "Present"
            },
            {
                "key": "AI",
                "value": "Present"
            }
        ]
    },
    {
        "Name": "Kickdrum",
        "description": "Kickdrum Kickdrum Job Role: Software Developer CTC: 16LPA [Rs.10 LPA (Fixed) + 2 LPA (Variable) + 2 LPA (Benefits, retirals) + 2 LPA (Special bonus payable post completion of one year of full-time employment)] Stipend: 35k Location: Bengaluru Position: Software Intern (KDU-er) • Work Location: Bengaluru (Monday - Friday in Office) • Eligibility Criteria: 80% and above in academics throughout. No backlogs. • Facilities: Food and Snacks in Office; 24x7 access • Leaves: 3 Paid & 3 Sick Leaves; Leaves for University Exams • BYOD: ₹ 2000/month for using your own device during Internship Position: Software Developer • Job Location: Bengaluru, 2 mandatory days in Office, • Eligibility Criteria: Successful completion of the 6 month Internship • Benefits: in-office meals, reimbursements for food orders, cab rides, and gym memberships. Health insurance for self, family, and parents, BYOD (Bring Your Own Device) options, annual health checkups, wellness programs, mentorship, and training. • Paid Leaves: 12 sick leaves, 15 earned leaves, and 15 public holidays. Roles and Responsibilities: • Develop complex web applications with responsive design techniques and industry-leading UX • Translate design mock-ups and prototypes into working applications • Work on cloud-based architectures that are highly scalable, available, and performant • Work with agile methodology using cutting-edge DevOps tools & technologies • Focus on code quality and deliver projects with high business impact Learn and apply new skills during your 6 months internship: • Amazon Web Services (AWS) • HTML/CSS/React (frontend) • Java/Spring, DotNet, Python, Node (backend) • Enterprise-grade software development • Working directly with execs and customers Upon successful completion of your internship you will be employed as a “Software Developer” at Kickdrum. Selection Process: Round 1: Online Assessment (2 Coding Que) 2HRs Round 2: Technical Interview I Round 3: Culture Round Round 4: HR Interview Eligibility: CS/IT group with 80% and above in their academics throughout. No backlogs.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Software Developer, Software Intern (KDU-er)"
            },
            {
                "key": "CTC",
                "value": 16
            },
            {
                "key": "Stipend",
                "value": 35000
            },
            {
                "key": "Location",
                "value": "Bengaluru"
            },
            {
                "key": "Eligibility",
                "value": "CS/IT group with 80% and above in their academics throughout. No backlogs."
            },
            {
                "key": "Roles",
                "value": "Develop complex web applications with responsive design techniques and industry-leading UX Translate design mock-ups and prototypes into working applications Work on cloud-based architectures that are highly scalable, available, and performant Work with agile methodology using cutting-edge DevOps tools & technologies Focus on code quality and deliver projects with high business impact"
            },
            {
                "key": "Java",
                "value": "Present"
            },
            {
                "key": "Selection Process",
                "value": "Round 1: Online Assessment (2 Coding Que) 2HRs Round 2: Technical Interview I Round 3: Culture Round Round 4: HR Interview"
            }
        ]
    },
    {
        "Name": "HSBC",
        "description": "HSBC HSBC Job Role: Software Development Engineer CTC: 9 LPA Interview Location: Pune Job Location: Pune / Hyderabad / Bangalore, subject to business requirements. Role: • Strong foundation in software development engineering, with proficiency in at least one object- oriented programming language such as Java, Python, etc. • Various OS like Android, Linux, and Databases like relational and no-SQL. • Liaising with business users, architects and other stakeholders in designing, implementing and maintaining best-in-class (scalable, loosely coupled and efficient) solutions which can run seamlessly across platforms/mobile/internet/cloud. • Continuous Integration (CI)/ Continuous Deployment (CD) pipeline and Agile methodology. • Any of Mobile, Analytics, Cloud and Digital technology domains. • Ability to design and implement solutions which can run on-prem, hybrid and multi-cloud ecosystems such as GCP, AWS, Azure, Ali Cloud. • Ability to harness open-source development thus leveraging collective wisdom and learning • Understanding of cyber threats/ vulnerabilities and applying secure coding standards and associated protocols. • Ability to leverage industry best integration patterns and practices to integrate multiple existing/ new building blocks for seamless end-to-end customer experience. • Developing, maintaining, and supporting current systems for better efficacy and higher availability. Selection Process: Round 1: Aptitude + Technical (75 Minutes) & Coding assessment (30 Minutes) Only the students who clear the Aptitude + Technical assessment, will be able to appear for the coding test. Round 2: Technical Interview (Pune) Round 3: HR Interview Eligibility Criteria: Min. 60% or 6.00 CGPA throughout (10th / 12th / Diploma / B.E. / B.Tech), No Live Backlog.",
        "Keys": [
            {
                "key": "Job Role",
                "value": "Software Development Engineer"
            },
            {
                "key": "CTC",
                "value": 9
            },
            {
                "key": "Location",
                "value": "Pune / Hyderabad / Bangalore"
            },
            {
                "key": "Roles",
                "value": "Strong foundation in software development engineering, with proficiency in at least one object- oriented programming language such as Java, Python, etc. Various OS like Android, Linux, and Databases like relational and no-SQL. Liaising with business users, architects and other stakeholders in designing, implementing and maintaining best-in-class (scalable, loosely coupled and efficient) solutions which can run seamlessly across platforms/mobile/internet/cloud. Continuous Integration (CI)/ Continuous Deployment (CD) pipeline and Agile methodology. Any of Mobile, Analytics, Cloud and Digital technology domains. Ability to design and implement solutions which can run on-prem, hybrid and multi-cloud ecosystems such as GCP, AWS, Azure, Ali Cloud. Ability to harness open-source development thus leveraging collective wisdom and learning Understanding of cyber threats/ vulnerabilities and applying secure coding standards and associated protocols. Ability to leverage industry best integration patterns and practices to integrate multiple existing/ new building blocks for seamless end-to-end customer experience. Developing, maintaining, and supporting current systems for better efficacy and higher availability."
            },
            {
                "key": "Java",
                "value": "Present"
            },
            {
                "key": "Selection Process",
                "value": "Round 1: Aptitude + Technical (75 Minutes) & Coding assessment (30 Minutes) Only the students who clear the Aptitude + Technical assessment, will be able to appear for the coding test. Round 2: Technical Interview (Pune) Round 3: HR Interview"
            },
            {
                "key": "Eligibility",
                "value": "Min. 60% or 6.00 CGPA throughout (10th / 12th / Diploma / B.E. / B.Tech), No Live Backlog."
            },
            {
                "key": "B.E/B.Tech",
                "value": "Present"
            }
        ]
    }
]