[
    {
        "Name": "Carrier",
        "description": "CarrierJob Role: Software DeveloperCTC: 8 LPA - 12 LPAWhat you'll be doing:Industrial IoT – Managing Carrier Products Using AWS IoT:This module emphasizes the use of AWS IoT services to monitor, manage, andoptimize industrial products and processes.Application of AI in the HVAC Industry:Al for Business Process Improvement:This module explores trends in the HVAC industry, particularly in aftermarketservices, highlighting the relevance of IoT connectivity and AI applications fordriving innovation in this space.This module demonstrates how AI can be leveragedto enhance business processes and measure thequantifiable impact on overall efficiency.Selection Process:Round 1: Online Test - 2 hrs(2 coding ques, MCQ Aptitude)Round 2: Training & AssignmentsRound 3: InterviewsEligibility Criteria:• Final-year engineering students pursuing a degree in Computer Science, InformationTechnology, or related fields.• Minimum CGPA of 7.5 (or equivalent academic performance).• No active backlogs at the time of application.",
        "Keys": [
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "ctc_min",
                "value": 8
            },
            {
                "key": "ctc_max",
                "value": 12
            },
            {
                "key": "cgpa",
                "value": 7.5
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "Information Technology"
            }
        ]
    },
    {
        "Name": "Planful",
        "description": "PlanfulJob Role: Graduate Engineer TraineeCTC: 8.72 LPA, Stipend: 25k/monthLocation: HyderabadRole:• Analyze stories, specifications, and requirements to create Use cases and test scenarios.• Prepare test cases and scripts to meet project deliverables.• Report and track defects and problems that arise during software testing.• Participate in development sprints and daily scrum.• Develop and implement scripts for automated testing.• Collaborate with Product Management to ensure requirements are user-centered and testable.• Collaborate with Development to ensure designs are user-centered and testable.• Will be working in Software Development including Java/C# with Strong Problem-Solving Skills, objectoriented design, data structures, algorithm, Design, and complexity analysis.• Understanding modern web development technologies and techniques, including AJAX, HTML5, JavaScript,jQuery, CSS, Responsive Design, web services, NoSQL databases.Selection Rounds:1. Online Coding Test2. Technical Round 13. Technical Round 24. HR/Final SelectionSkills Requirements:OOPSProblem-SolvingLogical ReasoningAlgorithms, Sorting arraysDatabases, Data StructureCoding, SQL Queries & JavaScriptSelenium web driver, Java, C/C#Eligibility Criteria:Percentage: 70% throughout academics 10th/12th/GraduationNo Active BacklogNote: Internship to full time conversion of students will be purely based on the individual performance and opportunityavailable with us at that point in time.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 8.72
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Fendahl",
        "description": "Fendahl:Domain: Software company in CTRM/ETRM DomainDesignation: Trainee Software EngineerCTC: 7.5 LPA (Gross CTC- 5.25 LPA + 2.25 lacs retention bonus).Location: NagpurRequirement:• Candidates should be good in programming and aptitude• No special programming language training needed, however candidates knowing C# / Dot Net would bepreferred.• Candidates should be ready to work from Nagpur location.Selection Process:Round 1: Resume shortlisting.Round 2: Online InCampus Assessment (Aptitude + Programming).Round 3: Written Coding Test. (InCampus)Round 4: Technical Interview I (InCampus)Round 5: Technical Interview II (Company Premises)Round 6: HR Interview (Company Premises)Eligibility:CS/IT group, ECE, ENMin. 60% 10th, 12th & Graduation",
        "Keys": [
            {
                "key": "role",
                "value": "Trainee Software Engineer"
            },
            {
                "key": "ctc",
                "value": 7.5
            },
            {
                "key": "location_1",
                "value": "Nagpur"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "CS/IT group"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "PubMatic",
        "description": "PubMaticPubMatic is hiring candidates who can design and implement next-generation highly scalable, distributed, andlow-latency applications. If you get excited building applications and architecture to handle 100's billions of requestsper day, managing millions of requests per second with a creative and fast-paced work environment, competitive pay,great incentives, a culture of teamwork, smart and friendly colleagues, and plenty of opportunity to grow in your careerthen you should consider applying for this position.Job Role: Graduate Engineer TraineeCTC: 11.6 LPARequirements:• Excellent Problem solving and analytical skills.• Knowledge of Operating Systems concepts• Ability to code using any programming language, viz. C, Java, Scala.• Good understanding of data structures and algorithms.• Knowledge of SQL and databases.• Good fundamental understanding of software engineering.• Ability to communicate thoughts appropriately.• Preferences in the skills - Java, C, Javascript, Golang.Selection Process:Round 1: Online Test: 90 minutesRound 2: Technical Interviews - 2 rounds (Pune)Round 3: HR Interview",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 11.6
            },
            {
                "key": "location_1",
                "value": "Pune"
            }
        ]
    }
]