[
    {
        "Name": "AVEVA",
        "description": "AVEVA Role: Graduate TraineeReports To: Team LeadContract: Full-time permanentAbout AVEVADepartment: Global Delivery Centre, IndiaLocation: Hyderabad/BengaluruAVEVA is a global leader in industrial software, driving digital transformation and sustainability.By connecting the power of information and artificial intelligence with human insight, AVEVAenables teams to use their data to unlock new value. We call this Performance Intelligence.AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineersmarter, operate better and drive sustainable efficiency. AVEVA supports customers through atrusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world.The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices inover 40 countries.We take pride in our core values and the diversity of our people, valuing the unique experienceand expertise that people from different backgrounds bring to our business.AVEVA is an Equal Opportunity Employer, and we take pride in the diversity of our employees,valuing the special experience and expertise that people from different backgrounds bring to ourbusiness. The ability to develop ground-breaking technologies is one of our key assets and ourpeople make it happen.About the roleAs a part of the development team, you'll be responsible for configuring, developing, testing andmaintain AVEVA software products and solutions. Responsible for delivering world-class products and solutions usinglatest technologies, established standards and processes in collaboration with other teams.In this role you will:• Be an integral part of global services team.• Configures and/or customises core product.• For Developer Role• Develop applications using cutting edge technologies likes .Net Core, Microservices,Node, Python,React, Angular, SQL, Analytics and Machine learning which meet functional and non-functionalrequirements with built-in-quality.• For Non-Developer Role• Develop applications/models using AVEVA products, which meet functional and non-functionalrequirements with built-in-quality.• Author, review, execute, maintain, and test applications.• Develop, build, customize, deploy, and manage the environment, test suits and testautomation frameworks.• Performs both unit and integration testing.• Deploys solutions into AVEVA's or Customer infrastructure.• Contributes to technical project documentation deliverables, taking responsibility ofaccuracy and flow of content.• Manages own time effectively within the scope of work allocated and ensures both a timelyand high-quality delivery.• Performs knowledge transfer to team members and customer representatives.It is a pre-requisite to be able to function effectively as a member of a dynamic team within amatrixed organisation. Excellent communication skills will be required to develop good workingrelationships in the following areas:• the region-based Project Managers and technical resources to ensure successful delivery ofthe project.• with other members of the Global Delivery Centre team in Hyderabad within a project andto share knowledge• develops good working relationships with customer representatives and always providesthe highest level of customer service and professionalism.Mandatory Competencies, Knowledge and Skills:• Must have regular BE/BTech degree pursuing in (Computer, Chemical, Mechanical, Electrical,Instrumentation, Industrial)• Average aggregate 65% and above with no backlogs• Strong analytical skills, Communication, Problem Solving skills.• Basic knowledge of software development methodologies (e.g., Agile, Waterfall) and onsoftware development lifecycle (SDLC).• Good Problem Solving and Requirement understanding skills as well as a positive attitude,ability, and desire to learn new processes and technologies.• Organization: You'll be working in a fast-paced, high-volume, and evolving workenvironment, so time management and effective prioritisation will be essential• Customer focus: You'll be working directly with our customers. Being able to listen to themand understand their requests, and then address them in a proactive and consultativemanner, will be part of your day-to-day• Problem-solving: You'll need to enjoy getting stuck into problems. Troubleshooting andsolving challenging problems is a big part of this role.Come and join AVEVA to create the transformative technology that enables our customers to engineer abetter world!",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Trainee"
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "location_2",
                "value": "Bengaluru"
            },
            {
                "key": "branch_1",
                "value": "Computer"
            },
            {
                "key": "branch_2",
                "value": "Chemical"
            },
            {
                "key": "branch_3",
                "value": "Mechanical"
            },
            {
                "key": "branch_4",
                "value": "Electrical"
            },
            {
                "key": "percent",
                "value": 65
            }
        ]
    },
    {
        "Name": "Chegg",
        "description": "Chegg ®Job Title: Managed Network Expert (Subject Expert)Work location: Remote, work from homeTimings: Flexible work schedule (as per individual preference)Job Type: Part-timeOur subject experts are expected to solve academic questions asked by students on ourQuestion & Answer board.Eligibility• Enrolled as a student in Diploma, Bachelor's, Master's or Doctorate degree programsin therespective field of study.• This opportunity is NOT restricted to final year (semester) students only. Studentsfrom previous years can also apply.Expectations• Ensure that outlined quality parameters are followed.• Ensure that authoring guidelines are adhered• To ensure high-level of academicBenefits• Compensation: Paid per question answered (no limits)• Average Income: INR 30,000 to INR 80,000 per month*• Experience certificate at the end of tenure.• Earn while you learn.• Academic development.• Flexible work schedule.• Exposure to working at an MNC.Company Description:As the leading student-first connected learning platform,Chegg's Student Hub makes higher education more affordable and more accessible,all while improving student outcomes. Chegg is a publicly-held company based inSanta Clara, CA with offices in San Francisco, New York, Portland, India, Israel,Berlin, and Ukraine. Chegg Student Hub Services Include: Chegg Study, CheggTutoring, Chegg Writing Tools, Test Prep, Careers Search, Internship Admissionsand College Admissions.Chegg India, a premier educational services company and a wholly ownedsubsidiary of Chegg Inc., has been offering high quality services in the area ofHomework Help, Scholarships and Content Creation for American UniversityTextbooks. Chegg India has a vast network of employees with offices in Delhi andVisakhapatnam ably supported by a team of Managed Network Experts and TerritoryManagers who handle the Pan India Operations.'Student First' is our DNA. It drives everything we do. From the way we build ournetwork to the way we connect students to opportunity. We give every student theability to realize their full potential.",
        "Keys": [
            {
                "key": "role",
                "value": "Managed Network Expert (Subject Expert)"
            },
            {
                "key": "location_1",
                "value": "Remote"
            },
            {
                "key": "stipend_min",
                "value": 30
            },
            {
                "key": "stipend_max",
                "value": 80
            }
        ]
    },
    {
        "Name": "JTP",
        "description": "JTPAbout the company:JTP is a listed company on JASDAQ (Japanese Stock exchange) as JTP 2488. Our portfolio encapsulates services andproducts in ROBOTICS, Hardware / Software development, Pharma and Human resource development. Our headoffice is in Japan with branch offices in the USA, India, Korea, and many other countries. JTP has over 35 yearsof experience in the Japanese market. We work with clients such as EMC, SAP, Hitachi, NVIDIA, Softbank, Mitsubishietc.Job role: System engineerCTC: 24 LPALocation: JapanThe hiring process will be as follows:Step 1: Application.Step 2: Selection for technical assessments.Step 3: Technical assessmentStep 4: English Interview (Please note students with insufficient international level English skills will beeliminated. Students with Mother Tongue influence will be eliminated)Step 5: Virtual Training + Project round.Step 6: Golden ticket opportunity for few students*Step 7: CEO panel Interview.Eligibility branches: CS, IT, EC, E&TC, МСА, ВСА.Eligibility criterion: All students who are passionate for IT. (No merit criterion)",
        "Keys": [
            {
                "key": "role",
                "value": "System engineer"
            },
            {
                "key": "ctc",
                "value": 24
            },
            {
                "key": "location_1",
                "value": "Japan"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EC"
            },
            {
                "key": "branch_4",
                "value": "E&TC"
            }
        ]
    },
    {
        "Name": "Darwinbox",
        "description": "ddarwinboxAbout Darwinbox:Darwinbox is Asia's fastest-growing SaaS-based HR Technology platform. A brainchild of alumni from the country'smost distinguished institutions (IIT/IIM/XLRI) and organizations (McKinsey, EY, Google), Darwinbox is the preferredtechnology partner of 500+ global enterprises with more than 1 million+ employees using the platform. Our endto-endHCM technology suite competes with the best in the business and has won against giants such as SAP, Oracle, andWorkday several times to acquire iconic enterprise customers ranging from the largest conglomerates to unicorns -Adani, Mahindra, Kotak, TVS, Arvind, Nivea, Puma, Swiggy, Paytm, Bigbasket and Delhivery etc.The rate at which our product and market presence is growing is unprecedented. We're arocketship. We're not planning on slowing down anytime soon. And, that's why we need you!Designation: Intern- Product Development (The role can be converted to full time Software Engineer)Duration & Stipend: 6 Months, 25k per monthCTC: 16,30,000 LPALocation: HyderabadRoles and Responsibilities:• Coding• Product Development• Backend or Front-end DevelopmentAs fitment with the organization culture is very important you will immensely like the job ifyou:• Enjoy working in a fast-paced company environment.• Should be stack agnostic and should not have any tech prejudice.• Prefer a non-hierarchical, independent, and non-pushy environment.• Are self-motivated to take up a high degree of ownership.• Passionate about programming and can't sleep without coding.Min. Eligibility: B.Tech (CSE/IT) 2025, Minimum 60%( No Backlogs)Selection Process:• Coding Rounds- 1 & 2• Technical Interviews• HR & Management Interview",
        "Keys": [
            {
                "key": "role",
                "value": "Intern- Product Development"
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "ctc",
                "value": 16.3
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "CSE"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    }
]