[
    {
        "Name": "Telaverge Communications",
        "description": "TELAVERGE COMMUNICATIONS Telaverge Communications Positions: Research and Development Engineer CTC/Internship stipend: ❖ A consolidated stipend of Rs.10,000/- p.m. will be paid during the period of internship. CTC will be 3.8L to 4.2L (purely based on the performance). Performance incentive OR onetime bonus upto a Max of 1 Lakh after successful ❖ Completion of Internship and joining Telaverge.(purely based on the performance). Bond (Details): 2 Years Job Location: Bangalore Qualification: BTech/BE/MCA/M.SC/M.tech- Electronics Percentage: 60+ Year of passing out: 2020-2021 Practical Exposure to Electronics (Has done some practical projects) Skills required: - Electronic Engineering/ Electronics & Communications - Basic Knowledge of programming in C/C++ - Good knowledge in fundamentals of electronics (analogue & digital) & electrical science. - Good practical skills - Schematic analysis, implementation (In breadboard & perf board) Note: Candidates with hands-on experience and knowledge in microcontroller programming, sensor interfacing, PCB designing shall be the upper hand.",
        "Keys": [
            {
                "key": "role",
                "value": "Research and Development Engineer"
            },
            {
                "key": "stipend",
                "value": 10
            },
            {
                "key": "ctc_min",
                "value": 3.8
            },
            {
                "key": "ctc_max",
                "value": 4.2
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Electronics"
            },
            {
                "key": "branch_2",
                "value": "Communications"
            },
            {
                "key": "branch_3",
                "value": "MCA"
            },
            {
                "key": "branch_4",
                "value": "M.SC"
            }
        ]
    },
    {
        "Name": "Asian Heart Institute",
        "description": "ASIAN HEART INSTITUTE Asian Heart Institute Job Role- Training Executive in billing, Executive Assistant, Management Trainee in Finance & Accounts, Operations, patient care, MRD, HR, Marketing & Sales, Stores. Designation- Management Trainee Job Location- Mumbai, Bandra CTC: 1. MBA-4 LPA CTC minimum 2. BBA - 3LPA CTC About Asian Heart Institute, Mumbai: Asian Heart Institute rated as India's No. 1 heart care hospital for last 10 years in a row by various national surveys and among the best heart hospitals in the world by Newsweek international magazine in 2022 & 2023, was set up in 2002 with an aim to provide world-class cardiology and cardiac surgery services in India. It is situated at the Bandra Kurla Complex (BKC), a mere 15-minute drive from the domestic and international airports. The hospital is globally known as a model healthcare institution for delivering highest quality, honest medical opinions by highly capable, experienced, and dedicated healthcare professionals, using the best-in-class systems, processes, and practices within a strict ethical framework. Over the last two decades, Asian Heart Institute has treated more than 4,15,000 patients, performed over 50,000 angiographies & angioplasties, 27,500 plus heart surgeries including 5000 + complex heart surgeries. The hospital has a 99.6% success rate in cardiac surgeries including many considered inoperable worldwide and an overall 99.83% success rate in bypass which is considered among the best in the world. It is one of the highest accredited hospitals in India with 6 times gold certificates from JCl (Joint Commission International) as well as NABH (National Accreditation Board for Hospitals) and rated world's best hospital 2022 by ET Ascent.",
        "Keys": [
            {
                "key": "role",
                "value": "Training Executive"
            },
            {
                "key": "role",
                "value": "Executive Assistant"
            },
            {
                "key": "role",
                "value": "Management Trainee"
            },
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "ctc_min",
                "value": 4.0
            },
            {
                "key": "ctc",
                "value": 3.0
            },
            {
                "key": "branch_1",
                "value": "MBA"
            },
            {
                "key": "branch_2",
                "value": "BBA"
            },
            {
                "key": "domains",
                "value": "billing, Finance & Accounts, Operations, patient care, MRD, HR, Marketing & Sales, Stores"
            }
        ]
    },
    {
        "Name": "JTP",
        "description": "JTP is a listed company on JASDAQ (Japanese Stock exchange) as JTP 2488. Our portfolio encapsulates services and products in ROBOTICS, Hardware / Software development, Pharma and Human resource development. Our head office is in Japan with branch offices in the USA, India, Korea, and many other countries. JTP has over 35 years of experience in the Japanese market. We work with clients such as EMC, SAP, Hitachi, NVIDIA, Softbank, Mitsubishi etc.",
        "Keys": [
            {
                "key": "role",
                "value": "System engineer"
            },
            {
                "key": "ctc",
                "value": 24
            },
            {
                "key": "location_1",
                "value": "Japan"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EC"
            },
            {
                "key": "branch_4",
                "value": "E&TC"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    },
    {
        "Name": "Darwinbox",
        "description": "Darwinbox is Asia's fastest-growing SaaS-based HR Technology platform. A brainchild of alumni from the country's most distinguished institutions (IIT/IIM/XLRI) and organizations (McKinsey, EY, Google), Darwinbox is the preferred technology partner of 500+ global enterprises with more than 1 million+ employees using the platform. Our endto-end HCM technology suite competes with the best in the business and has won against giants such as SAP, Oracle, and Workday several times to acquire iconic enterprise customers ranging from the largest conglomerates to unicorns Adani, Mahindra, Kotak, TVS, Arvind, Nivea, Puma, Swiggy, Paytm, Bigbasket and Delhivery etc. The rate at which our product and market presence is growing is unprecedented. We're a rocketship. We're not planning on slowing down anytime soon. And, that's why we need you!",
        "Keys": [
            {
                "key": "domains",
                "value": "HR Technology"
            },
            {
                "key": "role",
                "value": "Intern- Product Development"
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "ctc",
                "value": 16.3
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            }
        ]
    }
]