[
    {
        "Name": "Vconstruct",
        "description": "Building Better, Smarter, Faster is our mission. Since 2013, our 400+ experts have been transforming the construction industry with innovative solutions in Virtual Design and Construction (VDC), Project Controls, Accounting, and Software Development. Serving 100+ projects globally, we deliver smarter processes, better products, and faster results. Join us in reshaping the future of construction with technology. CTC: 6.75 LPA Stipend: 20k, join in January 2025 as Graduate Trainee and then full-time from June/July 2025 based on their performance. Job Roles: 1. Project Engineer – Virtual Builder Skills and Qualification: Candidates having B.E./ B.Tech. or higher Degree in Civil or Construction related field. • A Working knowledge of BIM Coordination, Project Management, Change Management And Constructability is preferable. • Understanding of the overall construction process ranging from Design to commissioning. • Working knowledge of any prominent VDC software like Revit,Navisworks, Tekla and Civil 3Dis desired. Work Location: Pune (Magarpatta City)",
        "Keys": [
            {
                "key": "ctc",
                "value": 6.75
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "role",
                "value": "Project Engineer – Virtual Builder"
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "branch_2",
                "value": "Construction"
            }
        ]
    },
    {
        "Name": "Vconstruct",
        "description": "2. Software Engineer – Software Solutions for Construction Requirements: Good knowledge of object-oriented design and development and DBMSconcepts Expert in HTML5, CSS3, JavaScript Excellent communication, presentation and analytical skills Should be willing to work collaboratively across different skill sets Working knowledge of at least one front-end framework (react/angular) and back-end stack Eligibility: B.E. Final year students from CS/IT, Min 70% or equivalent marks (10th, 12th Or Diploma and overall in graduation). Selection Process: Round 1: Cognitive Test (Online) - 1 hr Includes aptitude Mathematical Ability and technical questions. • Reasoning Ability • Verbal Ability • Pseudo Code Round 2. Group Discussion - 10 min A general topic will be provided, and candidates will have 10 minutes to discuss. Round 3. In-Campus Interview Includes technical questions and HR interaction. Eligibility: Civil, Min 60% in 10th, 12th & Graduation, No Live Backlog.",
        "Keys": [
            {
                "key": "role",
                "value": "Software Engineer – Software Solutions for Construction"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Vconstruct",
        "description": "3. Data Science Engineer - DSA We are looking for candidates with passion for technology, excellent analytical skills, and ability to solve complex problems to undergo training in data Science related areas. Successful candidates will be part of the Data Science and Analytics team which is a tight-knit group of analysts and engineers that support all data aspects of DPR business. Requirements: B.E. / B.Tech Final year students with CS/IT background Excellent Academic Credentials Excellent Communication and Analytical skills Responsibilities: Post training, selected candidates will work in Data Science and Analytics. Candidates will be working mostly on US or EU based projects. They will transition into a data science engineer with the responsibilities outlined below - Understand and analyze the business requirements Design and deployment of the database - Ability to understand, consume and use API's, JSON, Web Services for data pipelines - Developing integrations between various applications Design, Develop and deploy reports/dashboards/data visualizations using Power BI - Optimize reports/dashboards with a focus on usability, performance, flexibility, testability, and standardization. - Build full stack data science models with various Azure technologies -Use R or Python to implement statistical models, machine learning, and analysis (Recommenders, Prediction, Classification, Clustering, etc.)",
        "Keys": [
            {
                "key": "role",
                "value": "Data Science Engineer - DSA"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "ZS",
        "description": "Role: Platform Services Associate Analyst CTC: ₹19 LPA - ₹13 LPA Location: Pune What You'll Do: • Tech Stack: Python , Analyst, SQL, PowerBI, Tableau. • Build complex solutions for clients using tools and technologies on the ZAIDYN platform. • Take ownership of activities and responsibilities across all project lifecycle phases to solve business problems in one or more client engagements. • Apply development methodologies (e.g., agile, waterfall) and best practices (e.g., QA procedures, unit testing) to ensure successful and timely task completion. • Collaborate with team members to ensure seamless project delivery. • Exhibit flexibility in tackling new challenges and demonstrate excellent task management. • Assist in creating project outputs, including business case development, solution design, user requirements, prototypes, technical architecture (if needed), test cases, and operations management. • Provide transparency in driving tasks to completion and report accurate progress status. • Bring a consulting mindset, leveraging technical and business expertise to solve problems and innovate. • Assist senior team members and delivery leads in project management responsibilities. What You'll Bring: • Qualification: Bachelor's degree in Computer Science, IT, or related disciplines with a strong academic record. • Additional Skills: • Bachelors Degree in CS, IT or EE • 1-2 years of experience in Power BI Administration • Office 365 Admin center and products suite knowledge • Experience in AWS Administration, Application deployment and configuration management • General database and data warehousing concepts and best practices • Working knowledge of different Operating Systems like Windows • Knowledge of AWS service (EC2,S3,IAM,VPC,Lambda,EMR,CloudFront,Elastic Load Balancer etc.) • Good knowledge of RDBMS and database technologies like SQL server, PostgreSQL. • Basic knowledge of web server software like IIS or Apache Tomcat • Good Knowledge of any scripting language like PowerShell, Python, Bash/Shell scripting • Eagerness to contribute in a team-oriented environment • Excellent communication and organizational skills • Comfortable working in rotational shifts • Ability to quickly learn new platforms, languages, tools, and techniques as needed to meet • project requirements • Ability to work independently",
        "Keys": [
            {
                "key": "ctc_max",
                "value": 19
            },
            {
                "key": "ctc_min",
                "value": 13
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "role",
                "value": "Platform Services Associate Analyst"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EE"
            }
        ]
    },
    {
        "Name": "ZS",
        "description": "Role - Software Engineer – Test Responsibilities: • Understand the behavior of complex web-based applications and apply that knowledge towards testing • Contribute to a project's overall test strategy and test plan • Create and execute test scenarios; select the best methods, techniques and evaluation criteria for testing • Identify test data requirements and generate required data to support testing • Evaluate and analyze application behavior and data for potential software issues • Clearly report and help prioritize issues found during testing • Create test deliverables required by company and project testing standards • Work collaboratively with other testers, developers, and stakeholders • Identify and lead process improvement efforts • Contribute during design reviews and recommend product improvements Qualifications: • Bachelor's or master's degree in computer science, a physical science, engineering, mathematics, economics, or another discipline with a quantitative focus • Strong academic record [India] (CGPA 7.0 or higher) • Extensive knowledge of manual testing • Advanced critical thinking skills • Excellent communication and interpersonal skills • Experience testing web applications is highly desirable • Understanding of defect tracking and test management software • Knowledge / exposure to all aspects of SDLC/STLC • Experience with Agile / Scrum methodologies • Exposure to automated testing is an added advantage • Ability to work in global cross-office teams • ZS is a global firm; fluency in English is required Eligibility Criteria • No Backlogs",
        "Keys": [
            {
                "key": "role",
                "value": "Software Engineer – Test"
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "Physical Science"
            },
            {
                "key": "branch_3",
                "value": "Engineering"
            },
            {
                "key": "branch_4",
                "value": "Mathematics"
            }
        ]
    },
    {
        "Name": "Aspect Ratio",
        "description": "CTC :- 12 LPA Job Description: As an Analyst your job would involve: • Taking a complicated business problem and structuring it into a mathematical problem • Implementing the solution in the best available tool – MS-Excel, Spotfire, R, Python etc. • Understand client requirements and provide solutions in a fast-paced environment • Effectively collaborate across teams • Dive deep into data, analyse, and discover patterns/root causes. Generate insights. • Design accurate and scalable prediction algorithms • Using your project management skills to work on multiple projects simultaneously • Designing and implementing processes to boost our performance . Essential skills: • Basic statistical modelling knowledge • Strong attention to detail with excellent problem-solving skills • Hands on experience on R/Python and SAS/SQL • Passionate about latest technology trends with a desire for innovation • Self-motivated, self-managing and able to work independently. Good communication skills Good to have skills: • Experience with patient level data or big data of any kind • Some experience in developing and supporting Machine Learning solutions • Academic Requirements: ○ UG: 70% required, 88.3% achieved ○ Class X: 70% required, 82% achieved ○ Class XII: 70% required, 79.6% achieved • PG/Dual Degree: Not applicable Selection Process: Round 1: Pre-placement Talk Round 2: Online Assessment (MCQs on Logical Reasoning & SQL, 2 SQL Code, 2 DSA que) 2HRs Round 3: Communication Test (Online) Round 4: Technical Interview Round 5: HR Round",
        "Keys": [
            {
                "key": "ctc",
                "value": 12
            },
            {
                "key": "role",
                "value": "Analyst"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Varroc",
        "description": "It gives me great pleasure to introduce Varroc as a GLOBAL LEADER IN AUTOMOTIVE COMPONENTS. Varroc is a global tier-1 automotive component company. We commenced operations in India with our Polymer business in 1990 We design, manufacture, and supply exterior lighting systems, plastic and polymer components, electrical-electronics components, and precision metallic components to passenger car, commercial vehicle, two-wheeler, three-wheeler and off-highway vehicle (“OHV”) OEMs directly worldwide. Job Description Graduate Engineer Trainee CTC: 11.5 LPA Selection Process(Online):- 1. 10th/12th percentage based resume shortlisting. 2. Aptitude: Reasoning Ability Verbal Ability Pseudo Code Puzzle Solving English Ability and Core Subjects Test (As per branch) (Not Proctored). 3. Technical Interview ( core ques, technical ques, CN, Managerial) Round 1 technical Round 2- Managerial Round 3 - HR Eligibility: B.Tech- CS group, IT, EC, EN, IND, EE, Mech 10th: 85% 12th : 75% Degree: 7 CGPA No live or dead backlog No gap year",
        "Keys": [
            {
                "key": "ctc",
                "value": 11.5
            },
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EC"
            },
            {
                "key": "branch_4",
                "value": "EN"
            },
            {
                "key": "cgpa",
                "value": 7
            }
        ]
    },
    {
        "Name": "Tech Mahindra",
        "description": "TECH mahindra CTC: 3.25 / 4 - 5.5 LPA Supercoder selection: • Candidates who excel academically & perform well in the selection process (excluding HR round) will qualify for consideration in the Supercoder cadre selection. • Eligible candidates will then take the Supercoder test, and those who pass will be designated as Supercoders. • Eligibility: CS/IT group. Selection process: 1. Aptitude Test: (90 min) 2. Reasoning Ability, Verbal Ability, Pseudo Code, Puzzle Solving, English Ability, English Essay/Story, Conversational Test. 3. Technical & Psychometric Test (technical MCQ, 2 coding test - 60 min) 4. Verbal Communication Test (SWAR) 5. Technical Interview 6. HR Interview Eligibility 70% or 7 CGPA (Without Rounding-up) in 10th, 12th /Diploma (in case done) No Active Backlog There should not be a gap of more than one year. Upon Selection • Candidate will be on probation for 6 months • Candidate clearing the regular selection process would become eligible for CTC of INR 3.25 L /Annum • COE Students will get 4 LPA. Only those who clear COE Exit Tests. • Candidate successfully passing the Supercoder selection process would become eligible for CTC of INR 5.5 L /Annum • Candidates will have to sign an indemnity bond for INR 1 L for a mandatory service period of 2 years from date of joining the company.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 3.25
            },
            {
                "key": "ctc_max",
                "value": 5.5
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Schneider Electric",
        "description": "Schneider Electric CTC: 12.5 LPA, Stipend: 35k Job Location: Mysore, Mumbai, Ahmednagar or Vadodara Responsibilities • Design & development of Low voltage Switchgear products like Air Circuit breakers, Molded Case Circuit Breakers, Contactors, Relays, and Starters etc. • Understanding the technological trends, demand, customer preferences and competitors' strategy • Get conversant with latest design trends in L.V. switchgear products. • Develop fair idea/ knowledge of engineering plastics and contact materials, their properties, characteristics used in switchgears • Understand and apply Indian and International Standards on L.V. Switchgear and their Testing. Qualifications Business / Soft Skills: • Must have solid presentation, communication and inter-personalskills. • Should be able to work in a cross cultural and cross functional global environment. • Have a logical mindset for problem solving and precision driven, innovative solutioning. • Should possess a keen interest in learning new technologies. • Should be adaptable with changing trends and driven to enhance business and technological acumen • Should be able to manage multiple priorities in a fast-paced environment. • An excellent attention to details. Technology Skills and Project/Internship Experience: • Manufacturing process knowledge, PFMEA, Statistical techniques • Strong knowledge of Microsoft applications (Excel, Word, Teams etc.) • Good knowledge of the design & development process • Ability to showcase Data Analysis skills, Problem-solving capabilities with Logical interpretation and reasoning. • Exposure to business world through projects/Internships is a plus. Selection Process: Round 1: Written test (60 Min) No of questions :40 No of sections :2 (Technical and General Aptitude, Memory Based Question) Technical based on your core subjects. Round 2: Technical Interview (technical questions, Core ques, Resume based questions, Project related questions) Round 3: HR Interview Eligibility Criteria Should have 65% and above in X, XII, Graduation No Live Backlog B.E./B. Tech in Electrical/Electrical & Electronics/Electronics & Communication",
        "Keys": [
            {
                "key": "ctc",
                "value": 12.5
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "location_1",
                "value": "Mysore"
            },
            {
                "key": "location_2",
                "value": "Mumbai"
            },
            {
                "key": "location_3",
                "value": "Ahmednagar"
            },
            {
                "key": "location_4",
                "value": "Vadodara"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Electrical"
            },
            {
                "key": "branch_2",
                "value": "Electrical & Electronics"
            },
            {
                "key": "branch_3",
                "value": "Electronics & Communication"
            }
        ]
    },
    {
        "Name": "Cognida.ai",
        "description": "Cognida.ai is an AI-first solutions company specializing in Practical AI and Predictive Analytics for Enterprises. Cognida.ai helps enterprises capitalize their most strategic asset—Data—to strengthen their competitive advantage. CTC: 7 LPA Location: Hyderabad Selection Process: Round 1: Online coding challenge 12 Ques (Easy, medium, Hard) Round 2: Technical interviews Round 3: HR discussions. Eligibility Criteria Aggregate of 70 % / 7 CGPA and above NO Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "SOFTLINK INTERNATIONAL",
        "description": "CTC: 6 LPA Role: Trainee Software Engineer Location - Pune Job Description of Trainee Software Engineer Coding and development of Software modules, Unit testing, Quality assurance, Release and implementation, Installation and Support. Technologies C#.NET, ASP.Net MVC, .Net Core, Xamarin, SQL, HTML5, Visual C/C++, Web Technologies Career Roadmap - Trainee Software Engineer -> Software Engineer -> Sr. Software Engineer -> Team Lead -> Product / Project Manager Selection Process: (Every round is an elimination round) Round 1:InCampus online Assessment (Aptitude 60 MCQ) 60 mins Round 2: Group Discussion Round 3: Technical Interview Round 4: HR Interview Eligibility Criteria: CS/IT group, ECE, EN SSC & HSC: Minimum 80% and above Important: Diploma holders with a 3-year degree will NOT be eligible. No gap in edu. allowed. Note: Company has minimum 2.5 years bond tenure and 6 months' probation.",
        "Keys": [
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "role",
                "value": "Trainee Software Engineer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "ECE"
            },
            {
                "key": "branch_4",
                "value": "EN"
            },
            {
                "key": "percent",
                "value": 80
            }
        ]
    },
    {
        "Name": "Principal Global Services",
        "description": "Position Title: Trainee Developer, this role is responsible for developing, testing and maintaining the application with established processes. Designation: Trainee Analyst CTC: 8 LPA, Stipend: 25k Location: Pune or Hyderabad Key Responsibilities: • Develop application code for programs while following coding standards • Develop and execute unit tests",
        "Keys": [
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "role",
                "value": "Trainee Developer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            }
        ]
    },
    {
        "Name": "YOptima",
        "description": "Eligibility:CS/IT group only80% and above throughout (10th,12th,UG -until 6th Semester)No Live Backlog.YoptimaJob Role: Account ExecutiveCTC: 7 LPA. Stipend: 25K/monthLocation: Jui Nagar, Navi MumbaiPost-Internship Opportunity: After successfully completing the internship and a thorough assessment, candidates will be offered a permanent role with a total compensation of ₹7 Lakh CTC (₹5 Lakh Fixed + ₹2 Lakh Variable+ other benefits) for BTech graduates.Responsibilities: Analyse digital behavior of the online consumers across different digital channels and design actionable insights and solutions to improve marketing ROI at scale. Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advanced analytical methods as needed. Assist in designing relevant marketing plans and strategies for digital ad campaigns, combining understanding of consumer behavior, data driven insights, product positioning and marketing objectives. Troubleshoot technical issues both internally and with Third party vendors. Manage servicing needs of clients and win sustainable customer delight and brand advocacy.Competencies: 0-2 yrs Exp with Bachelor's or Master's degree in a quantitative discipline (e.g. business administration, engineering, statistics, operations research, economics, mathematics). Strong analytical and problem-solving skills. Ability to present results of complex analysis compellingly to both technical and non-technical audiences. Self-motivated with the ability to work independently and within a team.Selection Process:Round 1: BD Online Assessment – A mandatory evaluation.Round 2: Shortlisted candidates from the assessment will go through 2-3 rounds of interviews with the Co-founders (COO & CEO).",
        "Keys": [
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "role",
                "value": "Account Executive"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Jui Nagar"
            },
            {
                "key": "location_2",
                "value": "Navi Mumbai"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "Bluealtair",
        "description": "bluealtairJob Role: Graduate Engineer TraineeCTC: 5 LPA, Stipend: 20k/month (Permanent placement - Post internship completion based on the performance).Location: PuneAbout us: Blue Altair is a successor company of Fresh Gravity.It is a niche, sleek, high-end consulting firm that is employee centric, client focused, partner tied, and innovation driven.Core capabilities at Blue Altair are:• API Management & Integration-o API Business Strategy with “API First” Approach,o API Program and Technical Strategy,o iPaaS Strategy, API Gateway Package Selection,o Deployment (on-premises, cloud, hybrid),o iPaaS based system integration)• Data Managemento Cloud Data Migration,o Smart Analyticso Master Data Management,o Data Platform Strategy and Roadmapo Data Platform Modernizationo Data Governance and Strategy Roadmap• Data Science and AIo Big Data Analytics,o Machine Learning & Artificial Intelligence,o Deep Learning, Supervised,o Unsupervised and Semi-Supervised Learning,o Explainable AI,o Computer Vision,o Natural Language Processing• Digital Application Developmento Full Stack Developmento Web and Mobile Developmento DevOpso MicroservicesSelection Process:Round 1: Online Programming Test (MCQS on Aptitude ques, OS, CN,DBMS, 2 ques Coding Ques)Round 2: Technical Interview 1",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 5
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "location_1",
                "value": "Pune"
            }
        ]
    },
    {
        "Name": "JSW",
        "description": "Eligibility Criteria:Min. 60% & above in 10th, 12th, GraduationNo gaps or year down in academics.No Live BacklogJSWJob Role: Graduate Engineer TraineeCTC: 6 LPA (Fixed + Variable)The CTC is INR 5.5 LPA - INR 4.67 LPA (Fixed) in addition to INR 83,000 (Variables)Retention Bonus - INR 1 lakh (End of Year 1 - 50% and End of Year 2 - 50%)Job Description:• Completing all tasks set by the Supervisor and assisting wherever possible.• Observing existing strategies and techniques and offering suggestions for improvement.• Conducting research and collating data.• Traveling to different sites and gaining practical experience in new work zones.• Working closely with staff to foster professional values and build good relationships.• Observing health and safety guidelines at all times.• Attending meetings and workshops.• Submitting to all forms of evaluation during the traineeship.• Compiling reports and delivering presentations to staff members and other stakeholders.Selection Process:Round1: Online AssessmentRound 2: Online AssessmentRound 3: InterviewsEligibility Criteria:• Candidates should be open for any location pan India. no location preference will be considered. In casehe/she accepts the offer and then drops out because of the location constraint, then he/she will be blacklistedfrom the JSW group.• Branch: Mech, Indus, Civil• Candidate's age must be 24 years or less as of 1st April 2025.• Candidates must meet all the necessary fitness criteria. At any stage, the candidate must meet all necessaryfitness criteria.• No Live/Open Backlogs are allowed, In the case of Previous backlogs all should be cleared/closed beforeapplying. No lateral entry is allowed. No repeat year allowed.• The offer will be revoked if any information provided by the candidate at any stage stands incorrect.• No gap year is allowed between 10th, 12th, or any year of the Graduation Degree.• Min 60% and above throughout 10th, 12th and College.",
        "Keys": [
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc_max",
                "value": 6
            },
            {
                "key": "ctc_min",
                "value": 4.67
            },
            {
                "key": "location_1",
                "value": "pan India"
            },
            {
                "key": "branch_1",
                "value": "Mech"
            },
            {
                "key": "branch_2",
                "value": "Indus"
            },
            {
                "key": "branch_3",
                "value": "Civil"
            }
        ]
    },
    {
        "Name": "GOCOMET",
        "description": "GOCOMET:Why GoComet?GoComet is a dynamic SaaS start-up that provides AI-powered transportation visibility solutions to revolutionize thetrillion-dollar logistics sector. At GoComet, we are revolutionizing the logistics sector one day at a time, and every teammember is committed to making it a reality. We're seeking individuals who embody our core values, character, andattitude. While we recognize that skills can be developed with the right mindset and learnability, we prioritize thosewho share our philosophy. Our recruitment processes reflect this belief. Look no further if you're looking for a diverse,talented, and vibrant workplace that recognizes and rewards hard work. We're ambitious, fast-paced, and unafraid toexperiment, fail, learn, and ultimately succeed. This is us! Join our team if you share our culture and values. We're anequal-opportunity employer. We welcome qualified applicants from all races, colors, religions, sexes, nationalities,sexual orientations, gender identities, and abilities.Job Role : Backend Intern (Data Engine)Stipend: 15KRoles & Responsibilities:• Understanding of manual and automation testing.• Have Basic programming skills.• Concentrating on details, including automated tests and documentation.• Ambitious and passionate about QA.•A great teammate and self-starter that is comfortable working in a rapidly changing environment and taking initiativewith limited resources.• Comfortable managing multiple assignments with competing priorities and tight deadlines• Fast learner with good communication skills.Experience & Skills:• Experience in Development using Ruby/Python.• Design and implement solutions to extract data from diverse websites, adhering toproject requirements.• Implement robust data extraction and parsing mechanisms to ensure accurate andstructured data retrieval.• Should have live projects available to demonstrate• Good understanding of Object Oriented Programming• An agile mindset and the ability to adapt to changing priorities and requirements• Good in analyzing and solving problems• Passionate to work in a start-upBenefits of the role includes:• Mentorship and guidance from engineers .• Exposure to industry best practices and emerging technologies.• Opportunity to enhance technical and analytical skills.• 5 Days working.• Flexible Working Hours.• Joining KitEligibility:Btech Grad",
        "Keys": [
            {
                "key": "role",
                "value": "Backend Intern (Data Engine)"
            },
            {
                "key": "stipend",
                "value": 15
            },
            {
                "key": "branch_1",
                "value": "Btech Grad"
            }
        ]
    },
    {
        "Name": "AVEVA",
        "description": "AVEVA Role: Graduate TraineeReports To: Team LeadContract: Full-time permanentAbout AVEVADepartment: Global Delivery Centre, IndiaLocation: Hyderabad/BengaluruAVEVA is a global leader in industrial software, driving digital transformation and sustainability.By connecting the power of information and artificial intelligence with human insight, AVEVAenables teams to use their data to unlock new value. We call this Performance Intelligence.AVEVA's comprehensive portfolio enables more than 20,000 industrial enterprises to engineersmarter, operate better and drive sustainable efficiency. AVEVA supports customers through atrusted ecosystem that includes 5,500 partners and 5,700 certified developers around the world.The company is headquartered in Cambridge, UK, with over 6,500 employees and 90 offices inover 40 countries.We take pride in our core values and the diversity of our people, valuing the unique experienceand expertise that people from different backgrounds bring to our business.AVEVA is an Equal Opportunity Employer, and we take pride in the diversity of our employees,valuing the special experience and expertise that people from different backgrounds bring to ourbusiness. The ability to develop ground-breaking technologies is one of our key assets and ourpeople make it happen.About the roleAs a part of the development team, you'll be responsible for configuring, developing, testing andmaintain AVEVA software products and solutions. Responsible for delivering world-class products and solutions usinglatest technologies, established standards and processes in collaboration with other teams.In this role you will:• Be an integral part of global services team.• Configures and/or customises core product.• For Developer Role• Develop applications using cutting edge technologies likes .Net Core, Microservices,Node, Python,React, Angular, SQL, Analytics and Machine learning which meet functional and non-functionalrequirements with built-in-quality.• For Non-Developer Role• Develop applications/models using AVEVA products, which meet functional and non-functionalrequirements with built-in-quality.• Author, review, execute, maintain, and test applications.• Develop, build, customize, deploy, and manage the environment, test suits and testautomation frameworks.• Performs both unit and integration testing.• Deploys solutions into AVEVA's or Customer infrastructure.• Contributes to technical project documentation deliverables, taking responsibility ofaccuracy and flow of content.• Manages own time effectively within the scope of work allocated and ensures both a timelyand high-quality delivery.• Performs knowledge transfer to team members and customer representatives.It is a pre-requisite to be able to function effectively as a member of a dynamic team within amatrixed organisation. Excellent communication skills will be required to develop good workingrelationships in the following areas:• the region-based Project Managers and technical resources to ensure successful delivery ofthe project.• with other members of the Global Delivery Centre team in Hyderabad within a project andto share knowledge• develops good working relationships with customer representatives and always providesthe highest level of customer service and professionalism.Mandatory Competencies, Knowledge and Skills:• Must have regular BE/BTech degree pursuing in (Computer, Chemical, Mechanical, Electrical,Instrumentation, Industrial)• Average aggregate 65% and above with no backlogs• Strong analytical skills, Communication, Problem Solving skills.• Basic knowledge of software development methodologies (e.g., Agile, Waterfall) and onsoftware development lifecycle (SDLC).• Good Problem Solving and Requirement understanding skills as well as a positive attitude,ability, and desire to learn new processes and technologies.• Organization: You'll be working in a fast-paced, high-volume, and evolving workenvironment, so time management and effective prioritisation will be essential• Customer focus: You'll be working directly with our customers. Being able to listen to themand understand their requests, and then address them in a proactive and consultativemanner, will be part of your day-to-day• Problem-solving: You'll need to enjoy getting stuck into problems. Troubleshooting andsolving challenging problems is a big part of this role.Come and join AVEVA to create the transformative technology that enables our customers to engineer abetter world!",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Trainee"
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "location_2",
                "value": "Bengaluru"
            },
            {
                "key": "branch_1",
                "value": "Computer"
            },
            {
                "key": "branch_2",
                "value": "Chemical"
            },
            {
                "key": "branch_3",
                "value": "Mechanical"
            },
            {
                "key": "branch_4",
                "value": "Electrical"
            },
            {
                "key": "percent",
                "value": 65
            }
        ]
    },
    {
        "Name": "Chegg",
        "description": "Chegg ®Job Title: Managed Network Expert (Subject Expert)Work location: Remote, work from homeTimings: Flexible work schedule (as per individual preference)Job Type: Part-timeOur subject experts are expected to solve academic questions asked by students on ourQuestion & Answer board.Eligibility• Enrolled as a student in Diploma, Bachelor's, Master's or Doctorate degree programsin therespective field of study.• This opportunity is NOT restricted to final year (semester) students only. Studentsfrom previous years can also apply.Expectations• Ensure that outlined quality parameters are followed.• Ensure that authoring guidelines are adhered• To ensure high-level of academicBenefits• Compensation: Paid per question answered (no limits)• Average Income: INR 30,000 to INR 80,000 per month*• Experience certificate at the end of tenure.• Earn while you learn.• Academic development.• Flexible work schedule.• Exposure to working at an MNC.Company Description:As the leading student-first connected learning platform,Chegg's Student Hub makes higher education more affordable and more accessible,all while improving student outcomes. Chegg is a publicly-held company based inSanta Clara, CA with offices in San Francisco, New York, Portland, India, Israel,Berlin, and Ukraine. Chegg Student Hub Services Include: Chegg Study, CheggTutoring, Chegg Writing Tools, Test Prep, Careers Search, Internship Admissionsand College Admissions.Chegg India, a premier educational services company and a wholly ownedsubsidiary of Chegg Inc., has been offering high quality services in the area ofHomework Help, Scholarships and Content Creation for American UniversityTextbooks. Chegg India has a vast network of employees with offices in Delhi andVisakhapatnam ably supported by a team of Managed Network Experts and TerritoryManagers who handle the Pan India Operations.'Student First' is our DNA. It drives everything we do. From the way we build ournetwork to the way we connect students to opportunity. We give every student theability to realize their full potential.",
        "Keys": [
            {
                "key": "role",
                "value": "Managed Network Expert (Subject Expert)"
            },
            {
                "key": "location_1",
                "value": "Remote"
            },
            {
                "key": "stipend_min",
                "value": 30
            },
            {
                "key": "stipend_max",
                "value": 80
            }
        ]
    },
    {
        "Name": "JTP",
        "description": "JTPAbout the company:JTP is a listed company on JASDAQ (Japanese Stock exchange) as JTP 2488. Our portfolio encapsulates services andproducts in ROBOTICS, Hardware / Software development, Pharma and Human resource development. Our headoffice is in Japan with branch offices in the USA, India, Korea, and many other countries. JTP has over 35 yearsof experience in the Japanese market. We work with clients such as EMC, SAP, Hitachi, NVIDIA, Softbank, Mitsubishietc.Job role: System engineerCTC: 24 LPALocation: JapanThe hiring process will be as follows:Step 1: Application.Step 2: Selection for technical assessments.Step 3: Technical assessmentStep 4: English Interview (Please note students with insufficient international level English skills will beeliminated. Students with Mother Tongue influence will be eliminated)Step 5: Virtual Training + Project round.Step 6: Golden ticket opportunity for few students*Step 7: CEO panel Interview.Eligibility branches: CS, IT, EC, E&TC, МСА, ВСА.Eligibility criterion: All students who are passionate for IT. (No merit criterion)",
        "Keys": [
            {
                "key": "role",
                "value": "System engineer"
            },
            {
                "key": "ctc",
                "value": 24
            },
            {
                "key": "location_1",
                "value": "Japan"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EC"
            },
            {
                "key": "branch_4",
                "value": "E&TC"
            }
        ]
    },
    {
        "Name": "Darwinbox",
        "description": "ddarwinboxAbout Darwinbox:Darwinbox is Asia's fastest-growing SaaS-based HR Technology platform. A brainchild of alumni from the country'smost distinguished institutions (IIT/IIM/XLRI) and organizations (McKinsey, EY, Google), Darwinbox is the preferredtechnology partner of 500+ global enterprises with more than 1 million+ employees using the platform. Our endto-endHCM technology suite competes with the best in the business and has won against giants such as SAP, Oracle, andWorkday several times to acquire iconic enterprise customers ranging from the largest conglomerates to unicorns -Adani, Mahindra, Kotak, TVS, Arvind, Nivea, Puma, Swiggy, Paytm, Bigbasket and Delhivery etc.The rate at which our product and market presence is growing is unprecedented. We're arocketship. We're not planning on slowing down anytime soon. And, that's why we need you!Designation: Intern- Product Development (The role can be converted to full time Software Engineer)Duration & Stipend: 6 Months, 25k per monthCTC: 16,30,000 LPALocation: HyderabadRoles and Responsibilities:• Coding• Product Development• Backend or Front-end DevelopmentAs fitment with the organization culture is very important you will immensely like the job ifyou:• Enjoy working in a fast-paced company environment.• Should be stack agnostic and should not have any tech prejudice.• Prefer a non-hierarchical, independent, and non-pushy environment.• Are self-motivated to take up a high degree of ownership.• Passionate about programming and can't sleep without coding.Min. Eligibility: B.Tech (CSE/IT) 2025, Minimum 60%( No Backlogs)Selection Process:• Coding Rounds- 1 & 2• Technical Interviews• HR & Management Interview",
        "Keys": [
            {
                "key": "role",
                "value": "Intern- Product Development"
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "ctc",
                "value": 16.3
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "CSE"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    },
    {
        "Name": "TIAA",
        "description": "TIAAJob Title: Cyber-Security TraineeCTC: 10.48 LPALocation: PunePosition Summary:Describing below the primary purpose and function of this job:• TIAA India is looking for trainees under Cyber Internship Program with an objective of providing exposure toyoung and budding tech talent and providing an opportunity for them to get acquainted with the Corporateculture and insights into Technology.• Selected Candidates will have the opportunity for 10 Weeks of internship with Cyber Security team beforeonboarding them as full-time employees as Trainees.• The Trainee will be responsible for development, communication, implementation, enforcement andmonitoring of security controls to protect the organization's technology assets from intentional or inadvertentmodification, disclosure or destruction. The trainee is responsible for monitoring computer security proceduresand maintaining IT security policies, procedures and testing results.• The Trainee typically works as part of a project team or as an individual contributor under guidance from aMentor. The Trainee will communicate progress, resolve technical issues and work with the appropriate teamsfor solutions.Fundamental knowledge and conceptual understanding required for-• Working knowledge of Computers and IT Concepts like OS, Network, Databases, IT Systems and web applications• Cyber Security Concepts and Principles covering various cyber domains such as Security, Data protection, IT Risk and Governance, Security Operations, System Design and Architecture, Web ApplicationDevelopment, SDLC concepts, DevOps, Application security and vulnerability testing, Encryption and Cryptography,CWPP, CSPM, Identity & Access Management, Privilege access management, Security Monitoring and reporting.• Web development tools and scripting knowledge for Python, Bash, Shell, R, PowerShell, JSON, and others• Conceptual knowledge on emerging technologies – Blockchain, Quantum Computing, AI / ML, Severless, APIKey Duties & Responsibilities:The Trainee will attend a boot camp (an initial training program) as per the requirement where they will undergo atraining program focusing on TIAA Values & Behavior, Business domains, technology platforms, etc. After successfulcompletion of boot camp the Trainee will be aligned to any of the below mentioned cyber domains based on theiraspirations, project requirements and interview performance.• Threat Monitoring• Vulnerability Management• Defense-in-Depth practices to protect networks.• Threat Intelligence• Platform Security Engineering - Network Security, End Point Security and Cloud Security• IAM Operations• Cyber Custom Development• Cyber Fraud Investigator• EKM Engineering• Third Party information Security Risk managementEligibility Criteria:• Minimum 60% aggregate in 10th, 12th and Graduation• B.E/B.Tech in Cyber Security only",
        "Keys": [
            {
                "key": "role",
                "value": "Cyber-Security Trainee"
            },
            {
                "key": "ctc",
                "value": 10.48
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Cyber Security"
            }
        ]
    },
    {
        "Name": "Quantiphi",
        "description": "quantiphiQuantiphiLocation: Mumbai/BangloreEligibility Criteria:CTC:• Branches - B.E, M.E, MCA, B.Tech & M.Tech• 70% and above in 10th, 12th and Graduation (till now) with no-reappears/backlogs.1. Stipend 10K for 4 months and virtual internship2. Stipend 23K for 2 months and in person/hybrid internship3.CTC on FTE Conversion: 8.5 LPA (6.5 LPA - Fixed & 2 Lakhs - QCDP)Job Role: Data EngineerResponsibilities:• Work with business users and other stakeholders to understand business processes.• Ability to understand, design and implement Dimensions and Fact tables• Identify and implement data transformation/cleansing requirements• Profile source data to check data quality and develop Data Pipelines to implement ETL logic• Create and execute test plans debug existing Data Pipelines• Create data visualizations• Write SQL code-Queries/Stored Procedures/FunctionsRequirements:Strong SQL writing skills• Strong knowledge on Data Warehouse and ETL concepts• Familiarity with Kimball and Inmon Data Warehouse methodology Understand project-specific requirements,standards, guidelines, and processes• Demonstrated success working in a team-based environment• Good written/oral communication skills• Strong analytical and problem solving skillsJob Role: Business AnalystResponsibilities:• Participate in on-site and offshore engagements to deliver services to our client base.• Translate the business requirements into technical problems for the team and deliver technical solutions inbusiness terms to the client.",
        "Keys": [
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "location_2",
                "value": "Banglore"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "B.E"
            },
            {
                "key": "branch_2",
                "value": "M.E"
            },
            {
                "key": "branch_3",
                "value": "MCA"
            },
            {
                "key": "branch_4",
                "value": "B.Tech"
            },
            {
                "key": "stipend_min",
                "value": 10
            },
            {
                "key": "stipend_max",
                "value": 23
            },
            {
                "key": "ctc",
                "value": 8.5
            },
            {
                "key": "role",
                "value": "Data Engineer"
            }
        ]
    },
    {
        "Name": "Schneider Electric",
        "description": "Schneider Electric CTC: 12.5 LPA, Stipend: 35k Job Location: Mysore, Mumbai, Ahmednagar or Vadodara Responsibilities • Design & development of Low voltage Switchgear products like Air Circuit breakers, Molded Case Circuit Breakers, Contactors, Relays, and Starters etc. • Understanding the technological trends, market demands, customer preferences and competitors' strategy • Get conversant with latest design trends in L.V. switchgear products. • Develop fair idea/ knowledge of engineering plastics and contact materials, their properties, characteristics used in switchgears • Understand and apply Indian and International Standards on L.V. Switchgear and their Testing. Qualifications Business / Soft Skills: • Must have solid presentation, communication and inter-personalskills. • Should be able to work in a cross cultural and cross functional global environment. • Have a logical mindset for problem solving and precision driven, innovative solutioning. • Should possess a keen interest in learning new technologies. • Should be adaptable with changing trends and driven to enhance business and technological acumen • Should be able to manage multiple priorities in a fast-paced environment. • An excellent attention to details. Technology Skills and Project/Internship Experience: • Manufacturing process knowledge, PFMEA, Statistical techniques • Strong knowledge of Microsoft applications (Excel, Word, Teams etc.) • Good knowledge of the design & development process",
        "Keys": [
            {
                "key": "ctc",
                "value": 12.5
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "location_1",
                "value": "Mysore"
            },
            {
                "key": "location_2",
                "value": "Mumbai"
            }
        ]
    },
    {
        "Name": "Cognida.ai",
        "description": "Cognida.ai Cognida.ai is an AI-first solutions company specializing in Practical AI and Predictive Analytics for Enterprises. Cognida.ai helps enterprises capitalize their most strategic asset—Data—to strengthen their competitive advantage. CTC: 7 LPA Location: Hyderabad Selection Process: Round 1: Online coding challenge 12 Ques (Easy, medium, Hard) Round 2: Technical interviews Round 3: HR discussions. Eligibility Criteria Aggregate of 70 % / 7 CGPA and above NO Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "cgpa",
                "value": 7
            }
        ]
    },
    {
        "Name": "SOFTLINK INTERNATIONAL",
        "description": "SOFTLINK INTERNATIONAL CTC: 6 LPA Role: Trainee Software Engineer Location - Pune Job Description of Trainee Software Engineer Coding and development of Software modules, Unit testing, Quality assurance, Release and implementation, Installation and Support. Technologies C#.NET, ASP.Net MVC, .Net Core, Xamarin, SQL, HTML5, Visual C/C++, Web Technologies Career Roadmap - Trainee Software Engineer -> Software Engineer -> Sr. Software Engineer -> Team Lead -> Product / Project Manager Selection Process: (Every round is an elimination round) Round 1:InCampus online Assessment (Aptitude 60 MCQ) 60 mins Round 2: Group Discussion Round 3: Technical Interview Round 4: HR Interview Eligibility Criteria: CS/IT group, ECE, EN SSC & HSC: Minimum 80% and above Important: Diploma holders with a 3-year degree will NOT be eligible. No gap in edu. allowed. Note: Company has minimum 2.5 years bond tenure and 6 months' probation.",
        "Keys": [
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "role",
                "value": "Trainee Software Engineer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "Principal Global Services",
        "description": "Principal Global Services Position Title: Trainee Developer, this role is responsible for developing, testing and maintaining the application with established processes. Designation: Trainee Analyst CTC: 8 LPA, Stipend: 25k Location: Pune or Hyderabad Key Responsibilities: • Develop application code for programs while following coding standards • Develop and execute unit tests • Complete Analysis & documentation as required by the project • Support application testing and resolve test defects • Report status updates as required by the project • Follow established project execution processes • Focus on self-development & develop application and domain understanding. Skill set: • Analysis, Design, Coding, Testing, reviews and Documentation. • Test Case execution, Test Reporting, Defect life cycle, Status Reporting. • Reporting, Effective interaction with team Other: Good aptitude, positive attitude, strong reasoning and communication skills. Must be a good team player. Good analytical skills, challenging and research oriented. Eligibility : • BE/BTech (Computer Science, Information Technology/Science, Electronics & Communication or Electronics & Telecommunication) and MCA students only • 60% (first class) or equivalent CGPA throughout Academics (10th, 12th, Diploma & Graduation) • No live Backlogs/ATKT • Fulltime Education throughout Academics (10th, 12th, Diploma & Graduation) • Excellent Communication Skills • Selection Process: Round 1: Resume Shortlisting Round 2: Online Assessment (Coding(CS Core subject(OS, CN, pseudo Code, Basic DSA + Aptitude +2 Coding Ques) - 2 hrs Round 3: Technical Interview Round 4: HR Interview",
        "Keys": [
            {
                "key": "role",
                "value": "Trainee Developer"
            },
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "Information Technology/Science"
            },
            {
                "key": "branch_3",
                "value": "Electronics & Communication"
            },
            {
                "key": "branch_4",
                "value": "Electronics & Telecommunication"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "cgpa",
                "value": 6
            }
        ]
    },
    {
        "Name": "PHILIPS",
        "description": "PHILIPS: Job role: Graduate Engineer interns. Assist in the design, development, and testing of electrical systems and components. Support the creation and review of electrical schematics and diagrams. Participate in troubleshooting and problem-solving of electrical issues. Collaborate with the engineering team on various projects and tasks. Stipend: 45k Duration: 10 months Eligibility: For B.Tech. - Biomedical Engineering- Min. 65% in overall academics (10th, 12th, Graduation) No Live Backlog For: B.Tech. - Electrical Engineering- Min. 7 CGPA in Graduation No Live Backlog Other Details: Electrical Engineering Interns: (embedded) Pursuing or recently completed a degree in Electrical Engineering or a related field. Basic understanding of electrical circuits, systems, and components. Familiarity with relevant software tools (e.g., MATLAB, SPICE) is a plus. Strong analytical and problem-solving skills. Selection Process:",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer interns"
            },
            {
                "key": "stipend",
                "value": 45
            },
            {
                "key": "branch_1",
                "value": "Biomedical Engineering"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_2",
                "value": "Electrical Engineering"
            },
            {
                "key": "cgpa",
                "value": 7
            }
        ]
    },
    {
        "Name": "C&R Software",
        "description": "C&R Software Collections & Recovery Simplified C&R Software Job Role: Solution Integration - Intern Qualified candidates are being considered for Internship within the Professional Services group at C&R Software, Bangalore. These candidates shall possess a strong educational background in Computer Science and are expected to work on small to medium scale solution integration projects. During the Internship candidates shall undergo training and will be expected to contribute to projects which focus on the integration of information, process, and people through the application of multiple technologies. Internship is WFH, however, may be called to office for working/training/internship from office. Domains - Java, Python, DevOps. Note:- PPO is based on their performance and business needs. CTC: 8 LPA, Stipend: 25k Description: Role / Responsibilities- • Understand project requirements and assist in developing business and technical specifications. • Assist in turning business and technical specifications into data extraction/load programs. • Learn & implement the Techniques and Tools to implement Configurations to our product and its UI • Program ETL tool with business rules to be applied to data from source input to target data repository. • Develop and assist in implementing system and unit test programsPerform data conversion, quality, and integrity checks for all programs/processes. Eligibility Criteria: CS/IT group & MCA only. Other details:",
        "Keys": [
            {
                "key": "role",
                "value": "Solution Integration - Intern"
            },
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            }
        ]
    },
    {
        "Name": "Eaton",
        "description": "Eaton Powering Business Worldwide Job Role: Associate Engineer CTC: 9 LPA Selection Process: Round 1: Resume Shortlisting Round 2: Technical Interview (Brach related ques, Resume based, Project based) Round 3: HR Interview Eligibility B.Tech. - Industrial, Mechanical 7 CGPA & above in Graduation No live/dead backlog",
        "Keys": [
            {
                "key": "role",
                "value": "Associate Engineer"
            },
            {
                "key": "ctc",
                "value": 9
            },
            {
                "key": "branch_1",
                "value": "Industrial"
            },
            {
                "key": "branch_2",
                "value": "Mechanical"
            },
            {
                "key": "cgpa",
                "value": 7
            }
        ]
    },
    {
        "Name": "Finastra",
        "description": "FINASTRA Finastra Job Role: Graduate Engineer Trainee CTC: 7.5 LPA Requirements: • A desire to learn and grow professionally across one or various functions within the firm • Knowledge in Business, Computer Science, Computer/Software Engineering, E&TC, or related disciplines • Knowledge of variety of coding languages a plus (eg, HTML/HTML5,Java, C++, JavaScript, JQuery, CSS, XML, WCF, ASP.NET MVC, XSLT, Windows Services, MSMQ, AngularJS 2, ASP.NET Web API, BootStrap, TypeScript, GIT, Kentico) • Strong communication skills • Curious and comfortable with ambiguity • Flexibility and ability to work in a fast-paced environment • Demonstrated problem solving and analytical skills • Self-starter, ability to work in a virtual environment as needed",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 7.5
            },
            {
                "key": "branch_1",
                "value": "Business"
            },
            {
                "key": "branch_2",
                "value": "Computer Science"
            },
            {
                "key": "branch_3",
                "value": "Computer/Software Engineering"
            },
            {
                "key": "branch_4",
                "value": "E&TC"
            }
        ]
    },
    {
        "Name": "DE Shaw & Co",
        "description": "DE Shaw & Co Job Role: Front Office Tech Associate We are looking for a resourceful candidate to join our Front Office Technology group based in Hyderabad. The team specializes in building high quality applications and web-based products with a focus on usability, speed, security, and productivity. Compensation and Benefits Package: Base INR 12,25,000 Variable* INR 1,50,000 - INR 2,00,000 Benefits INR 5,30,000 Relocation Allowance** INR 2,00,000 Joining Bonus INR 1,50,000 Compensation and Benefits Package - INR 22,55,000 – INR 23,05,000 • Lower amount is guaranteed, higher amount is dependent on performance. • Relocation will entail reimbursement on travel (in full), guest house stay for 14 nights & reimbursement of movement of household goods, brokerage; on actuals up to a maximum of INR 50,000 Location: Hyderabad What you will do day-to-day: • Address queries from the trading floor and other related front office entities on data and software owned by Front Office Tech. • Build and maintain reports and metrics related to accuracy of our data and performance of software. • Partner with cross functional operations and technology teams to solve problems and identify improvement opportunities • Work closely with technology developers on fixing issues that are critical to the business, document, and track all changes in production. • Drive requirements and organize documents related to operational activities as well as new initiatives that will improve business operations. • Escalate issues to the developers that require code changes. Who we are looking for: • Min. cgpa of 7 in CS/IT group & 8 cgpa in circuit branches with no current backlogs. • The candidate should have an extraordinary record of academic achievements, excellent interpersonal, organizational, and analytical skills, along with exceptional verbal acuity and command of detail. • Candidates should possess excellent problem solving and logical reasoning skills as well as ability to adhere to timelines while delivering his/her responsibilities. • Exposure to scripting, shell commands and familiarity with at least one programming language like C, C++, Python, or Java. Good understanding of core CS concepts like databases, operating systems, and networking. • Understanding of the finance domain will be an added advantage. Internship Benefits Package • Stipend INR 1,02,083 per month • Benefits Company paid accommodation for 14 days • Insurance Coverage • Breakfast, Lunch, Snacks • Training • To and fro domestic air travel (up to INR 15,000) Selection Process: Round 1: Online Assessment • Coding: 3 que of medium difficulty. • Technical and Aptitude: MCQs on OOPS, DBMS, CN and aptitude questions as well. (DE Shaw aptitude test is generally considered hard.) Round 2: Technical Interview I Round 3: Technical Interview II Round 4: HR Interview",
        "Keys": [
            {
                "key": "role",
                "value": "Front Office Tech Associate"
            },
            {
                "key": "ctc_min",
                "value": 22.55
            },
            {
                "key": "ctc_max",
                "value": 23.05
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "cgpa_1",
                "value": 7
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            },
            {
                "key": "cgpa_2",
                "value": 8
            },
            {
                "key": "branch_2",
                "value": "Circuit branches"
            },
            {
                "key": "stipend",
                "value": 102.083
            }
        ]
    },
    {
        "Name": "EPAM",
        "description": "EPAM Job Role: SDE (Intern + FTE) CTC: 8 LPA, Stipend: 25k/month Location: Hyderabad Key Responsibilities as FTE: • Develop high-quality software design and architecture. • Identify, prioritize, and execute tasks in the software development lifecycle. • Develop tools and applications by producing clean, efficient code. • Automate tasks through appropriate tools and scripting. • Review and debug code • Perform validation and verification testing. • Collaborate with internal teams and stakeholders to fix and improve products. • Document development phases and monitor systems. • Ensure software is up to date with the latest technologies Requirements: • Good coding skills on Core Java and knowledge of OOPs, DBMS/SQL, Version Control Systems, Design Principles, Software Quality Engineering fundamentals • Problem Solving: Able to identify and solve complex problems in a structured manner, using Java. Strong fundamentals and deep practical knowledge of DSA preferred. • Possesses growth mindset and exhibits himself/herself as a motivated and organized self- learner and self-driven individual, and who can learn new programming language(s) and technologies when required. • Good verbal and written communication skills • Adaptability to fast-paced environments. • Should be a good team player • Commitment to ethical behaviour and integrity • BE / B. Tech in CS / IS / IT Engineering and MCA – 2025 graduated batch with 70% overall. • Open to work at any of the EPAM locations post Internship. Benefits: • Salary – Internship – 25,000 per month and Full Time – 8 LPA • Customizable insurance coverage • Professional development opportunities • Paid leave for maternity, paternity & bereavement • Retirement benefits like VPF and NPS • Digital meal cards • Hobby Clubs • Company's Social Events Selection Process: Round 1: Online Test (Coding (DSA) 180 mins, Aptitude ques 30 mins) Round 2: Group Discussion Round 3: Technical Interview - 2 rounds. Round 4: HR Interview Eligibility Criteria: BE / B. Tech in CS / IS / IT Engineering and MCA – 2026 Minimum 70% (X, XII, and Graduation) No Live Backlog",
        "Keys": [
            {
                "key": "role",
                "value": "SDE (Intern + FTE)"
            },
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IS"
            },
            {
                "key": "branch_3",
                "value": "IT Engineering"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Sagacious IP",
        "description": "Sagacious IP About Sagacious IP: Sagacious IP is a global leader in Intellectual Property (IP) solutions, providing technical research and consulting services primarily focused on patents. We work with a diverse range of clients, including Fortune 500 companies, start- ups, international law firms, and corporate legal departments. Our expertise spans multiple domains, such as Biotech, Pharma, Mechanical, Electronics, and Telecom. Our headquarters are located in Gurugram (Delhi NCR), where we are currently hiring. Job Role: Patent Analyst CTC: 5.5 LPA, Stipend: 18k/month Job Location: Gurugram Eligibility Criteria: Min. 65% or above in 10th, 12th & Graduation No Live Backlog Candidates will be required to sign a 12-month employment bond upon joining. Role: • Understanding the technology, product, or the invention. Discuss the same with the • seniors & the internal team. If required, discuss the invention with the inventors/researchers/patent lawyers/client over the conference call or in-person meeting to calibrate or to get more details. • Performing various patent searches - prior art search, novelty search, patentability • search, patent portfolio, patent landscaping, validity searches, sequence searches, • structure searches etc. • Conduct comprehensive searches of technical and patent information using online • database and other information resources. • Analyze and summarize search results • Provide insightful evaluation and analysis of results. • Preparing final reports and deliverables as per required standards • Deliver timely, value-added patent search reports. • Discuss the finding/results with the inventor/client over the conference call. • Helping the inventor/client to secure a patent or else, helping them to design-around • the product or the invention. Compensation and Employment Details: • Fixed CTC: INR 550,000 per annum upon successful completion of the 6-month training period at Sagacious IP and B.Tech degree. • Internship Stipend: INR 18,000 per month. The internship period may be extended by 1 month if performance is not satisfactory. • Bond: Candidates will be required to sign a 12-month employment bond upon joining. • Training Period: During this period, the intern's performance will be evaluated to confirm their role as a Patent Analyst. Mandatory Skills: Good analytical skills Good Technical Knowledge Good Interpersonal skill",
        "Keys": [
            {
                "key": "role",
                "value": "Patent Analyst"
            },
            {
                "key": "ctc",
                "value": 5.5
            },
            {
                "key": "stipend",
                "value": 18
            },
            {
                "key": "location_1",
                "value": "Gurugram"
            },
            {
                "key": "percent",
                "value": 65
            }
        ]
    },
    {
        "Name": "Kickdrum",
        "description": "KickdrumJob Role: Software DeveloperCTC: 16LPA [Rs.10 LPA (Fixed) + 2 LPA (Variable) + 2 LPA (Benefits, retirals) + 2 LPA (Special bonus payable postcompletion of one year of full-time employment)]Stipend: 35kLocation: BengaluruPosition: Software Intern (KDU-er)• Work Location: Bengaluru (Monday - Friday in Office)• Eligibility Criteria: 80% and above in academics throughout. No backlogs.• Facilities: Food and Snacks in Office; 24x7 access• Leaves: 3 Paid & 3 Sick Leaves; Leaves for University Exams• BYOD: ₹ 2000/month for using your own device during InternshipPosition: Software Developer• Job Location: Bengaluru, 2 mandatory days in Office,• Eligibility Criteria: Successful completion of the 6 month Internship• Benefits: in-office meals, reimbursements for food orders, cab rides, and gym memberships. Health insurancefor self, family, and parents, BYOD (Bring Your Own Device) options, annual health checkups, wellnessprograms, mentorship, and training.• Paid Leaves: 12 sick leaves, 15 earned leaves, and 10 public holidays.Roles and Responsibilities:• Develop complex web applications with responsive design techniques and industry-leading UX• Translate design mock-ups and prototypes into working applications• Work on cloud-based architectures that are highly scalable, available, and performant• Work with agile methodology using cutting-edge DevOps tools & technologies• Focus on code quality and deliver projects with high business impactLearn and apply new skills during your 6 months internship:• Amazon Web Services (AWS)• HTML/CSS/React (frontend)• Java/Spring, DotNet, Python, Node (backend)• Enterprise-grade software development• Working directly with execs and customersUpon successful completion of your internship you will be employed as a “Software Developer” at Kickdrum.Selection Process:Round 1: Online Assessment (2 Coding Que) 2HRsRound 2: Technical Interview IRound 3: Culture RoundRound 4: HR InterviewEligibility: CS/IT group with 80% and above in their academics throughout.No backlogs.",
        "Keys": [
            {
                "key": "ctc",
                "value": 16
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "cgpa",
                "value": 8
            },
            {
                "key": "branch_1",
                "value": "CS/IT group"
            }
        ]
    },
    {
        "Name": "HSBC",
        "description": "HSBCJob Role: Software Development EngineerCTC: 9 LPAInterview Location: PuneJob Location: Pune / Hyderabad / Bangalore, subject to business requirements.Role:• Strong foundation in software development engineering, with proficiency in at least one object- orientedprogramming language such as Java, Python, etc.• Various OS like Android, Linux, and Databases like relational and no-SQL.• Liaising with business users, architects and other stakeholders in designing, implementing and maintainingbest-in-class (scalable, loosely coupled and efficient) solutions which can run seamlessly acrossplatforms/mobile/internet/cloud.• Continuous Integration (CI)/ Continuous Deployment (CD) pipeline and Agile methodology.• Any of Mobile, Analytics, Cloud and Digital technology domains.• Ability to design and implement solutions which can run on-prem, hybrid and multi-cloud ecosystems such asGCP, AWS, Azure, Ali Cloud.• Ability to harness open-source development thus leveraging collective wisdom and learning• Understanding of cyber threats/ vulnerabilities and applying secure coding standards and associated protocols.• Ability to leverage industry best integration patterns and practices to integrate multiple existing/ new buildingblocks for seamless end-to-end customer experience.• Developing, maintaining, and supporting current systems for better efficacy and higher availability.Selection Process:Round 1: Aptitude + Technical (75 Minutes) & Coding assessment (30 Minutes)Only the students who clear the Aptitude + Technical assessment, will be able to appear for the coding test.Round 2: Technical Interview (Pune)Round 3: HR InterviewEligibility Criteria:Min. 60% or 6.00 CGPA throughout (10th / 12th / Diploma / B.E. / B.Tech), No Live Backlog.",
        "Keys": [
            {
                "key": "role",
                "value": "Software Development Engineer"
            },
            {
                "key": "ctc",
                "value": 9
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "cgpa",
                "value": 6
            }
        ]
    },
    {
        "Name": "Nvidia",
        "description": "NvidiaJob Role: QA Tool and Test Development Intern.Stipend : 40kLocation : Pune, Bangalore, HyderabadWhat you will be doing:• The intern will help us build tools/utility /frameworks in C/C#/C++ that would automate and accelerate testingworkÆows in the Åelds of Autonomous Vehicles, Robotics, 3D Simulation Platforms, GPU drivers, CloudComputing and AI.• As a QA Tools and Test Development Intern at NVIDIA, you will collaborate with a team of talentedengineers tackling some of the most complex challenges in cutting-edge technology. Mentored by the bestminds in the industry, they will have the opportunity to make meaningful contributions to exciting and impactfulprojects.What we need to see:• Pursuing a graduate engineering course in Computer Science/ IT with strong academics.• Good Communication skills (interpersonal and across teams).• Excellent analytical and problem-solving skills.• Very organized, proactive, and has good learning ability.• Languages - C++/C#/.Net/Python• Ability to apply Object Oriented Programming concepts and Data structures knowledge Knowledge ofSQL/NoSQL Database management tools• Ability to build applications using Generative AI APIs would be a plus• Would be a plus to have hands-on experience in development of Web Application (ASP.Net, MVC, webservices).Skills to be Assessed :C++, C# Programming, Python, Linux, OOPS, DS, AI/ML/DL/Gen AI.Selection Process:Round 1: Online Assessment (Technical and Logic ques on HackerRank)Programming: Questions on C, VHDL, and Verilog programmingComputer architecture: Questions on finite state machines, flip flop timing, and low power designData compression: Questions on data compression and binary representations.Circuit design: Questions on circuit design using half/full adders.Clocks: Questions on clocks.Round 2: Technical InterviewRound 3: HR InterviewEligibility Criteria:Min 80% in overall academics (10th, 12th, Graduation). CS/IT group only.No Live Backlog.",
        "Keys": [
            {
                "key": "role",
                "value": "QA Tool and Test Development Intern"
            },
            {
                "key": "stipend",
                "value": 40
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Bangalore"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            }
        ]
    },
    {
        "Name": "Carrier",
        "description": "CarrierJob Role: Software DeveloperCTC: 8 LPA - 12 LPAWhat you'll be doing:Industrial IoT – Managing Carrier Products Using AWS IoT:This module emphasizes the use of AWS IoT services to monitor, manage, andoptimize industrial products and processes.Application of AI in the HVAC Industry:Al for Business Process Improvement:This module explores trends in the HVAC industry, particularly in aftermarketservices, highlighting the relevance of IoT connectivity and AI applications fordriving innovation in this space.This module demonstrates how AI can be leveragedto enhance business processes and measure thequantifiable impact on overall efficiency.Selection Process:Round 1: Online Test - 2 hrs(2 coding ques, MCQ Aptitude)Round 2: Training & AssignmentsRound 3: InterviewsEligibility Criteria:• Final-year engineering students pursuing a degree in Computer Science, InformationTechnology, or related fields.• Minimum CGPA of 7.5 (or equivalent academic performance).• No active backlogs at the time of application.",
        "Keys": [
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "ctc_min",
                "value": 8
            },
            {
                "key": "ctc_max",
                "value": 12
            },
            {
                "key": "cgpa",
                "value": 7.5
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "Information Technology"
            }
        ]
    },
    {
        "Name": "Planful",
        "description": "PlanfulJob Role: Graduate Engineer TraineeCTC: 8.72 LPA, Stipend: 25k/monthLocation: HyderabadRole:• Analyze stories, specifications, and requirements to create Use cases and test scenarios.• Prepare test cases and scripts to meet project deliverables.• Report and track defects and problems that arise during software testing.• Participate in development sprints and daily scrum.• Develop and implement scripts for automated testing.• Collaborate with Product Management to ensure requirements are user-centered and testable.• Collaborate with Development to ensure designs are user-centered and testable.• Will be working in Software Development including Java/C# with Strong Problem-Solving Skills, objectoriented design, data structures, algorithm, Design, and complexity analysis.• Understanding modern web development technologies and techniques, including AJAX, HTML5, JavaScript,jQuery, CSS, Responsive Design, web services, NoSQL databases.Selection Rounds:1. Online Coding Test2. Technical Round 13. Technical Round 24. HR/Final SelectionSkills Requirements:OOPSProblem-SolvingLogical ReasoningAlgorithms, Sorting arraysDatabases, Data StructureCoding, SQL Queries & JavaScriptSelenium web driver, Java, C/C#Eligibility Criteria:Percentage: 70% throughout academics 10th/12th/GraduationNo Active BacklogNote: Internship to full time conversion of students will be purely based on the individual performance and opportunityavailable with us at that point in time.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 8.72
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "Fendahl",
        "description": "Fendahl:Domain: Software company in CTRM/ETRM DomainDesignation: Trainee Software EngineerCTC: 7.5 LPA (Gross CTC- 5.25 LPA + 2.25 lacs retention bonus).Location: NagpurRequirement:• Candidates should be good in programming and aptitude• No special programming language training needed, however candidates knowing C# / Dot Net would bepreferred.• Candidates should be ready to work from Nagpur location.Selection Process:Round 1: Resume shortlisting.Round 2: Online InCampus Assessment (Aptitude + Programming).Round 3: Written Coding Test. (InCampus)Round 4: Technical Interview I (InCampus)Round 5: Technical Interview II (Company Premises)Round 6: HR Interview (Company Premises)Eligibility:CS/IT group, ECE, ENMin. 60% 10th, 12th & Graduation",
        "Keys": [
            {
                "key": "role",
                "value": "Trainee Software Engineer"
            },
            {
                "key": "ctc",
                "value": 7.5
            },
            {
                "key": "location_1",
                "value": "Nagpur"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "CS/IT group"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "PubMatic",
        "description": "PubMaticPubMatic is hiring candidates who can design and implement next-generation highly scalable, distributed, andlow-latency applications. If you get excited building applications and architecture to handle 100's billions of requestsper day, managing millions of requests per second with a creative and fast-paced work environment, competitive pay,great incentives, a culture of teamwork, smart and friendly colleagues, and plenty of opportunity to grow in your careerthen you should consider applying for this position.Job Role: Graduate Engineer TraineeCTC: 11.6 LPARequirements:• Excellent Problem solving and analytical skills.• Knowledge of Operating Systems concepts• Ability to code using any programming language, viz. C, Java, Scala.• Good understanding of data structures and algorithms.• Knowledge of SQL and databases.• Good fundamental understanding of software engineering.• Ability to communicate thoughts appropriately.• Preferences in the skills - Java, C, Javascript, Golang.Selection Process:Round 1: Online Test: 90 minutesRound 2: Technical Interviews - 2 rounds (Pune)Round 3: HR Interview",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 11.6
            },
            {
                "key": "location_1",
                "value": "Pune"
            }
        ]
    },
    {
        "Name": "Trimble",
        "description": "Trimble:Job Role: Graduate Technical Interns (opportunities in Construction, Transportation, Agriculture and Geospatialdomains).CTC: 7 LPAStipend: 21.5k (Upon successful completion of the internship, FullTime will be offered).Job PurposeDesign and Develop Software solutions to meet the functional requirements of innovative products (pertaining toMobile/Cloud/Desktop and various domains) developed by Trimble divisions. Make use of well-established designpatterns and architectures that suit the mobile platform and follow agile development processes. Perform unit testing ofthe code developed, develop unit test cases and test harness. Perform system integration and bug fixing, develop userdocumentation, generation of relevant reports and review similar work done by peers.Main Responsibilities:• Read and understand high-level product description or requirement documents and propose one or moresoftware designs at the module level that are highly reusable and subject to the design principles of thesoftware's target host platform.• Decompose design elements into the structured code as per prevailing coding guidelines, preparation andexecution of unit test cases, and development of test codes or test harnesses. Trace back through code, design,and resolve issues and bugs.• Document work, software designs, code and record and produce test reports and release notes• Plan, organize, and execute assignments with very little or moderate supervision, in an agile environment• Responsible for deliveries in the required deadlines. Deliveries may be modules, documentation, customerreleases, etc.• Coordinate with the team for the timely delivery of work products. Ensure the quality of work products byreviews.• Sub-Module level responsibility in large projects and Module (or component) level responsibility insmall/medium-sized projects and complete responsibility is small-sized projects, depending upon the complexityand decomposition.• Work with User Experience, and QA teams to ensure the validity of the solution.• Be contemporary by adopting technological and market evolutions.• Other responsibilities as assigned by the management from time to time.Skill sets:• Good understanding of operating systems principles, embedded systems, software architectures, softwarealgorithms, data structures, and software engineering principles.• Stronghold in OOAD and object-oriented programming language.• Experience in applications programming is preferred.• Good exposure to design, development, and debugging tools.• Knowledge of various Software Development Lifecycles.• Good analytical and problem-solving skills.• Excellent communication and interpersonal skills.• Upbeat, highly motivated, and self-starter.Qualifications & Experience:• Bachelors of Engineering.• A good score in any of the national level Olympiads or talent search examinations will be a value addition. Agood JEE score will be a big bonus.• Paper presentation in a national level forum, contribution to open source projects, and contribution tostandards bodies will be value addition.Eligibility Criteria:Min. 65% (Engg. and 10th, 12th, Diploma) and above marks in all semestersNo backlogs and no year gaps.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Technical Interns"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "stipend",
                "value": 21.5
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Engg."
            }
        ]
    },
    {
        "Name": "Yoptima",
        "description": "Eligibility:CS/IT group only.80% and above throughout (10th,12th,UG -until 6th Semester)No Live Backlog.YoptimaJob Role: Account ExecutiveCTC: 7 LPA, Stipend: 25k/monthLocation: Jui Nagar, Navi MumbaiPost-Internship Opportunity: After successfully completing the internship and a thorough assessment, candidates willbe offered a permanent role with a total compensation of ₹7 Lakh CTC (₹5 Lakh Fixed + *2 Lakh Variable+ otherbenefits) for BTech graduates.Responsibilities:• Analyze digital behavior of the online consumers across different digital channels and design actionableinsights and solutions to improve marketing ROI at scale.• Work with large, complex data sets. Solve difficult, non-routine analysis problems, applying advancedanalytical methods as needed.• Assist in designing relevant marketing plans and strategies for digital ad campaigns, combining understandingof consumer behavior, data driven insights, product positioning and marketing objectives.• Troubleshoot technical issues both internally and with Third party vendors.• Manage servicing needs of clients and win sustainable customer delight and brand advocacy.Competencies:• 0-2 yrs Exp with Bachelor's or Master's degree in a quantitative discipline (e.g. business administration,engineering, statistics, operations research, economics, mathematics).• Strong analytical and problem-solving skills.• Ability to present results of complex analysis compellingly to both technical and non-technical audiences.• Self-motivated with the ability to work independently and within a team.Selection Process:Round1: 8D Online Assessment – A mandatory evaluation.Round 2: Shortlisted candidates from the assessment will go through 2-3 rounds of interviews with the Co-founders(COO & CEO).",
        "Keys": [
            {
                "key": "role",
                "value": "Account Executive"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Jui Nagar"
            },
            {
                "key": "location_2",
                "value": "Navi Mumbai"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS/IT group"
            }
        ]
    },
    {
        "Name": "Bluealtair",
        "description": "bluealtairBluealtairJob Role: Graduate Engineer TraineeCTC: 5 LPA, Stipend: 20k/month (Permanent placement - Post internship completion based on the performance).Location: PuneAbout us: Blue Altair is a successor company of Fresh Gravity.It is a niche, sleek, high-end consulting firm that is employee centric, client focused, partner tied, and innovation driven.Core capabilities at Blue Altair are:• API Management & Integration-o API Business Strategy with “API First” Approach,o API Program and Technical Strategy,o iPaaS Strategy, API Gateway Package Selection,o Deployment (on-premises, cloud, hybrid),o iPaaS based system integration)• Data Managemento Cloud Data Migration,o Smart Analyticso Master Data Management,o Data Platform Strategy and Roadmapo Data Platform Modernizationo Data Governance and Strategy Roadmap• Data Science and AIo Big Data Analytics,o Machine Learning & Artificial Intelligence,o Deep Learning, Supervised,o Unsupervised and Semi-Supervised Learning,o Explainable AI,o Computer Vision,o Natural Language Processing• Digital Application Developmento Full Stack Developmento Web and Mobile Developmento DevOpso MicroservicesSelection Process:Round 1: Online Programming Test (MCQS on Aptitude ques, OS, CN,DBMS, 2 ques Coding Ques)Round 2: Technical Interview 1",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 5
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "location_1",
                "value": "Pune"
            }
        ]
    },
    {
        "Name": "JSW",
        "description": "JSWJob Role: Graduate Engineer TraineeCTC: 6 LPA (Fixed + Variable)The CTC is INR 5.5 LPA - INR 4.67 LPA (Fixed) in addition to INR 83,000 (Variables)Retention Bonus - INR 1 lakh (End of Year 1 - 50% and End of Year 2 - 50%)Job Description:• Completing all tasks set by the Supervisor and assisting wherever possible.• Observing existing strategies and techniques and offering suggestions for improvement.• Conducting research and collating data.• Traveling to different sites and gaining practical experience in new work zones.• Working closely with staff to foster professional values and build good relationships.• Observing health and safety guidelines at all times.• Attending meetings and workshops.• Submitting to all forms of evaluation during the traineeship.• Compiling reports and delivering presentations to staff members and other stakeholders.Selection Process:Round1: Online AssessmentRound 2: Online AssessmentRound 3: InterviewsEligibility Criteria:• Candidates should be open for any location pan India. no location preference will be considered. In casehe/she accepts the offer and then drops out because of the location constraint, then he/she will be blacklistedfrom the JSW group.• Branch: Mech, Indus, Civil• Candidate's age must be 24 years or less as of 1st April 2025.• Candidates must meet all the necessary fitness criteria. At any stage, the candidate must meet all necessaryfitness criteria.• No Live/Open Backlogs are allowed, In the case of Previous backlogs all should be cleared/closed beforeapplying. No lateral entry is allowed. No repeat year allowed.• The offer will be revoked if any information provided by the candidate at any stage stands incorrect.• No gap year is allowed between 10th, 12th, or any year of the Graduation Degree.• Min 60% and above throughout 10th, 12th and College.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Mech"
            },
            {
                "key": "branch_2",
                "value": "Indus"
            },
            {
                "key": "branch_3",
                "value": "Civil"
            }
        ]
    },
    {
        "Name": "GOCOMET",
        "description": "GOCOMET:Why GoComet?GoComet is a dynamic SaaS start-up that provides AI-powered transportation visibility solutions to revolutionize thetrillion-dollar logistics sector. At GoComet, we are revolutionizing the logistics sector one day at a time, and every teammember is committed to making it a reality. We're seeking individuals who embody our core values, character, andattitude. While we recognize that skills can be developed with the right mindset and learnability, we prioritize thosewho share our philosophy. Our recruitment processes reflect this belief. Look no further if you're looking for a diverse,talented, and vibrant workplace that recognizes and rewards hard work. We're ambitious, fast-paced, and unafraid toexperiment, fail, learn, and ultimately succeed. This is us! Join our team if you share our culture and values. We're an",
        "Keys": []
    },
    {
        "Name": "CLOUD4C",
        "description": "• The ability to communicate complex procedures to other colleagues Skills Required: • Masters/Bachelors degree in Computer Science & IT • Good written and verbal communication skills • Understanding of the Software development lifecycle • Good Analytical and problem solving skills • Self-motivated with the ability to prioritize, meet deadlines, and manage changing priorities Benefits: • We don't track these hours you put in or ask you to fill time sheets. We don't believe in micromanaging, if you're struggling, ask for help. If someone else is, offer some support. • We never mind if people make mistakes or screw up in any way, and offer full encouragement to help people learn fast by failing fast. • We always encourage people to be completely candid, raise alarms, or log complaints anonymously in our feedback tool, no matter how harsh. • We are a 'Work from Anywhere' company, since passionate, driven people can work from anywhere they want; their homes, or cafes, or mountains, or beaches, anywhere. • We have a 15-day notice period. We want to build a place where people work willingly and passionately. CLOUD4C A CtrlS Company Cloud 4C Job Title: Associate Engineer (Civil Engineer, Electrical Engineer, Mechanical Engineer) CTC: Ranging from 4 Lakhs to 6 Lakhs Grade: L0 - Associate Engineer Location: Mumbai, Hyderabad, Bangalore, Noida Service Level Agreement: 2 Years Roles and Responsibilities: We are seeking a Graduate Civil Engineer to join our multi-disciplinary Data Centre design teams to work on a Data Centre projects, mainly covering Data Centre's/Mission Critical projects, with leading architects and clients both in India and overseas. We arelooking for a candidate who will fit in with our dynamic teams in a progressive, design- led environment with the successful candidate becoming a contributor to the excellent atmosphere which exists within the group. • Undertaking structural + interior design for DC projects of varying scales. • Knowledge of data center projects and its latest trend for cost-effective design. • Preparation of drawings in Revit and CAD software. A good knowledge of Revit and CAD will be preferable. • Good knowledge of STADD software for structural design. • Preparation of bill of material for the structural and interior design. • Good knowledge of different structural design including the combination of MS and RCC. • Civil design knowledge for the following - Design of structural frame for high rise buildings with high floor loading. Design of Flat Slab structure. Design of Campsite structure - Knowledge of latest construction mythology andmaterials. Knowledge of various basic interior finishes material. • Working closely with Architects/Consultants and other in-house design engineers. • Production of engineering drawings. Preparing and coordinating mechanical reports and specifications. • Knowledge of Uptime and TIA standards for data centers design. • Design and coordinating work with engineers of other disciplines. • Attending meetings and communicating with clients to establish their needs. • Working with the project team to ensure production of deliverables to agreed timelines and within budget. • Sharing technical knowledge with the members of the team. • Up to date knowledge of the latest trend in the civil discipline in particular relation to the Data Centers design. • Preparation of financial analysis for the various design of DC projects. • Supporting procuring work with the best available products in the market. • Responsible and accountable for maintaining client relations. Requirements: • Degree qualified in Civil Engineering. • Extensive knowledge in the field of civil design and the latest trends. • Be able to design and deliver structural solutions for mission-critical projects. • The ability to work under pressure and meet strict deadlines is essential. • Excellent planning and organization skills. • Excellent communications skills (both written and verbal). • Able to demonstrate strong commercial acumen. Eligibility Criteria: • Very Good Communication Skills • 75% aggregate in all academics (SSC/Xth, Inter/ XIIth, & B.Tech. / BE (Overall 75%) • EAMCET Rank < 30,000 / ECET Rank < 3,000 / IIT Mains Rank < 10,000 / State Level Common Engg. Entrance Exam Rank < 20000 or >60% Percentile.",
        "Keys": [
            {
                "key": "role",
                "value": "Associate Engineer (Civil Engineer, Electrical Engineer, Mechanical Engineer)"
            },
            {
                "key": "ctc_min",
                "value": 4
            },
            {
                "key": "ctc_max",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "Civil Engineer"
            },
            {
                "key": "branch_2",
                "value": "Electrical Engineer"
            },
            {
                "key": "branch_3",
                "value": "Mechanical Engineer"
            },
            {
                "key": "percent",
                "value": 75
            }
        ]
    },
    {
        "Name": "TravClan",
        "description": "TravClan TravClan About TravClan: We are a B2B Travel Tech startup that is reshaping the way travel agents sell and deliver exceptional travel experiences worldwide. We enable travel agents to book flights, hotels & holidays conveniently and we provide comprehensive end- to-end on-ground travel services. We do over INR 1000 crore+ GMV (sales) and are growing rapidly. Our strong business model and focus on delivering excellent customer experience has facilitated our sustainable growth funded by internal cashflows. To fuel innovation and growth, we have raised USD 5.5mn+ funds from marquee global investors! Compensation: INR 5.4 Lacs per annum (4.2 LPA-Fixed, 0.6 LPA-Variable, 0.6 LPA-Retention Bonus) Location: Connaught Place, New Delhi Job roles: 1. Business Development Associate 2. Relationship Manager 3. Operations Associate (Rotational Day and Night Shift) 4. Finance Associate Roles and Responsibilities: • Sole point of contact in building and managing a highly engaged community of business entrepreneurs/ agents Educating members about TravClan and managing 100- 200 business accounts Working in close interface with the finance, product and • marketing team to build better processes, products and reach, respectively • Healthy retention of agents while growing the volume of agent's business through TravClan • Ensuring customer delight while managing Agent's grievances related to payments, services, products etc. • Effectively managing feedback and escalations from the business partners. • Hosting country wide offline and online events & meet ups of members from time to time Hiring Process: 1. Aptitude Test & Group Discussion: A basic 50-minute eliminatory aptitude test 30-minute group discussion held separately 2. Personal Interviews: 2-3 detailed interviews + detailed discussions about the job profile Eligibility: 1. Business Development Associate - Freshers, any course 2. Relationship Manager-Freshers, any course 3. Operations Associate (Rotational Day and Night Shift)- Freshers, any course 4. Finance Associate - Freshers, BBA/Bcom/Bcom hons/BMS/BFIA",
        "Keys": [
            {
                "key": "ctc",
                "value": 5.4
            },
            {
                "key": "location_1",
                "value": "New Delhi"
            },
            {
                "key": "role",
                "value": "Business Development Associate"
            },
            {
                "key": "branch_1",
                "value": "BBA"
            }
        ]
    },
    {
        "Name": "Tata Technologies",
        "description": "TATA TATA TECHNOLOGIES Tata Technologies Job Role: Graduate Engineer Trainee – CS/IT Compensation: 4.65 LPA Eligibility Criteria: • BE/B.Tech in Mechanical, Electronics & Electrical • A minimum academic score of 60% throughout the candidate's academic career. • No active backlogs allowed. • No year drop or academic gap is permitted. • Only a one-year preparation gap is considered.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee – CS/IT"
            },
            {
                "key": "ctc",
                "value": 4.65
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            },
            {
                "key": "branch_2",
                "value": "Electronics"
            },
            {
                "key": "branch_3",
                "value": "Electrical"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    },
    {
        "Name": "Tata Technologies",
        "description": "Area of Responsibility: • Have knowledge of programming languages, program design and development procedures • Have the ability to design, develop and troubleshoot moderate to complex software applications • Get associated in development, testing, support of existing/new software applications and solutions • Be keen to cultivate strong working relationships with co-workers • Have an innovative approach, learnability excellent problem-solving skills, effective articulation, and should be a genuine team player • Believe in continuous learning and should be flexible to work on any phase of SDLC Job Role: Graduate Engineer Trainee – Mechanical, Electronics and Electrical Compensation: Base Salary: 4.5 LPA + Insurance and Additional Trainee Bonus: 50,000 INR per annum for the first two years Service Agreement: 2 years. Eligibility Criteria: • BE/B.Tech in Mechanical, Electronics & Electrical • A minimum academic score of 60% throughout the candidate's academic career. • No active backlogs allowed. • No year drop or academic gap is permitted. • Only a one-year preparation gap is considered. Job Location: Pan India Selection Process: • Aptitude Test • Technical Interview • HR Round Scope of Role: The Graduate Engineer Trainee is responsible for applying their Engineering skills learnt in academics, alongside quickly learning the CAD/CAE/Manufacturing feasibility tools to practitioner level &amp; also learning TTL customer + Industry practices &amp; start delivering to project requirements in the shortest period after onboarding.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee – Mechanical, Electronics and Electrical"
            },
            {
                "key": "ctc",
                "value": 4.5
            },
            {
                "key": "location_1",
                "value": "Pan India"
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            },
            {
                "key": "branch_2",
                "value": "Electronics"
            },
            {
                "key": "branch_3",
                "value": "Electrical"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    },
    {
        "Name": "Tata Asset Management Ltd.",
        "description": "Functional Area: Sales Job Role: Management Trainee Compensation: Fixed CTC : 5.00 LPA + 50K Assured Bonus Location: Delhi, Pune, Nagpur, Chandigarh, Jaipur Key Working Relationships: Part of the sales team at the branches Job Summary: Key responsibilities will be to meet assigned sales targets, through distributor engagement and activation. The goal is to enhance Tata Mutual Fund's visibility in the marketplace. Qualification: MBA in Marketing/ Finance is preferred Experience: Preferably 0 to 2 years of prior relevant work experience in BFSI sector. Key Responsibilities: • Achievement of Gross Sales, Net Sales and SIP targets assigned in allotted geographic territory across Mutual Funds, PMS and AIF. • Activate distribution partners and increase productivity in terms of no. of applications and volume. • Identify prospective distribution partners (IFAs) and empanel them for selling the products of the AMC, this should also apply to new ARNs entering the market every month. • Engage with the mapped relationships as per coverage plan, to build strong relationship and recall for the brand. • Adhere to the defined sales process and reporting requirements. • Use internal and external data for sharper focus and market intelligence. • Read and update knowledge on regular basis to be able to articulate the fund house views and positioning of the product. • Liaise with sales-support, investor services and other internal departments, and to ensure timely and quality response to distributors for various requirements. • Responsibilities would also include the day-to-day management of internal office work/back office and timely MIS. • Ensures that external communications that go from the sales team is factually correct and in compliance with internal procedures and meets all regulatory compliance requirements. • Represents the company in the allotted area and will strive to ensure that the company's image is always upheld and projected in the appropriate manner. • Any other Job as assigned by the management from time to time",
        "Keys": [
            {
                "key": "role",
                "value": "Management Trainee"
            },
            {
                "key": "ctc",
                "value": 5
            },
            {
                "key": "location_1",
                "value": "Delhi"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "branch_1",
                "value": "MBA Marketing"
            },
            {
                "key": "branch_2",
                "value": "MBA Finance"
            }
        ]
    },
    {
        "Name": "Tata Hitachi Construction Machinery Company Private Limited",
        "description": "TATA HITACHI Tata Hitachi Construction Machinery Company Private Limited Job Role: Graduate Engineer Trainee – Mechanical Eligibility criteria are as follows : 1. First class marks from the 10th standard onwards and each year of the engineering course (i.e., marks of Sem 1 + Sem 2 >= First Class). 2. All subjects in the engineering course should be cleared in the first attempt. 3. The candidate should have a continuous career throughout from the 10th standard onwards i.e. there should not be any gap of a year in the academic curriculum. [This is relaxable by a year between the 12th std board exam and the first year of the engineering course.] 4. Students who have completed their diploma and then gone on to do their graduation by taking admission in the second year of the engineering course are eligible for the cadre.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee – Mechanical"
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            }
        ]
    },
    {
        "Name": "Blue Star India Limited",
        "description": "BLUE STAR Blue Star India Limited Job Role: Graduate Engineer Trainee, Diploma Engineer Trainee and MBA Location: Maharashtra Remuneration : • Graduate Engineer Trainee INR 525000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable. • Diploma Engineer Trainee INR 350000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable. • MBA: INR 642000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable Pre-requisites - (minimum selection requirements)- • Graduate Engineer Trainee(Mechanical/Electrical): 1. Full- Time Graduate (Bachelor's Degree) 2. Secured at least 60% marks or equivalent grade in academics (10th,12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. • Diploma Engineer Trainee: 1. Secured at least 60% marks or equivalent grade in academics (10th, 12th). 2. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. • MBA: 1. Full-Time MBA 2. Secured at least 60% marks or equivalent grade in academics (10th, 12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. Role Offered: GET (Mechanical/Electrical): 1. To ensure the project requirements are met as per the plan. 2. Verification of design with all required schemes. 3. Regular interaction with stakeholders for implementation of technical requirements. 4. Application of value engineering for project completion at optimum cost. 5. Identify design lacuna and suggest corrections. DET(Mechanical/Electricals): 1. Ensure quality of installation at MEP Project Sites. 2. Effectively mobilize available resources and strive for on time project completion. 3. Implement and maintain safe work practices at project sites. 4. Ensure smooth handing-over of projects, with all relevant documents. 5. Ensure adherence to statutory compliance and achieve over all customer satisfaction. MBA(Sales & Marketing): 1. Achieve sales targets with adherence to TOP (Terms of Payments)",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "location_1",
                "value": "Maharashtra"
            },
            {
                "key": "ctc_min",
                "value": 3.5
            },
            {
                "key": "ctc_max",
                "value": 6.42
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            },
            {
                "key": "branch_2",
                "value": "Electrical"
            },
            {
                "key": "branch_3",
                "value": "MBA Sales"
            },
            {
                "key": "branch_4",
                "value": "MBA Marketing"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    },
    {
        "Name": "Amadeus",
        "description": "At Amadeus, fresh graduates bring new perspectives and are seen as key contributors to the organization's technical and leadership growth. With Amadeus processing millions of transactions daily, system reliability and performance are critical. We ensure customer satisfaction by delivering on their needs effectively. Fresh graduates are absorbed into various divisions based on their skills and interview evaluations. To prepare them, all graduate engineers undergo an intensive 6–8 week training program, equipping them with the technical skills required for their roles. Designation: Software Engineer CTC: 12,62,218/- Location: Bangalore/Pune Skill set 1: Java/J2EE A Java/J2EE developer is primarily a Back-end developer at Amadeus. You will be working on high volume production systems for the development and maintenance of Booking Engine which is a single set of code across a range of Amadeus E-Commerce products. This code is very critical because a slight error might block the airlines/travel agents for processing the booking or ticketing. A Software developer is involved in many activities like: • Define user requirements for development or improvement of software solutions • Design technical solutions and perform feasibility studies • Innovate: Think out of the box and practice innovation in his/her daily tasks. Propose and develop innovative solutions to the problems. • Propose viable technical solutions to Product Management and users for validation • Conduct unit, package and performance tests of the software and ensure a level of quality • Design and implement databases as necessary • Produce software documentation for the application and issue it • Support the end user in the Production phase by debugging existing software • solutions in response to Problem Tracking Records and Change Requests issued from • Product Management or Product Definition Main technical expertise on which the candidate will be trained on: • Core Java with J2EE experience • JUnits, Design Patterns, Struts, Spring MVC or any other framework • JSPs, Servlets, EJBs, DB, XML, WebServices etc. WebLogic, Ant/Maven Skill set 2: Java/UI A UI developer works on a presentation layer which is the layer mostly exposed to the customer. The more sturdy and intuitive it is; the more satisfied our customer is. The skills which a candidate develops are very niche and give them a clear advantage over other technical profiles. An engineer who can think UI and brings in innovation in his daily work. A very demanding position with skill set varying: • JQuery/ExtJS/YUI/DOJO or a similar JS framework • DataBase, ClearCase, WebLogic, Ant/Maven etc • JavaScript, OOJS CSS, HTML, AJAX, DOM, JSPs etc • Core Java/ J2EE experience is desirable Skill set 3: C/C++ There are multiple work streams in Amadeus Labs, Bangalore who are focusing on core work areas where we need expert C/C++ developers. A Software developer is involved in many activities like: • Define user requirements for development or improvement of software solutions • Design technical solutions and perform feasibility studies • Innovate: Think out of the box and practice innovation in his/her daily tasks. Propose and develop innovative solutions to the problems. • Propose viable technical solutions to Product Management and users for validation • Conduct unit, package and performance tests of the software and ensure a level of quality • Design and implement databases as necessary • Produce software documentation for the application and issue it • Support the end user in the Production phase by debugging existing software • solutions in response to Problem Tracking Records and Change Requests issued from • Product Management or Product Definition Technical/Technical Skills • UNIX/ Linux, shell scripting • Strong knowledge of OOPS and coding with C++, design-patterns. • Database modeling, Oracle, Oracle BI, optimization techniques. • Good knowledge of development of a distributed system and of distributed • algorithms • Experience of Oracle environment and optimization techniques is a plus • Experience in multithreaded programming is a plus Skill Set 4 :Dev Ops The DevOps engineer plays a key role to implement and support innovative solutions for operational requirements. The scope of the role will encompass process automation solutions for the highly demanding Amadeus operational business domain. The DevOps Engineer will be involved in activities like • Building DevOps CI/CD pipeline using relevant tools • Experience with systems and IT operations • Performing frequent, incremental code testing and deployment • Build various version of scripts/codes and release them on time, maintain source repositories, different branches • Monitor the application, quickly resolve if any issue on production environments • Involve in Release Management, Source code management, Software configuration • management. Technical aspects on which you will gain expertise- • Ability to use and adapt a variety of open source technologies and tools (Puppet, Ansible, IAAS, • PAAS, Kubernetes) • Ability to code Hadoop related code as map/reduce • Ability to code and script (java, C++, php, python, perl, Ruby...) • Linux servers, Cloudera's Hadoop distribution (CDH),Bash or Python scripting • Automated configuration tools: Ansible, Puppet • Enterprise Linux(RHEL) family of distributions • Continues Integration/Deployment tool: Jenkins, Visual Studio team services (VSTS by • Microsoft) • Version Control tool – GIT • Scripting Language: Python, Perl, Shell • Cloud Server: Microsoft Azure, Amazon- AWS, Google Cloud Selection Process(In Campus): - Round 1:Pre-placement Talk Round 2:Hackerrank Technical Test (NodeJs, js. Ruby, Networking, Cloud, Java, React, OOPs) 90 mins Round 3: Aptitude Test (Logical Reasoning and Data Interpretation and English Comprehension) Test 60 mins Round 4: Technical Interview. Round 5: HR Interview Eligibility: B.Tech CS/IT group & ECE 80% and above throughout the academic journey (10th, 12th, CGPA) No live backlog.",
        "Keys": [
            {
                "key": "ctc",
                "value": 12.62218
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "role",
                "value": "Software Engineer"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "ECE"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "cgpa",
                "value": 80
            }
        ]
    },
    {
        "Name": "GlobalLogic",
        "description": "GlobalLogic, a Hitachi Group Company, is a leader in digital product engineering. We help our clients design and build innovative products, platforms, and digital experiences for the modern world. By integrating our strategic design, complex engineering, and vertical industry expertise with Hitachi's Operating Technology and Information Technology capabilities, we help our clients imagine what's possible and accelerate their transition into tomorrow's digital businesses. Headquartered in Silicon Valley. In 2021, GlobalLogic was acquired by Hitachi Ltd. GlobalLogic's capabilities, combined with Hitachi's Lumada, enables us to deploy Hitachi's extensive library of digital solutions to the global market and to help customers and societies solve their issues through Agile application development in the cloud. CTC: 5.66 LPA Eligibility Criteria: Above 60 percent in Class X, XII, and Graduation No backlogs are allowed. A gap of up to one year is allowed. Domains: • GenAI • Java • .Net • Embed Selection Process: Round 1: Online Assessment (2Hr) Aptitude Round Query Correction (PostGreSQL) Query Writing (PostGreSQL) Coding Round Round 2: Technical Interview (30 mins) Round 3: Managerial Interview (40 - 60 mins) Round 3: HR & Result (30 mins) Evaluation Criteria - → Minimum of 60% throughout academic career Should be from CSE,ECE,IT,ETC,ISE,DSE,EEE,EE,E&I,AI/ML Should not have any backlogs Should be in the 5th or 6th semester only → For evaluation of students Technical Assessment - Students will be assessed on Coding and Programming, Problem solving skills, Logical reasoning, Computer Fundamentals, English Proficiency and Next-gen skills ◆ In-Person Technical Evaluation - Students will be interviewed on their existing skills and expertise and on newly acquired skills through IAP In-Person Managerial Round - Overall technical and cultural fit to be assessed during this round Behavioral Round - Behavioral aspects of the candidates to be assessed during this round along with explaining role designation/career path/ compensation/ general policies and addressing any other query the candidate might have.",
        "Keys": [
            {
                "key": "ctc",
                "value": 5.66
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "domains",
                "value": "GenAI, Java, .Net, Embed"
            },
            {
                "key": "branch_1",
                "value": "CSE"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "IT"
            },
            {
                "key": "branch_4",
                "value": "ETC"
            }
        ]
    },
    {
        "Name": "Bristlecone",
        "description": "Bristlecone is a leading provider of AI-powered application transformation services for the digital supply chain. Recognized as one of the Top 10 leaders in supply chain solutions, Bristlecone empowers customers with speed, visibility, automation, and resiliency to thrive in a dynamic environment. By combining industry focus, supply chain expertise, a consulting-driven approach, and proprietary accelerators, Bristlecone delivers unmatched business value. As part of the $20.7 billion Mahindra Group, Bristlecone fosters a high-performing culture that values innovation and offers excellent learning and growth opportunities. Role: Associate Engineer CTC: 4.25 LPA",
        "Keys": [
            {
                "key": "role",
                "value": "Associate Engineer"
            },
            {
                "key": "ctc",
                "value": 4.25
            }
        ]
    },
    {
        "Name": "Vconstruct",
        "description": "Building Better, Smarter, Faster is our mission. Since 2013, our 400+ experts have been transforming the construction industry with innovative solutions in Virtual Design and Construction (VDC), Project Controls, Accounting, and Software Development. Serving 100+ projects globally, we deliver smarter processes, better products, and faster results. Join us in reshaping the future of construction with technology. CTC: 6.75 LPA Stipend: 20k, join in January 2025 as Graduate Trainee and then full-time from June/July 2025 based on their performance. Job Roles: 1. Project Engineer – Virtual Builder Skills and Qualification: Candidates having B.E./ B.Tech. or higher Degree in Civil or Construction related field. • A Working knowledge of BIM Coordination, Project Management, Change Management And Constructability is preferable. • Understanding of the overall construction process ranging from Design to commissioning. • Working knowledge of any prominent VDC software like Revit,Navisworks, Tekla and Civil 3Dis desired. Work Location: Pune (Magarpatta City) Eligibility: Civil, Min 60% in 10th, 12th & Graduation, No Live Backlog. 2. Software Engineer – Software Solutions for Construction Requirements: Good knowledge of object-oriented design and development and DBMSconcepts Expert in HTML5, CSS3, JavaScript Excellent communication, presentation and analytical skills Should be willing to work collaboratively across different skill sets Working knowledge of at least one front-end framework (react/angular) and back-end stack Eligibility: B.E. Final year students from CS/IT, Min 70% or equivalent marks (10th, 12th Or Diploma and overall in graduation). 3. Data Science Engineer - DSA We are looking for candidates with passion for technology, excellent analytical skills, and ability to solve complex problems to undergo training in data Science related areas. Successful candidates will be part of the Data Science and Analytics team which is a tight-knit group of analysts and engineers that support all data aspects of DPR business. Requirements: B.E. / B.Tech Final year students with CS/IT background Excellent Academic Credentials Excellent Communication and Analytical skills Responsibilities: Post training, selected candidates will work in Data Science and Analytics. Candidates will be working mostly on US or EU based projects. They will transition into a data science engineer with the responsibilities outlined below - Understand and analyze the business requirements Design and deployment of the database - Ability to understand, consume and use API's, JSON, Web Services for data pipelines - Developing integrations between various applications Design, Develop and deploy reports/dashboards/data visualizations using Power BI - Optimize reports/dashboards with a focus on usability, performance, flexibility, testability, and standardization. - Build full stack data science models with various Azure technologies -Use R or Python to implement statistical models, machine learning, and analysis (Recommenders, Prediction, Classification, Clustering, etc.)",
        "Keys": [
            {
                "key": "ctc",
                "value": 6.75
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "role",
                "value": "Project Engineer - Virtual Builder, Software Engineer - Software Solutions for Construction, Data Science Engineer - DSA"
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "branch_2",
                "value": "CS"
            },
            {
                "key": "branch_3",
                "value": "IT"
            },
            {
                "key": "percent",
                "value": 70
            }
        ]
    },
    {
        "Name": "ZS",
        "description": "ZS Role: Platform Services Associate Analyst CTC: ₹19 LPA - ₹13 LPA Location: Pune What You'll Do: • Tech Stack: Python, Analyst, SQL, PowerBI, Tableau. • Build complex solutions for clients using tools and technologies on the ZAIDYN platform. • Take ownership of activities and responsibilities across all project lifecycle phases to solve business problems in one or more client engagements. • Apply development methodologies (e.g., agile, waterfall) and best practices (e.g., QA procedures, unit testing) to ensure successful and timely task completion. • Collaborate with team members to ensure seamless project delivery. • Exhibit flexibility in tackling new challenges and demonstrate excellent task management. • Assist in creating project outputs, including business case development, solution design, user requirements, prototypes, technical architecture (if needed), test cases, and operations management. • Provide transparency in driving tasks to completion and report accurate progress status. • Bring a consulting mindset, leveraging technical and business expertise to solve business problems and innovate. • Assist senior team members and delivery leads in project management responsibilities. What You'll Bring: • Qualification: Bachelor's degree in Computer Science, IT, or related disciplines with a strong academic record. • Additional Skills:",
        "Keys": [
            {
                "key": "role",
                "value": "Platform Services Associate Analyst"
            },
            {
                "key": "ctc_max",
                "value": 19
            },
            {
                "key": "ctc_min",
                "value": 13
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "Nutanix",
        "description": "NutanixNutanix is a global leader in cloud software and a pioneer in hyperconverged infrastructure solutions, makingcomputing invisible anywhere. Companies around the world use Nutanix software to leverage a single platform tomanage any app, at any location, at any scale for their private, hybrid and multi-cloud environments.CTC: 22 LPAStipend: 50k/monthJob Description: Systems Reliability Engineer (SRE) Role – InternThe Area: Escalation and Technical Support:We are ensuring the success of our ground breaking technology through cluster health monitoringand quick response time. We are top-notch engineers with the ability to handle all problems thatcome our way. Working closely with Sales and Software Engineers, the SRE team acts as ourcustomer's champions and has guaranteed that not a single box has been returned.We are ensuring the success of our ground - breaking technology through cluster healthmonitoring and quick response time. We are top-notch engineers with the ability to handle allproblems that come our way. Working closely with Sales and Software Engineers, the SRE teamacts as our customers' champions and has guaranteed that not a single box has been returned.• Provide world class support and be a champion for our customers. GO above and beyond tosupport their business and use Of the Nutanix stack.• Troubleshooting. debug and diagnose customer issues encountered post implementation. Worktowards identifying the root cause of the problem in order to resolve the issues permanently.• Define and lead changes to our product with our Development/Engineering team based onfeedback from customers and field implementations.• Improve serviceability of the product by testing new features and developing tools to scaleour field deployment and auto-support infrastructure.• Collaborate with various teams like Engineering, Account product management etc andensure timely resolution for our customers.• Develop and work on creating Content i.e., internal and external knowledge bases.• Work with technology partners (e.g., VMware, Citrix, Microsoft) to resolve issues and pushimprovements in our ecosystem.• Provide support on weekdays and Off hours on an as needed and scheduled rotational basis.Requirements:• Excellent verbal/written communication and analytical skills.• Customer centricity• The passion and ability to learn new things. while never being satisfied with the status quo.• Willingness to work in a fast-growing company with huge potential.Location: Bangalore / PuneSelection Process:Round 1: Resume Shortlisting - Based on ATS compatible Profile, AMCAT Test, GitHub, HackerRank, HackerEarthRound 2: Pre-Placement Talk for shortlisted students only, Know Your Company Round, Technology Domain / Quizabout Nutanix (most imp round)Round 3: HackerRank MCQ Test (Cloud, Networking, Linux) (2Hrs)Round 4: Interviews Tech 1Round 5: Interviews Tech 2Round 6: Managerial and Result",
        "Keys": [
            {
                "key": "ctc",
                "value": 22
            },
            {
                "key": "stipend",
                "value": 50000
            },
            {
                "key": "role",
                "value": "Systems Reliability Engineer (SRE) Role – Intern"
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "location_2",
                "value": "Pune"
            }
        ]
    },
    {
        "Name": "Cognizant",
        "description": "CognizantOne of the top professional services firms in the world, Cognizant transforms clients' economic, operating, andtechnological models for the digital age. Clients may design, create, and manage more creative and effective enterpriseswith the assistance of its unique industry-based consultative approach. Cognizant, a Nasdaq-100 company with itsheadquarters in the United States, is number 185 on the Fortune 500 and has been routinely recognized as one of theworld's most admired businesses for the past 11 years. It is additionally ranked 74th on Forbes' 2018 Best Employersfor Women list.CTC: GenC - 4 LPAGenC Next - 6.75 LPASelection Process: The recruitment test consists of three rounds.Round 1: Online Assessment This round will have a total of 61 questions, and 240 minutesIt consists of 5 sections- Aptitude, Reasoning, EnglishQuantitative Aptitude: 24 Questions, 35 minutesLogical Reasoning: 25 Questions, 35 minutesVerbal Ability: 1 Question, 30 minutesAutomata Fix: 7 Questions, 20 minutesCoding: Stage 1 - 2 Question, 40 minutesStage 2 - 2 Question, 80 minutesRound 2: Programming Skills 4 coding questions, 120 minutes.Round 3: Gen C Next or Gen C interview. Questions will be based on Technical, Cognitive Abilities, and RightAttitude.Note: Candidates who successfully clear round 2 will be eligible for the GenC Next Interview. Candidates who fail toclear round 2 will be headed toward the Gen C interview round.Job title: Engineer TraineeLocation: Bengaluru, Chennai, Coimbatore. Candidates must be flexible to relocate to any Cognizant work locations asper the business requirement & demand.Job description: IT Service Desk has witnessed significant transformations due to technological advancements. Today,many organizations leverage AI chat bots to automate and streamline their support processes. AI chat bots use naturallanguage processing to provide instant responses to common user queries and handle simple tasks, reducing theworkload on human analysts. Robotic Process Automation (RPA) is also gaining traction,allowing repetitive and rule-based tasks to be automated, freeing up analysts' time for morecomplex issues.• Provide first-line technical support and assistance to end-users, addressing their IT-related issues and enquiries, log and track all support tickets, ensuring accurate documentation and timely resolution ofproblems.• Troubleshoot hardware and software problems, performing diagnosis and resolving technical issues to minimizedowntime, collaborate with other IT teams to escalate complex issues and ensure prompt resolution and to maintainknowledge base articles and documentation to enhance self-service options and facilitate efficient problem-solving.Compensation: INR 4,00,000 per annumRole expectations:• Associate should be client focused and able to work with users from differentcommunities and cultures across the globe.• Ability to have flawless communication (verbal and written) with our clients and possesssound technical knowledge.• Work in shifts and work from the office.Support available from Cognizant (post joining as Full Time Employee)• Night shift allowance will be paid by the project.• Cognizant provides cabs for pick-up and drop, ensuring safety and comfort.• Timely rewards and recognition for top performers.If you are passionate about customer service, possess strong technical skills, and thrive in afast-growing environment, then this role is for you.Eligibility Criteria:• 2024 Batch of B.E/B.Tech of any branch (UG full time degree).• At the time of registration, consistent academic record of a minimum of 50% in X, XII, Diploma, UG & PGwith no standing arrears in current education.• At the time of joining, all recruits need to have a minimum 50% aggregate in the pursuing degree with nostanding arrears.• Flexible to relocate to anywhere in India, work in any shift / technology / domain, including work from officelocation basis business requirements.• Opportunities are open to Indian nationals / OCIs who are currently residing in India.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 4
            },
            {
                "key": "ctc_max",
                "value": 6.75
            },
            {
                "key": "role",
                "value": "Engineer Trainee"
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "location_2",
                "value": "Chennai"
            },
            {
                "key": "percent",
                "value": 50
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "Accenture",
        "description": "accentureAccenture is an Irish-domiciled multinational company that provides consulting and professional services. A FortuneGlobal 500 company, it reported revenues of $44.33 billion in 2020 and had 569,000 employees. In 2015, the companyhad about 150,000 employees in India, 48,000 in the US, and 50,000 in the Philippines. Accenture's current clientsinclude 91 of the Fortune Global 100 and more than three-quarters of the Fortune Global 500.CTC: Associate Software Engineer - 4.5 LPA• Extensive training before deployment• Project exposure from the first month of joining• 24-months learning program to become full-stack in a chosen technology• Faster career progression opportunitiesAssociate Software Engineer - 6.5 LPA• Opportunity to get deployed in hand-picked complex assignments in emerging technologies• End-to-end exposure from front-end, back-end, middle layer• Well-defined learning journey with coaching and mentorship to grow as an expertSelection process: The process Consists of 3 RoundsRound 1: Online assessment consists of two-stageStage 1: Cognitive Ability and TechnicalEnglish: 17 QuestionsQuantitative: 17 QuestionsReasoning: 15 QuestionsMS Office: 11 QuestionsNetworking: 9 QuestionsPseudocode: 17 QuestionsCoding - 2 Questions, 45 MinutesStage 2: Communication Assessment – 20 Minutes – Medium DifficultyRound 2: Technical interviewRound 3: HR InterviewEligibility criteria:• Minimum criteria – Any engineering stream of B.E/B.Tech/ME/M.Tech or MCA or MSc (CS/IT) with year of passoutbeing 2025• No active backlogs during application and/or during onboarding.• Candidate should have completed the relevant degree (eligible for this job role) in the stipulated duration of thedegree. There should be no gaps during the course of your degree. E.g. candidate must complete the 4-year B. Techcourse in 4 years.• Candidate should not have appeared for Accenture Recruitment assessment/interview process in the last three months.• Candidates must be eligible to work in India by citizenship/ have relevant work permit documents. Please note thatBhutan and Nepal nationals can work in India without a need for obtaining a work visa. All other foreign nationalsrequire work visa or an Overseas Citizenship of India (OCI) or Person of Indian Origin (PIO) card to work in India",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 4.5
            },
            {
                "key": "ctc_max",
                "value": 6.5
            },
            {
                "key": "role",
                "value": "Associate Software Engineer"
            },
            {
                "key": "branch_1",
                "value": "B.E/B.Tech"
            },
            {
                "key": "branch_2",
                "value": "ME/M.Tech"
            },
            {
                "key": "branch_3",
                "value": "MCA"
            },
            {
                "key": "branch_4",
                "value": "MSc (CS/IT)"
            }
        ]
    },
    {
        "Name": "Capgemini",
        "description": "CapgeminiCapgemini:Desired Competencies:• Communication: Strong interaction skills with partners.• Collaboration: Good interpersonal and teamwork abilities.• Flexibility: Adapt to multiple technologies, locations, and travel.• Initiative: Work independently and manage multiple tasks.• Other Skills: Strong analytical and problem-solving abilities.CTC: Analyst: 4.25 (4 LPA + 25k one-time incentive)Analyst (Differential Hiring): 5.75 (5.5 LPA + 25k one-time incentive)Senior Analyst: 7.5 LPASelection Process: The recruitment process consists of six rounds.Round 1: Technical AssessmentPseudocode 30 Questions (30 Min)Write logic: 7 Questions C, C++Write Output: 23 QuestionsRound 2: English Communication Test 30 Questions (30 Min)Topics: FIB, complete the sentence, spelling errors, synonyms, reading comprehension, para jumbled sentences,Synonyms/Antonyms, Indirect Direct SpeechRound 3: Game-Based Test 30 Questions (30 Min)Topics: Grid challenge: find symmetry and select the correct order of pattern by seeing it once DeductiveLogical Thinking, Inductive Logical Thinking, Motion Challenge, Switch challenge, Digit ChallengeRound 4: Behavioral Round 100 QuestionsThere will be no time limit for the round, but it is a mandatory one for everyone. This round helps themunderstand the innate profile of the candidate.Round 5: Technical Round (20 Min)Round 6: HR Interview (10 Min)Eligibility:No edu. Gaps allowedCS/IT group, ECE, ENNo live backlogs.Note: Candidates must have an active DigiLocker account and active mobile number linked with their Aadhar Number whileapplying for this job. Refer to attached pdf for a detailed walk-through of the process.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 4.25
            },
            {
                "key": "ctc_max",
                "value": 7.5
            },
            {
                "key": "role",
                "value": "Analyst, Senior Analyst"
            },
            {
                "key": "branch_1",
                "value": "CS/IT"
            },
            {
                "key": "branch_2",
                "value": "ECE"
            },
            {
                "key": "branch_3",
                "value": "EN"
            }
        ]
    },
    {
        "Name": "Larsen & Toubro Infotech Ltd",
        "description": "LTILet's SolveLarsen & Toubro Infotech Ltd is a global technology consulting and digital solutions company helping more than 300clients succeed in a converging world. With operations in 30 countries and a team of more than 27000 employees, L&TInfotech is differentiated by its unique Business-to-IT Connect. Founded in 1997 and headquartered at Mumbai, LTI hasstrategic alliances with Web Methods, IBM, Microsoft, Business Objects, Oracle, Computer Associates, Siebel, Oracle,SAP, PeopleSoft, SAP, JD Edwards, Matrix One, Sun Microsystems, and HP. Larsen & Toubro Infotech was formerlyknown as L & T Information Technology Limited.The company is headquartered in Mumbai, India. It has additional offices in Pune, Chennai, Mysore, Bangalore, andHyderabad, India. Larsen & Toubro Infotech Limited operates as a subsidiary of Larsen & Toubro, Ltd. Larsen &Toubro Limited operates as a technology, engineering, construction, and manufacturing company worldwide.Key Persons:Chairman: A. M. NaikChief Executive Officer and Managing Director: Debashis ChatterjeeSelection process:Round 1: Online AssessmentTechnical: MCQ 40 Questions (40 Min)Coding:Level 1 – 1 Question (30 Min) @ Rs. 5 LPALevel 2 - 1 Question (45 Min) @ Rs. 6.5 LPA (on completion of level 1)Level 3 - 1 Question (45 Min) @ Rs. 8 LPA (on completion of level 1 & level 2)Round 2: Technical InterviewRound 3: HR InterviewRole: Graduate Engineer Trainee (GET)Applications are invited from all eligible students in following disciplines:• Civil• Electrical / EEE• Industrial• MechanicalEligibility:➤ 4 year / 8 semester Degree (full-time) course (students expecting to graduate by 30thJune 2025) after 10+2 / 10+Diploma.➤ The Aggregate for 10th,12th / Diploma, B.E. / B. Tech / B. Arch (5 Years/10Semesters) should be more than or equal to 65%.➤ No backlogs (past or live) during B.E. / B. Tech / B. Arch Course. Allsubjects/papers should be cleared in the first attempt only.➤ Any subject/paper appeared and not cleared in the first attempt is considered abacklog.➤ Post 10th Standard.• 12th Standard should have been completed within 2 years (or])• Diploma should have been completed within 3 years, as applicable.➤ B. E / B. Tech to be completed in 4 years if done after 12th and in 3 years ifdone post Diploma.➤ Should be an Indian national.The company reserves the right to alter the requirements & eligibility criteria.Compensation:Posting Category CTC Per AnnumOffice Based Posting Rs. 6,00,000/-Project Site Based Posting Rs. 6,57,000/Additionally, local transportation and canteen facilities are available based on the place ofposting, governed by the prevailing guidelines thereunder.Selection Process:Selection process consists of following steps:1. Online Test: (completely remote proctored)Aptitude Test (Analytical Ability, Verbal Ability and Numerical Ability) & TechnicalTest.2. Interview (including extempore) for candidates clearing the Online Test.3. Pre-employment medical test for candidates as per the guidelines providedby our Chief Medical Officer",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 5
            },
            {
                "key": "ctc_max",
                "value": 8
            },
            {
                "key": "role",
                "value": "Graduate Engineer Trainee (GET)"
            },
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "branch_2",
                "value": "Electrical / EEE"
            },
            {
                "key": "branch_3",
                "value": "Industrial"
            },
            {
                "key": "branch_4",
                "value": "Mechanical"
            }
        ]
    },
    {
        "Name": "Infosys",
        "description": "InfosysJob Role:1. Specialist Programmer: As an Infosys programmer in an SP role, you are expected to work in high endprojects using technologies like Machine Learning and Artificial Intelligence. Some of the technologies that youshould know before getting into Infosys SP role include:• Functional Programming– Scala, Akka• Java Microservices- Spring Boot, JEE• NoSQL and Scripting – ReachJS, Angular JS, MongoDB• Big Data and ML- Hadoop, Azure ML,• DevOps- Jira, GIr, JenKinsCTC: 9.5 LPASelection Process:Round 1: Online Assessment This round will have a total of 3 coding questions, and 180 minutes. It consists of 3levels- Easy, Medium, Hard .Round 2: Onsite Technical InterviewRound 3: Culture fit Interview.2. System Engineer : A System Engineer at Infosys is responsible for the design, development, implementation,and maintenance of systems that support the company's IT infrastructureCTC: 3.6 LPASelection Process:Round 1: In Campus Assessment. It consists of 7 sections-• Mathematical Ability• Reasoning Ability• Verbal Ability• Pseudo Code• Puzzle Solving• English Ability• Essay WritingRound 2: In Campus interviews, 20-30 minutesEligibility:•All percentages/CGPA should be a simple average for all subjects/semesters/years, including electives,optional subjects, additional subjects, practical subjects and languages.Class 10 and Class 12- 60% or equivalent 60%Diploma (if applicable) - 58% or equivalent 58%B.E./B. Tech - 60% or equivalent 60%• In case the candidate has done both Class 12 and Diploma, the best of the two is taken into consideration.• No active backlogs are allowed.• Candidate should be willing to relocate to any location as required by Infosys.• Candidate should be willing to work in different technologies as required by Infosys.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 3.6
            },
            {
                "key": "ctc_max",
                "value": 9.5
            },
            {
                "key": "role",
                "value": "Specialist Programmer, System Engineer"
            },
            {
                "key": "percent",
                "value": 58
            }
        ]
    },
    {
        "Name": "Amadeus",
        "description": "amadeusAt Amadeus, fresh graduates bring new perspectives and are seen as key contributors to the organization's technical andleadership growth. With Amadeus processing millions of transactions daily, system reliability and performance arecritical. We ensure customer satisfaction by delivering on their needs effectively.Fresh graduates are absorbed into various divisions based on their skills and interview evaluations. To prepare them, allgraduate engineers undergo an intensive 6–8 week training program, equipping them with the technical skills requiredfor their roles.Designation: Software EngineerСТС: 12,62,218/-Location: Bangalore/PuneSkill set 1: Java/J2EEA Java/J2EE developer is primarily a Back-end developer at Amadeus. You will be working on high volume productionsystems for the development and maintenance of Booking Engine which is a single set of code across a range ofAmadeus E-Commerce products. This code is very critical because a slight error might block the airlines/travel agentsfor processing the booking or ticketing.A Software developer is involved in many activities like:• Define user requirements for development or improvement of software solutions• Design technical solutions and perform feasibility studies• Innovate: Think out of the box and practice innovation in his/her daily tasks. Propose and develop innovativesolutions to the problems.• Propose viable technical solutions to Product Management and users for validation• Conduct unit, package and performance tests of the software and ensure a level of quality• Design and implement databases as necessary• Produce software documentation for the application and issue it• Support the end user in the Production phase by debugging existing software• solutions in response to Problem Tracking Records and Change Requests issued from• Product Management or Product DefinitionMain technical expertise on which the candidate will be trained on:• Core Java with J2EE experience• JUnits, Design Patterns, Struts, Spring MVC or any other framework• JSPs, Servlets, EJBs, DB, XML, WebServices etc. WebLogic, Ant/MavenSkill set 2: Java/UIA UI developer works on a presentation layer which is the layer mostly exposed to the customer. The more sturdy andintuitive it is; the more satisfied our customer is. The skills which a candidate develops are very niche and give thema clear advantage over other technical profiles. An engineer who can think UI and brings in innovation in his daily work.A very demanding position with skill set varying:• JQuery/ExtJS/YUI/DOJO or a similar JS framework• DataBase, ClearCase, WebLogic, Ant/Maven etc• JavaScript, OOJS CSS, HTML, AJAX, DOM, JSPs etc• Core Java/ J2EE experience is desirableSkill set 3: C/C++There are multiple work streams in Amadeus Labs, Bangalore who are focusing on core work areas where we needexpert C/C++ developers. A Software developer is involved in many activities like:• Define user requirements for development or improvement of software solutions• Design technical solutions and perform feasibility studies• Innovate: Think out of the box and practice innovation in his/her daily tasks. Proposeand develop innovative solutions to the problems.• Propose viable technical solutions to Product Management and users for validation• Conduct unit, package and performance tests of the software and ensure a level of• quality• Design and implement databases as necessary• Produce software documentation for the application and issue it• Support the end user in the Production phase by debugging existing software• solutions in response to Problem Tracking Records and Change Requests issued from• Product Management or Product DefinitionTechnical/Technical Skills• UNIX/ Linux, shell scripting• Strong knowledge of OOPS and coding with C++, design-patterns.• Database modeling, Oracle, Oracle BI, optimization techniques.• Good knowledge of development of a distributed system and of distributed• algorithms• Experience of Oracle environment and optimization techniques is a plus• Experience in multithreaded programming is a plusSkill Set 4 :Dev OpsThe DevOps engineer plays a key role to implement and support innovative solutions for operational requirements. Thescope of the role will encompass process automation solutions for the highly demanding Amadeus operational businessdomain.The DevOps Engineer will be involved in activities like",
        "Keys": [
            {
                "key": "ctc",
                "value": 12.62
            },
            {
                "key": "role",
                "value": "Software Engineer, DevOps Engineer"
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "domains",
                "value": "Java/J2EE, C/C++, DevOps"
            }
        ]
    },
    {
        "Name": "Tata Mutual Fund",
        "description": "Functional Area: Sales Job Role: Management Trainee Compensation: Fixed CTC : 5.00 LPA + 50K Assured Bonus Location: Delhi, Pune, Nagpur, Chandigarh, Jaipur Key Working Relationships: Part of the sales team at the branches Job Summary: Key responsibilities will be to meet assigned sales targets, through distributor engagement and activation. The goal is to enhance Tata Mutual Fund's visibility in the marketplace. Qualification: MBA in Marketing/ Finance is preferred Experience: Preferably 0 to 2 years of prior relevant work experience in BFSI sector. Key Responsibilities: • Achievement of Gross Sales, Net Sales and SIP targets assigned in allotted geographic territory across Mutual Funds, PMS and AIF. • Activate distribution partners and increase productivity in terms of no. of applications and volume. • Identify prospective distribution partners (IFAs) and empanel them for selling the products of the AMC, this should also apply to new ARNs entering the market every month. • Engage with the mapped relationships as per coverage plan, to build strong relationship and recall for the brand. • Adhere to the defined sales process and reporting requirements. • Use internal and external data for sharper focus and market intelligence. • Read and update knowledge on regular basis to be able to articulate the fund house views and positioning of the product. • Liaise with sales-support, investor services and other internal departments, and to ensure timely and quality response to distributors for various requirements. • Responsibilities would also include the day-to-day management of internal office work/back office and timely MIS. • Ensures that external communications that go from the sales team is factually correct and in compliance with internal procedures and meets all regulatory compliance requirements. • Represents the company in the allotted area and will strive to ensure that the company's image is always upheld and projected in the appropriate manner. • Any other Job as assigned by the management from time to time",
        "Keys": [
            {
                "key": "domains",
                "value": "Sales"
            },
            {
                "key": "role",
                "value": "Management Trainee"
            },
            {
                "key": "ctc",
                "value": 5.0
            },
            {
                "key": "location_1",
                "value": "Delhi"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "branch_1",
                "value": "Marketing"
            },
            {
                "key": "branch_2",
                "value": "Finance"
            }
        ]
    },
    {
        "Name": "Tata Hitachi Construction Machinery Company Private Limited",
        "description": "TATA HITACHI Tata Hitachi Construction Machinery Company Private Limited Job Role: Graduate Engineer Trainee – Mechanical Eligibility criteria are as follows : 1. First class marks from the 10th standard onwards and each year of the engineering course (i.e., marks of Sem 1 + Sem 2 >= First Class). 2. All subjects in the engineering course should be cleared in the first attempt. 3. The candidate should have a continuous career throughout from the 10th standard onwards i.e. there should not be any gap of a year in the academic curriculum. [This is relaxable by a year between the 12th std board exam and the first year of the engineering course.] 4. Students who have completed their diploma and then gone on to do their graduation by taking admission in the second year of the engineering course are eligible for the cadre.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee – Mechanical"
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            }
        ]
    },
    {
        "Name": "Blue Star India Limited",
        "description": "BLUE STAR Blue Star India Limited Job Role: Graduate Engineer Trainee, Diploma Engineer Trainee and MBA Location: Maharashtra Remuneration : • Graduate Engineer Trainee INR 525000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable. • Diploma Engineer Trainee INR 350000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable. • MBA: INR 642000/- Per Annum (Fixed Pay), Variable Pay as per Division will be applicable Pre-requisites - (minimum selection requirements)- • Graduate Engineer Trainee(Mechanical/Electrical): 1. Full- Time Graduate (Bachelor's Degree) 2. Secured at least 60% marks or equivalent grade in academics (10th,12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. • Diploma Engineer Trainee: 1. Secured at least 60% marks or equivalent grade in academics (10th, 12th). 2. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. • MBA: 1. Full-Time MBA 2. Secured at least 60% marks or equivalent grade in academics (10th, 12th). 3. Should not have any gap or backlog in their academics, i.e. the course should not have been completed in more than the stipulated duration. Role Offered: GET (Mechanical/Electrical): 1. To ensure the project requirements are met as per the plan. 2. Verification of design with all required schemes. 3. Regular interaction with stakeholders for implementation of technical requirements. 4. Application of value engineering for project completion at optimum cost. 5. Identify design lacuna and suggest corrections. DET(Mechanical/Electricals): 1. Ensure quality of installation at MEP Project Sites. 2. Effectively mobilize available resources and strive for on time project completion. 3. Implement and maintain safe work practices at project sites. 4. Ensure smooth handing-over of projects, with all relevant documents. 5. Ensure adherence to statutory compliance and achieve over all customer satisfaction. MBA(Sales & Marketing): 1. Achieve sales targets with adherence to TOP (Terms of Payments)",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee"
            },
            {
                "key": "role",
                "value": "Diploma Engineer Trainee"
            },
            {
                "key": "role",
                "value": "MBA"
            },
            {
                "key": "location_1",
                "value": "Maharashtra"
            },
            {
                "key": "ctc",
                "value": 5.25
            },
            {
                "key": "ctc",
                "value": 3.5
            },
            {
                "key": "ctc",
                "value": 6.42
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            },
            {
                "key": "branch_2",
                "value": "Electrical"
            },
            {
                "key": "branch_3",
                "value": "Sales"
            },
            {
                "key": "branch_4",
                "value": "Marketing"
            }
        ]
    },
    {
        "Name": "AFCONS Infrastructure Limited",
        "description": "AFCONS AFCONS Infrastructure Limited is a part of Shapoorji Pallonji Group, one of the largest construction groups in India. Over the last Six decades, we have emerged as one of the leaders in EPC Infrastructure Industry by continuously delivering world-class services in the areas of Marine, Highways, Bridges, Under Ground Metro, Elevated Metro Tunnels, Hydro & Tunnel, Water projects and Onshore & Offshore Oil & Gas. Position: GET (Civil) Profile: Execution (for 2 years) followed by Rotation training for 6 months Salary: 4.2LPA Location: PAN India Other facilities: Bachelor accommodation and local transportation Eligibility Criteria: Minimum 60% throughout i.e., 10th, 12th and CGPA with no active backlogs Detailed Procedure for the drive: 1. CV shortlisting 2. Online Technical Test 3. Online Aptitude Test 4. Technical & HR (Personal) Interviews of candidates shortlisted after online Test 5. Declaration of finally selected students after getting necessary approvals at our Head Office",
        "Keys": [
            {
                "key": "role",
                "value": "GET (Civil)"
            },
            {
                "key": "ctc",
                "value": 4.2
            },
            {
                "key": "location_1",
                "value": "PAN India"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "domains",
                "value": "Marine, Highways, Bridges, Under Ground Metro, Elevated Metro Tunnels, Hydro & Tunnel, Water projects and Onshore & Offshore Oil & Gas"
            }
        ]
    },
    {
        "Name": "Telaverge Communications",
        "description": "TELAVERGE COMMUNICATIONS Telaverge Communications Positions: Research and Development Engineer CTC/Internship stipend: ❖ A consolidated stipend of Rs.10,000/- p.m. will be paid during the period of internship. CTC will be 3.8L to 4.2L (purely based on the performance). Performance incentive OR onetime bonus upto a Max of 1 Lakh after successful ❖ Completion of Internship and joining Telaverge.(purely based on the performance). Bond (Details): 2 Years Job Location: Bangalore Qualification: BTech/BE/MCA/M.SC/M.tech- Electronics Percentage: 60+ Year of passing out: 2020-2021 Practical Exposure to Electronics (Has done some practical projects) Skills required: - Electronic Engineering/ Electronics & Communications - Basic Knowledge of programming in C/C++ - Good knowledge in fundamentals of electronics (analogue & digital) & electrical science. - Good practical skills - Schematic analysis, implementation (In breadboard & perf board) Note: Candidates with hands-on experience and knowledge in microcontroller programming, sensor interfacing, PCB designing shall be the upper hand.",
        "Keys": [
            {
                "key": "role",
                "value": "Research and Development Engineer"
            },
            {
                "key": "stipend",
                "value": 10
            },
            {
                "key": "ctc_min",
                "value": 3.8
            },
            {
                "key": "ctc_max",
                "value": 4.2
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Electronics"
            },
            {
                "key": "branch_2",
                "value": "Communications"
            },
            {
                "key": "branch_3",
                "value": "MCA"
            },
            {
                "key": "branch_4",
                "value": "M.SC"
            }
        ]
    },
    {
        "Name": "Asian Heart Institute",
        "description": "ASIAN HEART INSTITUTE Asian Heart Institute Job Role- Training Executive in billing, Executive Assistant, Management Trainee in Finance & Accounts, Operations, patient care, MRD, HR, Marketing & Sales, Stores. Designation- Management Trainee Job Location- Mumbai, Bandra CTC: 1. MBA-4 LPA CTC minimum 2. BBA - 3LPA CTC About Asian Heart Institute, Mumbai: Asian Heart Institute rated as India's No. 1 heart care hospital for last 10 years in a row by various national surveys and among the best heart hospitals in the world by Newsweek international magazine in 2022 & 2023, was set up in 2002 with an aim to provide world-class cardiology and cardiac surgery services in India. It is situated at the Bandra Kurla Complex (BKC), a mere 15-minute drive from the domestic and international airports. The hospital is globally known as a model healthcare institution for delivering highest quality, honest medical opinions by highly capable, experienced, and dedicated healthcare professionals, using the best-in-class systems, processes, and practices within a strict ethical framework. Over the last two decades, Asian Heart Institute has treated more than 4,15,000 patients, performed over 50,000 angiographies & angioplasties, 27,500 plus heart surgeries including 5000 + complex heart surgeries. The hospital has a 99.6% success rate in cardiac surgeries including many considered inoperable worldwide and an overall 99.83% success rate in bypass which is considered among the best in the world. It is one of the highest accredited hospitals in India with 6 times gold certificates from JCl (Joint Commission International) as well as NABH (National Accreditation Board for Hospitals) and rated world's best hospital 2022 by ET Ascent.",
        "Keys": [
            {
                "key": "role",
                "value": "Training Executive"
            },
            {
                "key": "role",
                "value": "Executive Assistant"
            },
            {
                "key": "role",
                "value": "Management Trainee"
            },
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "ctc_min",
                "value": 4.0
            },
            {
                "key": "ctc",
                "value": 3.0
            },
            {
                "key": "branch_1",
                "value": "MBA"
            },
            {
                "key": "branch_2",
                "value": "BBA"
            },
            {
                "key": "domains",
                "value": "billing, Finance & Accounts, Operations, patient care, MRD, HR, Marketing & Sales, Stores"
            }
        ]
    },
    {
        "Name": "JTP",
        "description": "JTP is a listed company on JASDAQ (Japanese Stock exchange) as JTP 2488. Our portfolio encapsulates services and products in ROBOTICS, Hardware / Software development, Pharma and Human resource development. Our head office is in Japan with branch offices in the USA, India, Korea, and many other countries. JTP has over 35 years of experience in the Japanese market. We work with clients such as EMC, SAP, Hitachi, NVIDIA, Softbank, Mitsubishi etc.",
        "Keys": [
            {
                "key": "role",
                "value": "System engineer"
            },
            {
                "key": "ctc",
                "value": 24
            },
            {
                "key": "location_1",
                "value": "Japan"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "EC"
            },
            {
                "key": "branch_4",
                "value": "E&TC"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    },
    {
        "Name": "Darwinbox",
        "description": "Darwinbox is Asia's fastest-growing SaaS-based HR Technology platform. A brainchild of alumni from the country's most distinguished institutions (IIT/IIM/XLRI) and organizations (McKinsey, EY, Google), Darwinbox is the preferred technology partner of 500+ global enterprises with more than 1 million+ employees using the platform. Our endto-end HCM technology suite competes with the best in the business and has won against giants such as SAP, Oracle, and Workday several times to acquire iconic enterprise customers ranging from the largest conglomerates to unicorns Adani, Mahindra, Kotak, TVS, Arvind, Nivea, Puma, Swiggy, Paytm, Bigbasket and Delhivery etc. The rate at which our product and market presence is growing is unprecedented. We're a rocketship. We're not planning on slowing down anytime soon. And, that's why we need you!",
        "Keys": [
            {
                "key": "domains",
                "value": "HR Technology"
            },
            {
                "key": "role",
                "value": "Intern- Product Development"
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "ctc",
                "value": 16.3
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            }
        ]
    },
    {
        "Name": "TIAA",
        "description": "Describing below the primary purpose and function of this job: TIAA India is looking for trainees under Cyber Internship Program with an objective of providing exposure to young and budding tech talent and providing an opportunity for them to get acquainted with the Corporate culture and insights into Technology. Selected Candidates will have the opportunity for 10 Weeks of internship with Cyber Security team before onboarding them as full-time employees as Trainees. The Trainee will be responsible for development, communication, implementation, enforcement and monitoring of security controls to protect the organization's technology assets from intentional or inadvertent modification, disclosure or destruction. The trainee is responsible for monitoring computer security procedures and maintaining IT security policies, procedures and testing results. The Trainee typically works as part of a project team or as an individual contributor under guidance from a Mentor. The Trainee will communicate progress, resolve technical issues and work with the appropriate teams for solutions.",
        "Keys": [
            {
                "key": "role",
                "value": "Cyber-Security Trainee"
            },
            {
                "key": "ctc",
                "value": 10.48
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "CSE"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "Cyber Security"
            }
        ]
    },
    {
        "Name": "Quantiphi",
        "description": "",
        "Keys": [
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "location_2",
                "value": "Banglore"
            },
            {
                "key": "branch_1",
                "value": "B.E"
            },
            {
                "key": "branch_2",
                "value": "M.E"
            },
            {
                "key": "branch_3",
                "value": "MCA"
            },
            {
                "key": "branch_4",
                "value": "B.Tech"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "stipend_min",
                "value": 10
            },
            {
                "key": "stipend_max",
                "value": 23
            },
            {
                "key": "ctc_min",
                "value": 6.5
            },
            {
                "key": "ctc_max",
                "value": 8.5
            },
            {
                "key": "role",
                "value": "Data Engineer"
            }
        ]
    },
    {
        "Name": "Demand Farm",
        "description": "",
        "Keys": [
            {
                "key": "role",
                "value": "Associate Product Engineer"
            },
            {
                "key": "ctc_max",
                "value": 8
            },
            {
                "key": "location_1",
                "value": "Remote"
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "branch_1",
                "value": "IT"
            },
            {
                "key": "branch_2",
                "value": "CS"
            },
            {
                "key": "percent",
                "value": 60
            }
        ]
    },
    {
        "Name": "Taurani Holdings LTD",
        "description": "Industry Sector: Manufacturing &amp; trading of steel and allied steel products.",
        "Keys": [
            {
                "key": "role",
                "value": "Engineering Trainee"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "location_1",
                "value": "United Arab Emirates"
            },
            {
                "key": "location_2",
                "value": "Kingdom of Saudi Arabia"
            }
        ]
    },
    {
        "Name": "Emami",
        "description": "",
        "Keys": [
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "PAN India"
            },
            {
                "key": "role",
                "value": "GET – Electrical"
            }
        ]
    },
    {
        "Name": "Muthoot Finance",
        "description": "The Muthoot Group of Finance",
        "Keys": [
            {
                "key": "role",
                "value": "Front line sales executive"
            },
            {
                "key": "location_1",
                "value": "North"
            },
            {
                "key": "location_2",
                "value": "East"
            },
            {
                "key": "stipend",
                "value": 10
            }
        ]
    },
    {
        "Name": "DeltaX",
        "description": "",
        "Keys": [
            {
                "key": "role",
                "value": "Associate Product Engineer"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "cgpa",
                "value": 50
            }
        ]
    },
    {
        "Name": "Innovaptive Inc",
        "description": "We are looking for a Product Owner to drive one of Innovapptive's connected worker SaaS platform products. The connected worker platform brings the maintenance front-line workers, back-office and connected assets (IiOT) together on one unified platform to perform jobs better, faster, cheaper and safer. This person will be responsible for product roadmap planning and execution, from ideation to adoption for the connected worker Platform Products. We are aggressively expanding our market penetration into several industry verticals with a special focus on Oil & Gas, Utilities, Chemicals, Metals & Mining and Industrial Manufacturing. And we need a dynamic, fast-paced Product professional who can ideate, design, drive, build and deliver Product features at pace.",
        "Keys": [
            {
                "key": "role",
                "value": "Product Owner"
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            }
        ]
    },
    {
        "Name": "Hexaware",
        "description": "At Hexaware, we're not just a global technology and business process services company; we're a community of 31,600+ Hexawarians dedicated to one singular purpose: creating smiles through the power of great people and technology. With a presence in 58 offices across 28 countries, we empower enterprises worldwide to embark on their digital transformation journey with unparalleled scale and speed. As an employer, we're more than just a workplace. We put our people first, foster diversity and inclusivity, and prioritize their growth through robust learning and development programs. Our Culture is a canvas for innovation as we work toward our shared vision of becoming the world's most loved digital transformation partner. Exciting, isn't it? Visit www.hexaware.com to join us in embracing the magic of technology, as we passionately advocate for its potential to transform lives today and shape a brighter future. Together, we'll make the digital world a better place.Role: Quality Assurance (Software Testing)What are we looking for?Good communication skills- Fluent in spoken & written English Team player and interpersonal relationship abilities High level of energy Right Attitude and the ability to thrive in a fast-paced environment Should be able to multi – task: ability to prioritize and manage project related activities Possess Openness, reliability, punctuality and flexibility at given tasksWho can Apply-Where will you work from:Any Hexaware Office Locations in India. Work from Office only – 5 days a week (No Work from Home allowed)During Internship students should work out of Hexaware Office location only – 5 days a week (No Work from Home allowed)Job Location: Mahape, Navi Mumbai, MaharashtraHiring Process: 1. Group Discussion 2. Aptitude Assessment 3. Technical Interview 4. HR Interview",
        "Keys": [
            {
                "key": "location_1",
                "value": "Nagpur"
            },
            {
                "key": "location_2",
                "value": "Mumbai"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "CSE"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "ISE"
            },
            {
                "key": "branch_4",
                "value": "AI"
            },
            {
                "key": "role",
                "value": "Quality Assurance (Software Testing)"
            },
            {
                "key": "ctc",
                "value": 4
            },
            {
                "key": "stipend",
                "value": 15
            },
            {
                "key": "cgpa",
                "value": 6
            }
        ]
    },
    {
        "Name": "ArcelorMittal Nippon Steel India Limited (AM/NS India)",
        "description": "ArcelorMittal Nippon Steel India is an integrated flat carbon steel manufacturer- from iron ore to ready-to- market products with an achievable crude steel capacity of 9 MTPA. Our manufacturing facilities comprise of iron making, steelmaking and downstream facilities spread across India. We are a young, dynamic & global organization. We stand out for our commitment on innovation & continuous improvement and are on a mission to create Smarter Steels for a Brighter future. For us, our employees and their development are at the core. We collaborate with Industry experts and work along with the latest technologies. We also ensure our commitment to environmental responsibility, ensuring that our manufacturing processes are sustainable and create impact in the communities we operate. Our vision is to be a leading and responsible steelmaker creating value for all stakeholders to achieve this vision, we are always looking for dynamic and highly motivated engineering graduates. As an engineering graduate, you will have the opportunity to work closely with highly experienced professionals of different domains in various innovative projects.Position: Graduate Engineer Trainee (GET)Function: Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, MiningResponsibilities:The Graduate Engineer Trainees will be on a training period for 12 months from the date of joining during which they will be assigned projects within the domain. A GET is designated with the opportunity to work in cutting- edge facilities, contributing to the entire steel manufacturing process. From iron making to downstream operations and crucial role in delivering high-quality steel products to the market. It's a chance to showcase one's expertise and make a significant impact in the industry.Behavioral Skills:Strong interpersonal, problem solving and project management skillsExcellent communication and interpersonal skillsAnalytical and data driven to ensure structured approach to a problemAbility to work in a highly entrepreneurial environment.Willing to relocate to any of AM/NS India locations across any technology.",
        "Keys": [
            {
                "key": "role",
                "value": "Graduate Engineer Trainee (GET)"
            },
            {
                "key": "location_1",
                "value": "India"
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "branch_1",
                "value": "Electrical"
            },
            {
                "key": "branch_2",
                "value": "Mechanical"
            },
            {
                "key": "branch_3",
                "value": "Chemical"
            },
            {
                "key": "branch_4",
                "value": "Electronics & Communication"
            },
            {
                "key": "percent",
                "value": 65
            }
        ]
    },
    {
        "Name": "Solar Industries",
        "description": "1. Position Title: IIoT Intern (Control Room) Post Duration: 6 Months Days of Work: 6 days a week (1 day rotational off) & 8 hours Rotational Shift Internship Type: Paid Job Location: Solar Plant (Chakdoh) REQUIRED SKILLS Programming Languages: 1. Proficiency in Python, C, CSS, HTML & C++ for developing IIoT applications and scripts. 2. Familiarity with Java or JavaScript is a plus. Networking: 1. Knowledge of networking protocols (e.g., MQTT, HTTP, CoAP, OPC UA, TCP/IP, Modbus, RS485/422, RS232). 2. Understanding of IP networking concepts and topologies. Embedded Systems: 1. Experience with microcontrollers (e.g., Arduino, ESP's Raspberry Pi, PLC & SCADA) for prototyping IIoT devices. 2. Familiarity with sensors, actuators, and other hardware components. IIoT Platforms: 1. Exposure to IoT platforms (e.g., PTC, ThingsBoard, AWS, Azure, Google Cloud) for IIoT solutions. 2. Understanding of IoT platforms (e.g., PTC, ThingsBoard, AWS IoT, Azure IoT Hub) is an advantage. Cybersecurity: 1. Basic knowledge of cybersecurity principles related to IoT devices and data protection. Version Control: 1. Familiarity with version control systems, especially Git, for collaborative coding. EDUCATION REQUIRED 1. Completed a degree in Computer Science, Electrical, Electronics, Information Technology, or a related field. Machine Learning: 1.Familiarity with basic machine learning concepts and frameworks (e.g., TensorFlow, scikit-learn) for predictive analytics in IIoT applications. Soft Skills: 1. Strong problem-solving abilities and analytical thinking. 2. Excellent communication skills for collaborating with cross-functional teams. 3. Eagerness to learn and adapt to new technologies and challenges. 2. Position Title: IIoT Intern (Field) Post Duration: 6 Months Days of Work: 6 days a week (1 day rotational off) & 8 hours Rotational Shift Internship Type: Paid Job Location: Solar Industries India Limited (Chakdoh Plant) REQUIRED SKILLS • IndustrialAutomation &Control Systems 1. Knowledge of PLC programming for IIoT integration (Siemens, Rockwell, Schneider, Delta). 2. Understanding of HMI, SCADA, and DCS for real-time monitoring. 3. Familiarity with industrial sensors, transducers, and actuators. 4. Experience with Modscan, Modsim, or similar diagnostic tools is a plus. • Communication Protocols &Networking 1. Basic understanding of IoT & IIoT architecture. 2. Familiarity with industrial communication protocols: 3. Modbus TCP/RTU, OPC UA, MQTT, HTTP, CoAP, Ethernet/IP, RS485/RS232. 4. Understanding of IP networking concepts (LAN, WAN, VLAN). • IIoT Platforms & Edge Computing 1. Knowledge of IIoT platforms (ThingsBoard, Grafana, PTC ThingWorx). 2. Exposure to IoT cloud platforms (AWS IoT, Azure IoT, Google Cloud) is a plus. 3. Understanding of edge computing & gateway devices for IIoT deployments. • Programming & Data Processing 1. Basic PLC programming knowledge for industrial automation. 2. Familiarity with Python for IIoT scripting and data processing is a plus. • Cybersecurity & OT SecurityPractices 1. Awareness of IIoT cybersecurity principles, including data encryption & network security. 2. Basic understanding of firewall configurations and secure device communication • Soft Skills & Problem-Solving 1. Strong analytical and troubleshooting skills for field deployment. 2. Ability to collaborate with cross-functional teams. 3. Eagerness to learn and apply new IIoT technologies. EDUCATION REQUIRED Education: Degree in Electrical, Instrumentation, Electronics, Industrial Automation, Computer Science, or related fields. 3. Position Title: Data Analyst Intern Post Duration: 6 Months Days of Work: Monday to Saturday Type of Internship: Paid Job Location: Solar HO, Extension, Nagpur Eligibility: CS/IT and related fields ROLES & RESPONSIBILITY: • Data Collection • Exploratory Data Analysis (EDA) • Statistical Analysis • Assist in building and fine-tuning machine learning models for predictive analytics or classification tasks. • Test and evaluate models and scripts for performance, accuracy and efficiency. • Maintain detailed documentation of data analysis processes and methodologies. • Collaborate with cross-functional teams to understand business objectives and align data analysis efforts accordingly • Generate regular reports and presentations to communicate analysis results to non- technical stakeholders. REQUIRED SKILLS: 1. Proficiency in programming languages such as Python and SQL. 2. Familiarity with data manipulation libraries (e.g., pandas, numpy, seaborn, matplotlib) and visualization tools such as Power BI. 3. Hands on knowledge of ML algorithms, Neural Networks and interest in NLP models. 4. Basic knowledge of LLM models and their respective architectures. 5. Strong problem-solving abilities and analytical thinking. 6. Excellent communication skills for collaborating with cross-functional teams. 7. Eagerness to learn and adapt to new technologies and challenges.",
        "Keys": [
            {
                "key": "role",
                "value": "IIoT Intern (Control Room), IIoT Intern (Field), Data Analyst Intern"
            },
            {
                "key": "location_1",
                "value": "Chakdoh"
            },
            {
                "key": "location_2",
                "value": "Nagpur"
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "Electrical"
            },
            {
                "key": "branch_3",
                "value": "Electronics"
            },
            {
                "key": "branch_4",
                "value": "Information Technology"
            }
        ]
    },
    {
        "Name": "Grindwell Norton Limited",
        "description": "Job Role: Summer Intern Eligible Degree - B.Tech in Mechanical/Industrial and Production Internship Duration - 2 months Remuneration - Rs.35,000 for two months Job Location - Pan India Eligibility Criteria - 70% throughout in academics Interview Process - 1) Pre Placement Talk 2) Online Assessment 3) Personal Interview Rounds Important Note: The shortlisted candidate should be open to relocate anywhere in India. Job Role - Graduate Engineer Trainee Degree - B.Tech in Mechanical/Industrial and Production Probation Duration - 12 months (Mandatory) Remuneration - Rs. 5.7 LPA Job Location - Pan India Bond Details - 2 years from the date of joining. In case the candidate leaves before completing 2 years, he/she will have to pay Rs. 2 lakhs to the company. Eligibility Criteria - 70% throughout in academics Interview Process - 1) Pre Placement Talk 2) Online Assessment 3) Personal Interview Rounds",
        "Keys": [
            {
                "key": "role",
                "value": "Summer Intern, Graduate Engineer Trainee"
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "ctc",
                "value": 5.7
            },
            {
                "key": "location_1",
                "value": "India"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            },
            {
                "key": "branch_2",
                "value": "Industrial"
            },
            {
                "key": "branch_3",
                "value": "Production"
            }
        ]
    },
    {
        "Name": "Acmegrade",
        "description": "Job Role: Business Development Associate The role is to maximize the efficiency of Practical Oriented Knowledge in Domains of Technology and Management among Potential Clientele Ranging from Undergraduates to Graduates in the field of Engineering and Commerce. Acmegrade deals with a series of Products and Services that benefits its Customers Practically as well as Academically in their fields of Interest and as a BDA (Business Development Associate), You are expected to find Potential Clients that fits the description, understand their difficulties, find their passion and interests and guide them to understand how Acmegrade can help them cross their hurdles and reach their goal through Acmegrade's platform. Roles and Responsibilities: 1. Work closely with the Sales and Marketing Team in assisting the growth of the business by acquiring new business leads. 2. Pitch and promote Acmegrade's services to prospective clients. 3. Career counsel prospective students. Understand their learning objectives and offer them relevant Acmegrade Products 4. Collaborate with the Sales and Marketing team to plan and oversee new marketing initiatives 5. Set up meetings and follow up with potential clients. Preferred Competencies and Skills: 1. Must have Strong communication and interpersonal skills. 2. Must be detail-oriented, go-getter and a fast learner. 3. Critical and out-of-the-box thinking. 4. Strong organizational and leadership skills. 5. Ability to perform well under pressure. Selection Process: 1. Aptitude Test. 2. Group Discussion (GD) Round. 3. Personal Interview (VIRTUAL MODE).",
        "Keys": [
            {
                "key": "role",
                "value": "Business Development Associate"
            },
            {
                "key": "stipend",
                "value": 18
            },
            {
                "key": "ctc_min",
                "value": 4
            },
            {
                "key": "ctc_max",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "branch_1",
                "value": "B.E"
            },
            {
                "key": "branch_2",
                "value": "B. Tech"
            },
            {
                "key": "branch_3",
                "value": "BBA"
            },
            {
                "key": "branch_4",
                "value": "MBA"
            }
        ]
    },
    {
        "Name": "Grappus",
        "description": "Equal parts creative agency, engineering firm, and consultancy, Grappus has a reputation of doing things differently. We work with brands big and small, far and wide, helping them understand, prototype and deploy a broad range of custom tech. We value design and we cringe at bad UX. Each project is a clean slate, we don't have frameworks, or any pre-made formulas. We're not here to just grow big, make money and win awards. We're here to crack the process of building truly innovative products from scratch. Products that make people say 'damn'. People at Grappus usually experience a highly accelerated career growth well beyond the narrow constraints of their 'job description'. Here, the growth ladder is tailored to you. It operates exactly as fast as you can manage to grow. We think it's a waste when smart people are unable to make an impact. Our aim is to unleash your potential by giving you massive challenges and the freedom to solve them. We're in a fluid world, where we don't know what technologies we'll use next, or the projects we'll work on. We're actively searching for ways to shine a light on our blind spots, whether it is in the products we want to build, the problems we like to solve, or the company culture we try to create. That's what makes life at Grappus so exciting. Grappus is an ongoing experiment and you are a part of it. We'll be a different company a few years from now because you are going to change it for the better. We can't wait to see where you take us Position: Software Developer Hiring Process (Every round is an elimination round): 1. Gamified assessment 2. First technical round 3. Second technical round 4. Cultural discussion 5. Final management round Requirements: • Should be well versed with concepts of OOPS and data structures • Should have knowledge of any of the programming languages like C, C++, Java, etc. Should be aware of database concepts and types like SQL (MySQL, etc) & NoSQL (MongoDB, etc) • Should have strong organizational skills to juggle multiple tasks within the constraints on timelines • Should be keen to learn new technologies and updated about the latest developments Should be aware about software development fundamentals, application architecture and design patterns • The ability to communicate complex procedures to other colleagues Skills Required: • Masters/Bachelors degree in Computer Science & IT • Good written and verbal communication skills • Understanding of the Software development lifecycle • Good Analytical and problem solving skills • Self-motivated with the ability to prioritize, meet deadlines, and manage changing priorities Benefits: • We don't track these hours you put in or ask you to fill time sheets. We don't believe in micromanaging, if you're struggling, ask for help. If someone else is, offer some support. • We never mind if people make mistakes or screw up in any way, and offer full encouragement to help people learn fast by failing fast. • We always encourage people to be completely candid, raise alarms, or log complaints anonymously in our feedback tool, no matter how harsh. • We are a 'Work from Anywhere' company, since passionate, driven people can work from anywhere they want; their homes, or cafes, or mountains, or beaches, anywhere. • We have a 15-day notice period. We want to build a place where people work willingly and passionately.",
        "Keys": [
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "ctc",
                "value": 5.5
            },
            {
                "key": "branch_1",
                "value": "BCA"
            },
            {
                "key": "branch_2",
                "value": "B.Tech"
            },
            {
                "key": "branch_3",
                "value": "BSc CS"
            },
            {
                "key": "branch_4",
                "value": "MCA"
            }
        ]
    },
    {
        "Name": "Cloud 4C",
        "description": "Job Title: Associate Engineer (Civil Engineer, Electrical Engineer, Mechanical Engineer) Service Level Agreement: 2 Years Roles and Responsibilities: We are seeking a Graduate Civil Engineer to join our multi-disciplinary Data Centre design teams to work on a Data Centre projects, mainly covering Data Centre's/Mission Critical projects, with leading architects and clients both in India and overseas. We arelooking for a candidate who will fit in with our dynamic teams in a progressive, design- led environment with the successful candidate becoming a contributor to the excellent atmosphere which exists within the group. • Undertaking structural + interior design for DC projects of varying scales. • Knowledge of data center projects and its latest trend for cost-effective design. • Preparation of drawings in Revit and CAD software. A good knowledge of Revit and CAD will be preferable. • Good knowledge of STADD software for structural design. • Preparation of bill of material for the structural and interior design. • Good knowledge of different structural design including the combination of MS and RCC. • Civil design knowledge for the following - Design of structural frame for high rise buildings with high floor loading. Design of Flat Slab structure. Design of Campsite structure - Knowledge of latest construction mythology andmaterials. Knowledge of various basic interior finishes material. • Working closely with Architects/Consultants and other in-house design engineers. • Production of engineering drawings. Preparing and coordinating mechanical reports and specifications. • Knowledge of Uptime and TIA standards for data centers design. • Design and coordinating work with engineers of other disciplines. • Attending meetings and communicating with clients to establish their needs. • Working with the project team to ensure production of deliverables to agreed timelines and within budget. • Sharing technical knowledge with the members of the team. • Up to date knowledge of the latest trend in the civil discipline in particular relation to the Data Centers design. • Preparation of financial analysis for the various design of DC projects. • Supporting procuring work with the best available products in the market. • Responsible and accountable for maintaining client relations. Requirements: • Degree qualified in Civil Engineering. • Extensive knowledge in the field of civil design and the latest trends. • Be able to design and deliver structural solutions for mission-critical projects. • The ability to work under pressure and meet strict deadlines is essential. • Excellent planning and organization skills. • Excellent communications skills (both written and verbal). • Able to demonstrate strong commercial acumen. Eligibility Criteria: • Very Good Communication Skills",
        "Keys": [
            {
                "key": "role",
                "value": "Associate Engineer"
            },
            {
                "key": "ctc_min",
                "value": 4
            },
            {
                "key": "ctc_max",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Mumbai"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "Civil Engineering"
            },
            {
                "key": "branch_2",
                "value": "Electrical Engineering"
            },
            {
                "key": "branch_3",
                "value": "Mechanical Engineering"
            },
            {
                "key": "percent",
                "value": 75
            }
        ]
    },
    {
        "Name": "EPAM",
        "description": "EPAM Job Role: SDE (Intern + FTE) CTC: 8 LPA, Stipend: 25k/month Location: Hyderabad Key Responsibilities as FTE: • Develop high-quality software design and architecture. • Identify, prioritize, and execute tasks in the software development lifecycle. • Develop tools and applications by producing clean, efficient code. • Automate tasks through appropriate tools and scripting. • Review and debug code • Perform validation and verification testing. • Collaborate with internal teams and stakeholders to fix and improve products. • Document development phases and monitor systems. • Ensure software is up to date with the latest technologies Requirements: • Good coding skills on Core Java and knowledge of OOPs, DBMS/SQL, Version Control Systems, Design Principles, Software Quality Engineering fundamentals • Problem Solving: Able to identify and solve complex problems in a structured manner, using Java. Strong fundamentals and deep practical knowledge of DSA preferred. • Possesses growth mindset and exhibits himself/herself as a motivated and organized self- learner and self-driven individual, and who can learn new programming language(s) and technologies when required. • Good verbal and written communication skills • Adaptability to fast-paced environments. • Should be a good team player • Commitment to ethical behaviour and integrity • BE / B. Tech in CS / IS / IT Engineering and MCA – 2025 graduated batch with 70% overall. • Open to work at any of the EPAM locations post Internship. Benefits: • Salary – Internship – 25,000 per month and Full Time – 8 LPA • Customizable insurance coverage • Professional development opportunities • Paid leave for maternity, paternity & bereavement • Retirement benefits like VPF and NPS • Digital meal cards • Hobby Clubs • Company's Social Events Selection Process: Round 1: Online Test (Coding (DSA) 180 mins, Aptitude ques 30 mins) Round 2: Group Discussion Round 3: Technical Interview - 2 rounds. Round 4: HR Interview Eligibility Criteria: BE / B. Tech in CS / IS / IT Engineering and MCA – 2026 Minimum 70% (X, XII, and Graduation) No Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 8
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "role",
                "value": "SDE (Intern + FTE)"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IS"
            },
            {
                "key": "branch_3",
                "value": "IT"
            },
            {
                "key": "branch_4",
                "value": "MCA"
            }
        ]
    },
    {
        "Name": "Sagacious IP",
        "description": "5 Sagacious IP Sagacious IP About Sagacious IP: Sagacious IP is a global leader in Intellectual Property (IP) solutions, providing technical research and consulting services primarily focused on patents. We work with a diverse range of clients, including Fortune 500 companies, start- ups, international law firms, and corporate legal departments. Our expertise spans multiple domains, such as Biotech, Pharma, Mechanical, Electronics, and Telecom. Our headquarters are located in Gurugram (Delhi NCR), where we are currently hiring. Job Role: Patent Analyst CTC: 5.5 LPA, Stipend: 18k/month Job Location: Gurugram Eligibility Criteria: Min. 65% or above in 10th, 12th & Graduation No Live Backlog Candidates will be required to sign a 12-month employment bond upon joining. Role: • Understanding the technology, product, or the invention. Discuss the same with the • seniors & the internal team. If required, discuss the invention with the inventors/researchers/patent lawyers/client over the conference call or in-person meeting to calibrate or to get more details. • Performing various patent searches - prior art search, novelty search, patentability • search, patent portfolio, patent landscaping, validity searches, sequence searches, • structure searches etc. • Conduct comprehensive searches of technical and patent information using online • database and other information resources. • Analyze and summarize search results • Provide insightful evaluation and analysis of results. • Preparing final reports and deliverables as per required standards • Deliver timely, value-added patent search reports. • Discuss the finding/results with the inventor/client over the conference call. • Helping the inventor/client to secure a patent or else, helping them to design-around • the product or the invention. Compensation and Employment Details: • Fixed CTC: INR 550,000 per annum upon successful completion of the 6-month training period at Sagacious IP and B.Tech degree. • Internship Stipend: INR 18,000 per month. The internship period may be extended by 1 month if performance is not satisfactory. • Bond: Candidates will be required to sign a 12-month employment bond upon joining. • Training Period: During this period, the intern's performance will be evaluated to confirm their role as a Patent Analyst. Mandatory Skills: Good analytical skills Good Technical Knowledge Good Interpersonal skill",
        "Keys": [
            {
                "key": "ctc",
                "value": 5.5
            },
            {
                "key": "stipend",
                "value": 18
            },
            {
                "key": "location_1",
                "value": "Gurugram"
            },
            {
                "key": "role",
                "value": "Patent Analyst"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "B.Tech"
            }
        ]
    },
    {
        "Name": "Porter",
        "description": "Porter Internship Opportunity at Porter: 6 Months (JAN – JUNE) Post-Internship Opportunities: Upon successful completion of the internship, candidates may be offered a Pre- Placement Offer (PPO) for full-time roles (Performance Based Conversion) Stipend : 80k Upon FTE Conversion CTC: ₹17 LPA (₹16 LPA fixed + ₹1 Lakh joining bonus) Location : Bengaluru (5 days work from office) Role 1: SDE1 Intern Technical Overview: • You will be expected to design, develop and maintain large-scale complex backend web applications. • You will be expected to rapidly learn and apply relevant new technologies. • You will be having a high level of interaction with business and product stakeholders. • You will be working on the entire web application stack, which includes: • Web server hosting • RESTful communication • Message brokering • Backend application layer, which includes the service and domain layers • Data layer for persistence or caching • You will be participating in an agile software development cycle, which includes: • Design • Development • Code Review • Unit and Integration Testing • Release • You will be exposed to the following technologies: • Web application frameworks: Ruby on Rails,Node.js, Java Play, Vert.x, AIOHTTP, AWS Lambda • Languages: Ruby, Java,Kotlin, Javascript, Python • Data stores: PostgreSQL,Aerospike, Redis,Amazon Redshift • Communication: HTTP, Amazon SQS, Sidekiq,Amazon SNS • Server Management: Amazon ECS,Docker Role 2: Analytics Intern We are seeking a dynamic and enthusiastic Intern to join our analytics team. As an Intern, you will have the opportunity to gain hands-on experience in the field of business analysis, working closely with our seasoned professionals. This internship provides a valuable opportunity to apply theoretical knowledge in a real-world business environment, contributing to meaningful projects and learning from industry experts. As an Intern, you will play a crucial role in supporting our organization's data-driven decision- making processes. You will work closely with senior analysts and managers to gather, analyze, and interpret business data, providing valuable insights to enhance our operational efficiency and overall performance. Responsibilities: Requirements Gathering • Assist in gathering and documenting business requirements from stakeholders through interviews, surveys, and workshops. • Analyze gathered information to identify patterns, trends, and potential areas for improvement. Data Analysis • Analyze data sets to extract valuable insights, identify trends, and support decision- making processes. • Prepare clear and concise reports and visualizations to communicate data-driven findings. Process Documentation and Reporting • Document existing business processes, workflows, and system interactions. • Contribute to the creation of process flowcharts, diagrams, and other documentation formats to enhance understanding and clarity. • Maintain accurate documentation of business requirements, processes, and analysis results. • Assist in generating regular reports and updates for project stakeholders and management. Stakeholder Communication • Communicate effectively with stakeholders to gather feedback, clarify requirements, and ensure alignment with business needs and proposed solutions. • Prepare and deliver presentations to convey analysis findings and recommendations. Problem Solving • Work collaboratively with cross-functional teams to identify problems, propose solutions, and assist in their implementation. • Contribute innovative ideas and suggestions to address business challenges. Learning and Development • Stay updated with industry best practices, emerging technologies, and trends related to business analysis. • Participate in training programs and skill development initiatives to enhance expertise in business analysis techniques and tools. Required Skills and Qualifications: • Pursuing Bachelor's degree in Information Technology, Computer Science, or a related field. • Basic understanding of SQL, Python / R is must • Passion for Data & Analytics • Strong analytical and critical thinking skills. • Good communication and interpersonal abilities. • Basic understanding of business processes and data analysis concepts. • Eagerness to learn, adapt and take on new challenges. •Ability to work effectively in a team and collaborate with colleagues from diverse backgrounds. Selection Process: Round 1: Resume Shortlisting Round 2: Online Assessment ( For Data Analyst: 2 SQL que, 2 python code, Tech MCQ) (For SDE: 2 SQL que, 1 JAVA code, Tech MCQ) Round 3: Technical Interview (Tough) Round 4: Culture Round (Tough) Round 5: HR Interview Eligibility: Required minimum 10th -70%, 12th / Diploma -70%, Degree - 7 CGPA No Live Backlog.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 16
            },
            {
                "key": "ctc_max",
                "value": 17
            },
            {
                "key": "stipend",
                "value": 80
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "role",
                "value": "SDE1 Intern"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "cgpa",
                "value": 7
            },
            {
                "key": "branch_1",
                "value": "Information Technology"
            },
            {
                "key": "branch_2",
                "value": "Computer Science"
            }
        ]
    },
    {
        "Name": "TURING",
        "description": "Turning. TURING Job Role: Data Analyst CTC: 6 LPA, Bond of 2 years Job Location: Remote Working Job Responsibilities: • Write effective, high-quality code to train and evaluate AI models. • Evaluate and rank AI model responses based on user requests across a wide range of CS topics, providing detailed rationales for your decisions. • Craft perfect responses and articulate what constitutes an ideal response content-wise. • Explain your reasoning and logic comprehensively for your actions. • Conduct peer code reviews, offering constructive feedback and criticism. Requirements: • Bachelor's or Master's Degree in Engineering or Computer Science (BE, B.Tech, MCA. Exceptional critical thinking and problem-solving skills (including, but not limited to, good • knowledge of algorithms and data structures, system design, coding practices, etc.) • Excellent English communication skills, with the ability to articulate ideas clearly and • comprehensively. Strong ability to write technical documentation/explanations. Additional Details: Must have a 4-hour overlap with US time zones. Full-time position: 40 hours per week. Must have a laptop and remote work setup. Eligibility Criteria: Min. 65% in throughout academics (10th, 12th, Degree) No Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Remote Working"
            },
            {
                "key": "role",
                "value": "Data Analyst"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Engineering"
            },
            {
                "key": "branch_2",
                "value": "Computer Science"
            },
            {
                "key": "branch_3",
                "value": "BE"
            },
            {
                "key": "branch_4",
                "value": "B.Tech"
            }
        ]
    },
    {
        "Name": "TURING",
        "description": "Job Role: Business Analyst CTC: 3.5 LPA Branches Eligible: BBA, BCA Requirements: • English Proficiency: Ability to read and write in English with a high degree of comprehension skills. • Analytical Skills: Good research and analytical skills • Feedback Skills: Ability to provide constructive feedback and detailed annotations. • Creative Thinking: Creative and lateral thinking abilities. • Communication: Excellent communication and collaboration skills. • Independence: Self-motivated and able to work independently in a remote setting. • Commitment: Ability to commit to 40 hours per week for the contract duration overlapping US hours. • Technical Setup: Desktop/Laptop set up with a good internet connection. Qualifications: • Bachelor's or Master's degree in Engineering, Literature, Journalism, Communications, Arts, Statistics, or a related field. We are open to candidates who do not have a Bachelor's degree but have experience in the area. • Experience writing professionally (business analysts, research analyst, copywriter, journalist, technical writer, editor, translator, etc.) • Understanding of Excel and Google Suite. • Proficiency in Data interpretation, Logical reasoning and Basic arithmetic is highly desirable. Benefits: • Competitive compensation based on experience and expertise. • Flexible working hours and remote work environment. • Opportunity to work on cutting-edge AI projects with leading LLM companies. • Potential for contract extension based on performance and project needs.",
        "Keys": [
            {
                "key": "ctc",
                "value": 3.5
            },
            {
                "key": "role",
                "value": "Business Analyst"
            },
            {
                "key": "branch_1",
                "value": "BBA"
            },
            {
                "key": "branch_2",
                "value": "BCA"
            },
            {
                "key": "branch_3",
                "value": "Engineering"
            },
            {
                "key": "branch_4",
                "value": "Literature"
            }
        ]
    },
    {
        "Name": "Siemens",
        "description": "SIEMENS Siemens Job Role: Intern Stipend: 15k/month Location: Pune Duration: 6 Months Eligibility Criteria: 1. Minimum 60% or CGPA 6 from 10th Grade to current educational qualification. 2. No active backlogs. 3. Academic backlogs not exceeding 2 years. 4. Pursuit of regular, full-time courses.",
        "Keys": [
            {
                "key": "stipend",
                "value": 15
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "role",
                "value": "Intern"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "cgpa",
                "value": 6
            }
        ]
    },
    {
        "Name": "Nexcellerate Technologies Pvt. Ltd. (rampp.ai)",
        "description": "Nexcellerate Technologies Pvt. Ltd. (rampp.ai) CTC: 7 LPA, Stipend: 25k/month Location: Bangalore Job Role 1: Application SDE Key Skills Required: • Proficiency in JavaScript, with experience in Node.js and React (preferably Next.js). • Familiarity with Bootstrap for front-end design. • Experience working with Databases (MongoDB and SQL). • Strong understanding of Data Structures and Algorithms (DSA) Job Role 2: AI Software Development Engineer (SDE) Key Skills Required: • Proficiency in Python with experience in libraries like Pandas and NumPy. • Hands-on experience with Databases (MongoDB and SQL). • Strong understanding of Data Structures and Algorithms (DSA). • Vector database knowledge is a plus. • Basic understanding of Artificial Intelligence (AI) and Machine Learning (ML) concepts. Selection Process: Eligibility Criteria: 90% in 10th & 12th and 8 CGPA in graduation No Live Backlog",
        "Keys": [
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "stipend",
                "value": 25
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "role",
                "value": "Application SDE"
            },
            {
                "key": "percent",
                "value": 90
            },
            {
                "key": "cgpa",
                "value": 8
            }
        ]
    },
    {
        "Name": "Kickdrum",
        "description": "Kickdrum Kickdrum Job Role: Software Developer CTC: 16LPA [Rs.10 LPA (Fixed) + 2 LPA (Variable) + 2 LPA (Benefits, retirals) + 2 LPA (Special bonus payable post completion of one year of full-time employment)] Stipend: 35k Location: Bengaluru Position: Software Intern (KDU-er) • Work Location: Bengaluru (Monday - Friday in Office) • Eligibility Criteria: 80% and above in academics throughout. No backlogs. • Facilities: Food and Snacks in Office; 24x7 access • Leaves: 3 Paid & 3 Sick Leaves; Leaves for University Exams • BYOD: ₹ 2000/month for using your own device during Internship Position: Software Developer • Job Location: Bengaluru, 2 mandatory days in Office, • Eligibility Criteria: Successful completion of the 6 month Internship • Benefits: in-office meals, reimbursements for food orders, cab rides, and gym memberships. Health insurance for self, family, and parents, BYOD (Bring Your Own Device) options, annual health checkups, wellness programs, mentorship, and training. • Paid Leaves: 12 sick leaves, 15 earned leaves, and 15 public holidays. Roles and Responsibilities: • Develop complex web applications with responsive design techniques and industry-leading UX • Translate design mock-ups and prototypes into working applications • Work on cloud-based architectures that are highly scalable, available, and performant • Work with agile methodology using cutting-edge DevOps tools & technologies • Focus on code quality and deliver projects with high business impact Learn and apply new skills during your 6 months internship: • Amazon Web Services (AWS) • HTML/CSS/React (frontend) • Java/Spring, DotNet, Python, Node (backend) • Enterprise-grade software development • Working directly with execs and customers Upon successful completion of your internship you will be employed as a “Software Developer” at Kickdrum. Selection Process: Round 1: Online Assessment (2 Coding Que) 2HRs Round 2: Technical Interview I Round 3: Culture Round Round 4: HR Interview Eligibility: CS/IT group with 80% and above in their academics throughout. No backlogs.",
        "Keys": [
            {
                "key": "ctc_min",
                "value": 10
            },
            {
                "key": "ctc_max",
                "value": 16
            },
            {
                "key": "stipend",
                "value": 35
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "HSBC",
        "description": "HSBC HSBC Job Role: Software Development Engineer CTC: 9 LPA Interview Location: Pune Job Location: Pune / Hyderabad / Bangalore, subject to business requirements. Role: • Strong foundation in software development engineering, with proficiency in at least one object- oriented programming language such as Java, Python, etc. • Various OS like Android, Linux, and Databases like relational and no-SQL. • Liaising with business users, architects and other stakeholders in designing, implementing and maintaining best-in-class (scalable, loosely coupled and efficient) solutions which can run seamlessly across platforms/mobile/internet/cloud. • Continuous Integration (CI)/ Continuous Deployment (CD) pipeline and Agile methodology. • Any of Mobile, Analytics, Cloud and Digital technology domains. • Ability to design and implement solutions which can run on-prem, hybrid and multi-cloud ecosystems such as GCP, AWS, Azure, Ali Cloud. • Ability to harness open-source development thus leveraging collective wisdom and learning • Understanding of cyber threats/ vulnerabilities and applying secure coding standards and associated protocols. • Ability to leverage industry best integration patterns and practices to integrate multiple existing/ new building blocks for seamless end-to-end customer experience. • Developing, maintaining, and supporting current systems for better efficacy and higher availability. Selection Process: Round 1: Aptitude + Technical (75 Minutes) & Coding assessment (30 Minutes) Only the students who clear the Aptitude + Technical assessment, will be able to appear for the coding test. Round 2: Technical Interview (Pune) Round 3: HR Interview Eligibility Criteria: Min. 60% or 6.00 CGPA throughout (10th / 12th / Diploma / B.E. / B.Tech), No Live Backlog.",
        "Keys": [
            {
                "key": "ctc",
                "value": 9
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "location_3",
                "value": "Bangalore"
            },
            {
                "key": "role",
                "value": "Software Development Engineer"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "cgpa",
                "value": 6
            },
            {
                "key": "branch_1",
                "value": "Diploma"
            },
            {
                "key": "branch_2",
                "value": "B.E."
            },
            {
                "key": "branch_3",
                "value": "B.Tech"
            }
        ]
    },
    {
        "Name": "Nvidia",
        "description": "Nvidia NVIDIA Job Role: QA Tool and Test Development Intern. Stipend : 40k Location : Pune, Bangalore, Hyderabad What you will be doing: • The intern will help us build tools/utility /frameworks in C/C#/C++ that would automate and accelerate testing workÆows in the Åelds of Autonomous Vehicles, Robotics, 3D Simulation Platforms, GPU drivers, Cloud Computing and AI. • As a QA Tools and Test Development Intern at NVIDIA, you will collaborate with a team of talented engineers tackling some of the most complex challenges in cutting-edge technology. Mentored by the best minds in the industry, they will have the opportunity to make meaningful contributions to exciting and impactful projects. What we need to see: • Pursuing a graduate engineering course in Computer Science/ IT with strong academics. • Good Communication skills (interpersonal and across teams). • Excellent analytical and problem-solving skills. • Very organized, proactive, and has good learning ability. • Languages - C++/C#/.Net/Python • Ability to apply Object Oriented Programming concepts and Data structures knowledge Knowledge of SQL/NoSQL Database management tools • Ability to build applications using Generative AI APIs would be a plus • Would be a plus to have hands-on experience in development of Web Application (ASP.Net, MVC, web services). Skills to be Assessed : C++, C# Programming, Python, Linux, OOPS, DS, AI/ML/DL/Gen AI. Selection Process: Round 1: Online Assessment (Technical and Logic ques on HackerRank) Programming: Questions on C, VHDL, and Verilog programming Computer architecture: Questions on finite state machines, flip flop timing, and low power design Data compression: Questions on data compression and binary representations. Circuit design: Questions on circuit design using half/full adders. Clocks: Questions on clocks. Round 2: Technical Interview Round 3: HR Interview Eligibility Criteria: Min 80% in overall academics (10th, 12th, Graduation). CS/IT group only. No Live Backlog.",
        "Keys": [
            {
                "key": "stipend",
                "value": 40
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "location_2",
                "value": "Bangalore"
            },
            {
                "key": "location_3",
                "value": "Hyderabad"
            },
            {
                "key": "role",
                "value": "QA Tool and Test Development Intern"
            },
            {
                "key": "percent",
                "value": 80
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "Muthoot Finance",
        "description": "Role and Responsibility: Front line sales executive for Muthoot branches operations. Job Location: Muthoot branches (North, East & West) operations. Eligibility Criteria: Minimum Graduates / Graduation (last year) - Non Technical CTC: 1. Interns for 6 months. After the successful completion of internship, there will be performance evaluation and interns will get the PPO (Pre-Placement offer) accordingly. 2. Stipend INR 10000/- per month during internship period {will be registered under government scheme NAPS (National Apprenticeship Promotion) and NATS (National Apprenticeship Training)} 3. The internship period is for 6 months and after the successful completion of internship there will be performance evaluation for the placement in the Muthoot Payroll.",
        "Keys": [
            {
                "key": "company_name",
                "value": "Muthoot Finance"
            },
            {
                "key": "role",
                "value": "Front line sales executive"
            },
            {
                "key": "location_1",
                "value": "Muthoot branches"
            },
            {
                "key": "stipend",
                "value": 10
            },
            {
                "key": "branch_1",
                "value": "Non Technical"
            }
        ]
    },
    {
        "Name": "DeltaX",
        "description": "Role: Associate Product Engineer (Full Stack Developer) CTC: INR 7 Lakhs Per Annum Location: Bengaluru, Hyderabad and Pune Eligibility Criteria: • Btech (CS and IT) • Minimum overall 50% CGPA Engineering Culture & Practices • You will work in an agile SCRUM team. • Our teams follow BDD, REST, Continuous Integration and Continuous Delivery. • We operate hundreds of multi-tenant databases using MS SQL Server • C#, Vue.js and SQL are the common languages that our teams use. • Centralized monitoring across our entire stack using ELK Stack (Elasticsearch, Logstash, Kibana) Responsibilities • Write code :) • Ownership for the entire lifecycle of your code: development, test, production, and subsequent fixes and improvements. • Implement code that is clear, concise, tested, and easily understood by others. Selection Process: Round 1 Online Technical MCQ Test: Will cover fundamentals for Programming, Data Structures, Networking and Micro-processors. Expected No. of Questions: 50 Multiple Choice Questions. Assessment Duration: 45 Minutes. Difficulty level: Questions levels vary from easy to moderate. Round 2 Online Coding Assessment (any programming language) Helpful alert: Only serious coders will qualify Round 3 Technical Interview What we look for? Logical clarity Algorithm & Programming Concepts",
        "Keys": [
            {
                "key": "company_name",
                "value": "DeltaX"
            },
            {
                "key": "role",
                "value": "Associate Product Engineer (Full Stack Developer)"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "location_1",
                "value": "Bengaluru"
            },
            {
                "key": "location_2",
                "value": "Hyderabad"
            },
            {
                "key": "cgpa",
                "value": 50
            },
            {
                "key": "branch_1",
                "value": "CS"
            },
            {
                "key": "branch_2",
                "value": "IT"
            }
        ]
    },
    {
        "Name": "Innovaptive Inc",
        "description": "Role: Product Owner (Trainee) and Trainee – Implementation Consultant (Campus) Location: Hyderabad, India Travel Percentage: 0% - 10% Employment Type: Full-Time; Salaried Reports To: Senior/Principal Product Manager, Product Management Compensation: Competitive as per Indian Market standards We are looking for a Product Owner to drive one of Innovapptive's connected worker SaaS platform products. The connected worker platform brings the maintenance front-line workers, back-office and connected assets (IiOT) together on one unified platform to perform jobs better, faster, cheaper and safer. This person will be responsible for product roadmap planning and execution, from ideation to adoption for the connected worker Platform Products. We are aggressively expanding our market penetration into several industry verticals with a special focus on Oil & Gas, Utilities, Chemicals, Metals & Mining and Industrial Manufacturing. And we need a dynamic, fast-paced Product professional who can ideate, design, drive, build and deliver Product features at pace. How You Will Make an Impact: • Product Execution: Execute a high-impact product roadmap for one of the Connected Worker Platform Products on Cloud • Rapid Iteration and Execution: Champion a culture of speed and agility, driving rapid product iteration and execution. Set high bars for quality, efficiency, and speed-to-market. Break down complex problems into actionable steps, and relentlessly prioritize to deliver results quickly. • Cross-Functional Collaboration: Work closely with engineering to deliver high-quality products on time and within budget. • Data-Driven Decision Making: Utilize data analytics and metrics to make informed decisions. Monitor key product metrics and perform user behavior analysis to gain insights. Leverage data to iterate on features, optimize user experiences, and drive product success. • Startup Mindset: Thrive in a dynamic, fast-paced startup environment. Embrace ambiguity and take ownership of challenges. Display entrepreneurial spirit, innovative thinking, and a willingness to take calculated risks. Be adaptable, resilient, and results-oriented. What You Bring to The Team: As a Product Owner, you will be responsible for leading the development and execution of our Connected Worker Platform SaaS product roadmap. You will collaborate closely with cross-functional teams, including engineering, design, marketing, and sales, to define and deliver exceptional software solutions that meet the needs of our target customers. You will be a strategic thinker with a strong understanding of the B2B software market and possess the ability to translate customer insights into actionable product strategies. You will be a go-getter finding creative low-cost, high-value solutions and not stuck in analysis-paralysis. Basic Qualifications: • Bachelor's degree in a relevant field (Computer Science, Business, or a related discipline). • Strong analytical mindset with a data-driven approach to decision making. • Excellent communication, presentation, and influencing skills, with the ability to effectively convey complex ideas to technical and non-technical stakeholders. • Passion for startups, technology, and staying at the forefront of tech trends. • Ability to influence/persuade people to drive outcomes • Analytical experience including converting raw data into actionable insights and recommendations • Excellent communication skills – written and verbal • Exposure to AWS cloud services. • Business acumen able to discern and distill product requirements into platform services requirements and epics. • Experience with business cost-benefit analysis and requirements gathering. • Technical acumen able to assist with breaking down technical problems and finding root causes. What We Offer above work: • A positive, open, and highly-innovative environment and team • Entrepreneurial spirit with unlimited opportunity to grow • Opportunity to work with leading global brands on exciting and impactful projects • Competitive Base Pay • Best of plan on Vacation & Paid Time Off. • Provision of Medical Insurance for family - self, dependent, spouse, dependent children, parents/parent-in-laws • Paid Maternity and Paternity leave • Bi-annual reviews to ensure transparency and promoting high performance culture • OKR Driven Performance Development Environment • Learning & Development - access to wide range of e-Learning courses",
        "Keys": [
            {
                "key": "company_name",
                "value": "Innovaptive Inc"
            },
            {
                "key": "role",
                "value": "Product Owner (Trainee)"
            },
            {
                "key": "location_1",
                "value": "Hyderabad"
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            }
        ]
    },
    {
        "Name": "Raja Software Labs",
        "description": "About RSL: Raja Software Labs (RSL) is a software development consultancy, based in Pune. Our expertise is in helping companies ship high business impact, mission critical solutions. We develop software but are in the peace of mind business. We started in 2007 and have since shipped products for the world's most innovative companies, including Linked, Google, Nest, Vida Health. Our apps have had more than 200 million downloads. Role: Software Developer Package: - Rs. 7 Lakhs (Rupees Seven Lakhs per annum) Interview Process: Programming test (Evaluate programming skills of the students) Technical Interviews: 2-3 technical interviews evaluating the programming skills of the students.(DSA and OOPS Eligibility Criteria: - BE or equivalent -Knowledge of any programming language (C, C++, Java, Python, JavaScript, Ruby, C#, Swift, Objective-C, or any other) Graduation percentage: 60% and higher Branches allowed: Computer Science, IT, Electrical, EnTC, Mech Engineering (Graduate / Postgraduate).",
        "Keys": [
            {
                "key": "company_name",
                "value": "Raja Software Labs"
            },
            {
                "key": "role",
                "value": "Software Developer"
            },
            {
                "key": "location_1",
                "value": "Pune"
            },
            {
                "key": "ctc",
                "value": 7
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Computer Science"
            },
            {
                "key": "branch_2",
                "value": "IT"
            },
            {
                "key": "branch_3",
                "value": "Electrical"
            },
            {
                "key": "branch_4",
                "value": "EnTC"
            }
        ]
    },
    {
        "Name": "Hitachi Energy",
        "description": "Role: Management Trainee Internship Duration: 6 Months Stipend: Rs. 20,000 per month CTC: 6LPA (After successful completion of internship) Location: Chennai, Bangalore, Gurugram Eligibility Criteria- Eligible Stream EEE, CSE, ECE and Mechanical Eligible Aggregate 10th, 12th / Diploma & B.E – 70%",
        "Keys": [
            {
                "key": "company_name",
                "value": "Hitachi Energy"
            },
            {
                "key": "role",
                "value": "Management Trainee"
            },
            {
                "key": "stipend",
                "value": 20
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Chennai"
            },
            {
                "key": "location_2",
                "value": "Bangalore"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "EEE"
            },
            {
                "key": "branch_2",
                "value": "CSE"
            },
            {
                "key": "branch_3",
                "value": "ECE"
            },
            {
                "key": "branch_4",
                "value": "Mechanical"
            }
        ]
    },
    {
        "Name": "ALPHAWAVE SEMI",
        "description": "Job Description Looking for self-driven, motivated and skilled engineers looking to get exposure to all sides of IC building process more specifically DFT (Design for Testability) from high level architectural definition, through RTL coding, verification, Scan/MBIST/BSCAN insertion,pattern generation and validation, device bring-up for complex custom silicon and IP engagements. • As a DFT intern, candidate will have the opportunity to work in a fast-paced environment on multiple projects in different design stages: • Develop RTL code for DFT components generation. • Integrate custom made DFT logic for complex SoCs (System-On-Chip) and CoWoS (Chip-On-Wafer-On-Substrate) designs. • Perform Scan/MBIST/BSCAN insertion. • Perform ATPG and coverage analysis, simulate zero delay and SDF annotated test sequences. • Build verification test benches and write verification sequences. • Review static timing analysis reports and SDCs generations. • Design and implement automation using Perl and/or Python. Why would you want to join our team: Ability to get exposure to all disciplines of TEST (DFT, ATPG, RTL, DV, Device Bring-up) in IC design process. No \"side kick” tasks; you will be assigned a regular engineering scope of work. High possibility to get absorbed as the full-time engineer after internship subjected to performance and open positions. Qualifications Pursuing or Completed Bachelors or Master in Electronics/Electrical/Telecommunications/VLSI/Microelectronics Engineering only with 70% throughout in academics and zero active backlogs. Required skill set: o Strong Digital Fundamentals o Verilog and/or VHDL knowledge o Basics of DFT and exposure to Tessent/Synopsys TEST tools is a plus. o Perl, Python, TCL experience o C/C++, System Verilog is a plus. Desired Qualities o Self-starter and curious to learn new things. o Target oriented and motivated to figure out solutions to new problems. o Collaborative, team player Internship Details: • Eligibility: BTech/MTech in Electronics, Electrical, Telecommunications, VLSI, or Microelectronics Engineering • Minimum 70% academic score throughout No active backlogs • Position: Intern • Duration: 6 months to 1 year • Location: Bangalore/Pune • Stipend: INR 40,000 per month for BTech students ■ INR 50,000 per month for MTech students",
        "Keys": [
            {
                "key": "company_name",
                "value": "ALPHAWAVE SEMI"
            },
            {
                "key": "role",
                "value": "Intern"
            },
            {
                "key": "stipend_min",
                "value": 40
            },
            {
                "key": "stipend_max",
                "value": 50
            },
            {
                "key": "location_1",
                "value": "Bangalore"
            },
            {
                "key": "location_2",
                "value": "Pune"
            },
            {
                "key": "percent",
                "value": 70
            },
            {
                "key": "branch_1",
                "value": "Electronics"
            },
            {
                "key": "branch_2",
                "value": "Electrical"
            },
            {
                "key": "branch_3",
                "value": "Telecommunications"
            },
            {
                "key": "branch_4",
                "value": "VLSI"
            }
        ]
    },
    {
        "Name": "Adani Group",
        "description": "About Adani Group: Adani Group is one of the largest and fastest growing Conglomerate catering to a billion aspirations. The Group is a diversified organization in India with a market cap of over $133 Bn comprising 6 publicly traded companies. The company is a market leader in multiple sectors like Ports and Logistics, Power, Transmission, Renewables and Gas. CTC: 6LPA Eligibility Criteria: • Engineering graduates from disciplines across- (B.E./B.Tech.) from within the following different engineering streams (Civil, Electrical, Mechanical, Electronics (C&I), E&C, CS/IT, Industrial) • Minimum of 60% marks throughout in academics (10th, 12th, and Graduation level till third year) with no history of backlogs throughout the education Selection Process: 1. Online assessment to evaluate candidates on their cognitive 2. Domain ability followed by a technical and HR interview",
        "Keys": [
            {
                "key": "company_name",
                "value": "Adani Group"
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Civil"
            },
            {
                "key": "branch_2",
                "value": "Electrical"
            },
            {
                "key": "branch_3",
                "value": "Mechanical"
            },
            {
                "key": "branch_4",
                "value": "Electronics (C&I)"
            }
        ]
    },
    {
        "Name": "CEAT Tyres",
        "description": "About CEAT - Founded in 1958, CEAT is one of India's leading tyre brands and the flagship company of the RPG GROUP . Driven by the purpose of helping the world move safely and smartly, CEAT provides world-class products and services across 110+ countries. Job Role: GET(Graduate Engineering Trainee) • Functions –Manufacturing, Production • Package – 6 LPA ( CTC will be revised post confirmation after 1 yr)",
        "Keys": [
            {
                "key": "company_name",
                "value": "CEAT Tyres"
            },
            {
                "key": "role",
                "value": "GET(Graduate Engineering Trainee)"
            },
            {
                "key": "ctc",
                "value": 6
            }
        ]
    },
    {
        "Name": "Hexaware",
        "description": "• Location: Nagpur/Mumbai Eligibility • Must have 60% throughout • B.E./B.Tech – Mechanical, Electronics, Electrical, Instrumentation, Industrial Engineering, or similar background • 2022 pass outs / 2023 pass outs who have completed their academic credits only HEXAWARE About Us: At Hexaware, we're not just a global technology and business process services company; we're a community of 31,600+ Hexawarians dedicated to one singular purpose: creating smiles through the power of great people and technology. With a presence in 58 offices across 28 countries, we empower enterprises worldwide to embark on their digital transformation journey with unparalleled scale and speed. As an employer, we're more than just a workplace. We put our people first, foster diversity and inclusivity, and prioritize their growth through robust learning and development programs. Our Culture is a canvas for innovation as we work toward our shared vision of becoming the world's most loved digital transformation partner. Exciting, isn't it? Visit www.hexaware.com to join us in embracing the magic of technology, as we passionately advocate for its potential to transform lives today and shape a brighter future. Together, we'll make the digital world a better place. Role: Quality Assurance (Software Testing) CTC: 4,00,000 INR per annum on successful completion of Training. o Stipend of 15,000 INR per month for 6 months. o Service agreement for 3 years in lieu of 2 lakhs. What are we looking for? Good communication skills- Fluent in spoken & written English Team player and interpersonal relationship abilities High level of energy Right Attitude and the ability to thrive in a fast-paced environment",
        "Keys": [
            {
                "key": "company_name",
                "value": "Hexaware"
            },
            {
                "key": "role",
                "value": "Quality Assurance (Software Testing)"
            },
            {
                "key": "ctc",
                "value": 4
            },
            {
                "key": "stipend",
                "value": 15
            },
            {
                "key": "location_1",
                "value": "Nagpur"
            },
            {
                "key": "location_2",
                "value": "Mumbai"
            },
            {
                "key": "percent",
                "value": 60
            },
            {
                "key": "branch_1",
                "value": "Mechanical"
            },
            {
                "key": "branch_2",
                "value": "Electronics"
            },
            {
                "key": "branch_3",
                "value": "Electrical"
            },
            {
                "key": "branch_4",
                "value": "Instrumentation"
            }
        ]
    },
    {
        "Name": "ArcelorMittal Nippon Steel India Limited (AM/NS India)",
        "description": "Position: Graduate Engineer Trainee (GET) Function: Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining Location: Any of AM/NS India locations CTC: Incentives 6 LPA Lakhs per annum + other benefits such as Housing, Medical Insurance, Canteen facility, Travel facility, Hospitalization Coverage, Higher Education support, Mobile Phone Data Card, etc. as per company policies. Selection Process: Online Test followed by a Technical and Personal Interview Responsibilities: The Graduate Engineer Trainees will be on a training period for 12 months from the date of joining during which they will be assigned projects within the domain. A GET is designated with the opportunity to work in cutting- edge facilities, contributing to the entire steel manufacturing process. From iron making to downstream operations and crucial role in delivering high-quality steel products to the market. It's a chance to showcase one's expertise and make a significant impact in the industry. Educational Qualifications/Shortlisting Criteria: • B.E. / B.Tech (Electrical, Mechanical, Chemical, Electronics & Communication, Computer Science, Metallurgy, Mining) At least 65% throughout the academic career with no active backlogs during at the time of applying for the role. • 65% & above in SSC • 65% & above in HSC • 65% & above in B.E. / B.Tech all semesters • No live ATKT and no year drop/down. Behavioral Skills: • Strong interpersonal, problem solving and project management skills • Excellent communication and interpersonal skills • Analytical and data driven to ensure structured approach to a problem • Ability to work in a highly entrepreneurial environment. • Willing to relocate to any of AM/NS India locations across any technology.",
        "Keys": [
            {
                "key": "company_name",
                "value": "ArcelorMittal Nippon Steel India Limited"
            },
            {
                "key": "role",
                "value": "Graduate Engineer Trainee (GET)"
            },
            {
                "key": "ctc",
                "value": 6
            },
            {
                "key": "location_1",
                "value": "Any of AM/NS India locations"
            },
            {
                "key": "percent",
                "value": 65
            },
            {
                "key": "branch_1",
                "value": "Electrical"
            },
            {
                "key": "branch_2",
                "value": "Mechanical"
            },
            {
                "key": "branch_3",
                "value": "Chemical"
            },
            {
                "key": "branch_4",
                "value": "Electronics & Communication"
            }
        ]
    },
    {
        "Name": "Solar Industries",
        "description": "1. Position Title: IIoT Intern (Control Room) Post Duration: 6 Months Days of Work: 6 days a week (1 day rotational off) & 8 hours Rotational Shift Internship Type: Paid Job Location: Solar Plant (Chakdoh)",
        "Keys": [
            {
                "key": "company_name",
                "value": "Solar Industries"
            },
            {
                "key": "role",
                "value": "IIoT Intern (Control Room)"
            },
            {
                "key": "location_1",
                "value": "Solar Plant (Chakdoh)"
            }
        ]
    }
]